{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //STEP 20: NO NEED FOR MULTIPLE IMPUTATIONS///
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\UKB_PAPER9B_TDIPDDEMMORT",clear
{txt}
{com}. 
. capture drop AGE
{txt}
{com}. gen AGE=baselineage
{txt}(23 missing values generated)

{com}. 
. capture drop SEX
{txt}
{com}. gen SEX=sex
{txt}(20 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\UKB_PAPER9B_TDIPDDEMMORT.dta{rm}
saved
{p_end}

{com}. 
. save finaldata_unimputed, replace
{txt}{p 0 4 2}
file {bf}
finaldata_unimputed.dta{rm}
saved
{p_end}

{com}. 
. sort n_eid 
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_unimputed.dta{rm}
saved
{p_end}

{com}. 
. set matsize 11000
{txt}{bf:set matsize} ignored.
{p 4 4 2}
Matrix sizes are no longer limited by
{bf:c(matsize)} in modern Statas.
Matrix sizes are now limited by edition of Stata.
See {help limits} for more details.
{p_end}

{com}. 
. 
. stset Age_dementia, failure(dem_diag==1) enter(baselineage) id(n_eid) scale(1)

{txt}Survival-time data settings

{col 12}ID variable: {res}n_eid
{col 10}{txt}Failure event: {res}dem_diag==1
{col 1}{txt}Observed time interval: {res}(Age_dementia[_n-1], Age_dementia]
{col 6}{txt}Enter on or after: {res}time baselineage
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}    502,409{txt}  total observations
{res}         23{txt}  event time missing (Age_dementia>=.){col 61}PROBABLE ERROR
{res}        228{txt}  observations end on or before {bf:enter()}
{hline 74}
{res}    502,158{txt}  observations remaining, representing
{res}    502,158{txt}  subjects
{res}      7,668{txt}  failures in single-failure-per-subject data
{res}  6,208,727{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res} 37.41821
                                          {txt}Last observed exit t = {res} 87.63313
{txt}
{com}. 
. 
. keep n_eid AGE baselineage Age SEX RACE_ETHN  AD_PGS educationbr  smoking etsmoke townsend householdincome occupation packyearssmoke alcohol HDI_TOTALSCORE SS_friendsfamily SS_leisuresocial SS_abilityconfide srhbr allostatic METmin vitamind rdw comorbid bmi  LE8* POORCOGN householdsize Age_AD ad_diag Age_dementia dem_diag Age_PD PD_diag Age_death died withdrew sample* time* priordem  _t* _d* time* Age* n_262*_0_0 withdrew 
{txt}
{com}. 
. keep if sample_final==1
{txt}(138,746 observations deleted)

{com}. 
. save finaldata_unimputedfin, replace
{txt}{p 0 4 2}
file {bf}
finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. use finaldata_unimputedfin,clear
{txt}
{com}. 
. **TERTILE OF AD PGS**
. capture drop AD_PGStert
{txt}
{com}. xtile AD_PGStert=AD_PGS if sample_final==1, nq(3)
{txt}
{com}. 
. 
. **TERTILE OF LE8 TOTAL SCORE**********************************************
. 
. 
. capture drop LE8_TOTALSCOREtert
{txt}
{com}. xtile LE8_TOTALSCOREtert=LE8_TOTALSCORE if sample_final==1, nq(3)
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **SES: educationbr, householdincome, townsend, occupation
. 
. capture drop zeducationbr 
{txt}
{com}. egen zeducationbr=std(educationbr) if sample_final==1
{txt}(68,610 missing values generated)

{com}. 
. capture drop zhouseholdincome 
{txt}
{com}. egen zhouseholdincome=std(householdincome) if sample_final==1
{txt}(45,095 missing values generated)

{com}. 
. capture drop ztownsend
{txt}
{com}. egen ztownsend=std(townsend) if sample_final==1
{txt}
{com}. 
. capture drop ztownsendinv
{txt}
{com}. gen ztownsendinv=ztownsend*-1
{txt}
{com}. 
. 
. capture drop zoccupation
{txt}
{com}. egen zoccupation=std(occupation) if sample_final==1
{txt}(142,664 missing values generated)

{com}. 
. 
. capture drop zoccupationinv
{txt}
{com}. gen zoccupationinv=zoccupation*-1
{txt}(142,664 missing values generated)

{com}. 
. capture drop rowmissSES
{txt}
{com}. egen rowmissSES=rowmiss(zeducationbr zhouseholdincome ztownsendinv zoccupationinv)
{txt}
{com}. 
. tab rowmissSES

 {txt}rowmissSES {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    167,240       45.99       45.99
{txt}          1 {c |}{res}    136,477       37.53       83.52
{txt}          2 {c |}{res}     59,946       16.48      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    363,663      100.00
{txt}
{com}. 
. capture drop SES
{txt}
{com}. egen SES=rowmean(zeducationbr zhouseholdincome ztownsendinv zoccupationinv) if rowmissSES<=2
{txt}
{com}. 
. 
. save, replace  
{txt}{p 0 4 2}
file {bf}
finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. capture drop SESres
{txt}
{com}. reg SES townsend if sample_final==1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    > {res} 99999.00
{txt}       Model {c |} {res} 69504.6296         1  69504.6296   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 108100.891   363,661  .297257312   {txt}R-squared       ={res}    0.3913
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3913
{txt}       Total {c |} {res} 177605.521   363,662  .488380751   {txt}Root MSE        =   {res} .54521

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SES{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}townsend {c |}{col 14}{res}{space 2}-.1468266{col 26}{space 2} .0003036{col 37}{space 1} -483.55{col 46}{space 3}0.000{col 54}{space 4}-.1474218{col 67}{space 3}-.1462315
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2700191{col 26}{space 2} .0010123{col 37}{space 1} -266.74{col 46}{space 3}0.000{col 54}{space 4}-.2720032{col 67}{space 3} -.268035
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. predict SESres, resid
{txt}
{com}. 
. histogram SESres if sample_final==1
{txt}(bin={res}55{txt}, start={res}-1.5175215{txt}, width={res}.05965544{txt})
{res}{txt}
{com}. 
. 
. 
. save, replace  
{txt}{p 0 4 2}
file {bf}
finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. **************************************************************STEP 21: MAIN PART OF THE ANALYSIS: *************************
. capture log close
{smcl}
{com}{sf}{ul off}