{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. *****************************************TABLE 3: MULTISTATE REGRESSION MODELS OVERALL AND BY SEX*******************************
. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin",clear
{txt}
{com}. 
. **search and install msset**
. 
. 
. msset if sample_final==1,  id(n_eid) states(_d_PD _d_dementia _d_death) times (_t_PD _t_dementia _t_death) covariates(AGE ztownsend)
{res}Warning: 235 observations experienced events _d_PD and _d_dementia at the same time
         _d_dementia has been recoded to censored for these observations.
         They can be identified using _flag==1
Warning: 60 observations experienced events _d_PD and _d_death at the same time
         _d_death has been recoded to censored for these observations.
         They can be identified using _flag==1
Warning: 358 observations experienced events _d_dementia and _d_death at the same time
         _d_death has been recoded to censored for these observations.
         They can be identified using _flag==1
{txt}(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
variables AGE_trans1 to AGE_trans6 created
(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
(415,818 missing values generated)
variables ztownsend_trans1 to ztownsend_trans6 created

{com}. 
. mat tmat = r(transmatrix)
{txt}
{com}. 
. mat list tmat
{res}
{txt}tmat[4,4]
                           to:          to:          to:          to:
                        start        _d_PD  _d_dementia     _d_death
      from:start {res}           .            1            2            3
{txt}      from:_d_PD {res}           .            .            4            5
{txt}from:_d_dementia {res}           .            .            .            6
{txt}   from:_d_death {res}           .            .            .            .
{reset}
{com}. 
. msboxes, transmat(tmat) id(n_eid) xvalues(0.2 0.7 0.6 0.5) yvalues(0.7 0.6 1.2 0.2) ///
> statenames("Healthy" "PD" "Dementia" "Dead" )
{res}{txt}
{com}. 
. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE2.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE2.gph} saved

{com}. 
. gen _time = _stop - _start
{txt}(415,818 missing values generated)

{com}. 
. stset _stop if sample_final==1, enter(_start) failure(_status=1) scale(1)

{txt}Survival-time data settings

{col 10}Failure event: {res}_status==1
{col 1}{txt}Observed time interval: {res}(0, _stop]
{col 6}{txt}Enter on or after: {res}time _start
{col 6}{txt}Exit on or before: {res}failure
{col 7}{txt}Keep observations 
{col 17}{help j_st_ifvsoptif:{bf:if} {it:exp}}: {res}sample_final==1

{txt}{hline 74}
{res}  1,517,776{txt}  total observations
{res}    415,818{txt}  ignored at outset because of {bf:if} {it:exp}
{res}        620{txt}  observations end on or before {bf:enter()}
{hline 74}
{res}  1,101,338{txt}  observations remaining, representing
{res}     39,897{txt}  failures in single-record/single-failure data
{res} 79322238.6{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 87.63313
{txt}
{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin_MULTISTATE", replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin_MULTISTATE.dta{rm}
saved
{p_end}

{com}. 
. 
. *********This part takes a long time to run*******
. msaj, transmat(tmat) ci
{res}{txt}
{com}. line P_AJ_1* _t, sort connect(stairstep stairstep stairstep)
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3A.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3A.gph} saved

{com}. line P_AJ_2* _t, sort connect(stairstep stairstep stairstep)
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3B.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3B.gph} saved

{com}. line P_AJ_3* _t, sort connect(stairstep stairstep stairstep)
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3C.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3C.gph} saved

{com}. line P_AJ_4* _t, sort connect(stairstep stairstep stairstep)
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3D.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3D.gph} saved

{com}. 
. graph combine "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3A.gph" "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3B.gph" "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3C.gph" "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3D.gph"
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE3.gph} saved

{com}. 
. 
. 
. **Transition probability from state 2: PD**
. cap drop P_AJ*
{txt}
{com}. msaj, transmat(tmat) from(2) ltruncated(50) exit(85) ci
{err}Warning: Exit time is greater than last event time
{res}{txt}
{com}. line P_AJ_2* _t, sort connect(stairstep stairstep stairstep)
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4A.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4A.gph} saved

{com}. 
. **Transition probability from state 3: Dementia**
. cap drop P_AJ*
{txt}
{com}. msaj, transmat(tmat) from(3) ltruncated(50) exit(85) ci
{err}Warning: Exit time is greater than last event time
{res}{txt}
{com}. line P_AJ_3* _t, sort connect(stairstep stairstep stairstep)
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4B.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4B.gph} saved

{com}. 
. 
. graph combine "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4A.gph" "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4B.gph" 
{res}{txt}
{com}. graph save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4.gph",replace
{res}{txt}file {bf:E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\FIGURES\FIGURE4.gph} saved

{com}. 
. save "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin_MULTISTATE",replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin_MULTISTATE.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}