{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin_MULTISTATE",clear
{txt}
{com}. 
. 
. ********************MODEL 1: REDUCED MODEL***************************
. 
. 
. **Transition 1**
. 
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-25342.079}  
Iteration 2:{space 2}Log likelihood = {res: -24244.91}  
Iteration 3:{space 2}Log likelihood = {res:-22631.781}  
Iteration 4:{space 2}Log likelihood = {res:-22303.706}  
Iteration 5:{space 2}Log likelihood = {res:-21890.774}  
Iteration 6:{space 2}Log likelihood = {res:-21393.072}  
Iteration 7:{space 2}Log likelihood = {res:-20998.676}  
Iteration 8:{space 2}Log likelihood = {res:-20700.709}  
Iteration 9:{space 2}Log likelihood = {res:-20428.123}  
Iteration 10:{space 1}Log likelihood = {res:-20332.912}  
Iteration 11:{space 1}Log likelihood = {res:-20021.774}  
Iteration 12:{space 1}Log likelihood = {res:-19900.003}  
Iteration 13:{space 1}Log likelihood = {res:-19806.885}  
Iteration 14:{space 1}Log likelihood = {res:-19789.039}  
Iteration 15:{space 1}Log likelihood = {res:-19765.155}  
Iteration 16:{space 1}Log likelihood = {res:-19745.071}  
Iteration 17:{space 1}Log likelihood = {res:-19734.373}  
Iteration 18:{space 1}Log likelihood = {res:-19729.972}  
Iteration 19:{space 1}Log likelihood = {res:-19728.997}  
Iteration 20:{space 1}Log likelihood = {res:-19728.982}  
Iteration 21:{space 1}Log likelihood = {res:-19728.982}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-19728.982}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0554297{col 26}{space 2} .0204094{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 55}{space 3} .0154281{col 67}{space 3} .0954314
{col 1}{text}         SEX{col 14}{c |}{result}{space 2} -.659804{col 26}{space 2} .0421546{col 37}{space 1}  -15.65{col 46}{space 3}0.000{col 55}{space 3}-.7424255{col 67}{space 3}-.5771826
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0996494{col 26}{space 2} .0064017{col 37}{space 1}  -15.57{col 46}{space 3}0.000{col 55}{space 3}-.1121966{col 67}{space 3}-.0871023
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0501281{col 26}{space 2} .1095528{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 55}{space 3}-.1645915{col 67}{space 3} .2648477
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0162088{col 26}{space 2} .0159759{col 37}{space 1}    1.01{col 46}{space 3}0.310{col 55}{space 3}-.0151033{col 67}{space 3}  .047521
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0822736{col 26}{space 2} .0388777{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 55}{space 3}-.1584724{col 67}{space 3}-.0060747
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-73.95516{col 26}{space 2} 1.240519{col 37}{space 1}  -59.62{col 46}{space 3}0.000{col 55}{space 3}-76.38654{col 67}{space 3}-71.52379
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.870367{col 26}{space 2} .0194128{col 37}{space 1}  147.86{col 46}{space 3}0.000{col 55}{space 3} 2.832319{col 67}{space 3} 2.908416
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-19629.322}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0508355{col 26}{space 2} .0204554{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 55}{space 3} .0107436{col 67}{space 3} .0909274
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.6569425{col 26}{space 2} .0421658{col 37}{space 1}  -15.58{col 46}{space 3}0.000{col 55}{space 3} -.739586{col 67}{space 3}-.5742989
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0818752{col 26}{space 2} .0062385{col 37}{space 1}  -13.12{col 46}{space 3}0.000{col 55}{space 3}-.0941024{col 67}{space 3} -.069648
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0166633{col 26}{space 2} .1097004{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 55}{space 3}-.1983455{col 67}{space 3} .2316721
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0103582{col 26}{space 2} .0169011{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 55}{space 3}-.0227674{col 67}{space 3} .0434838
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0823192{col 26}{space 2} .0389084{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 55}{space 3}-.1585782{col 67}{space 3}-.0060602
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0827797{col 26}{space 2} .0065061{col 37}{space 1}   12.72{col 46}{space 3}0.000{col 55}{space 3} .0700281{col 67}{space 3} .0955314
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .1587173{col 26}{space 2} .4024996{col 37}{space 1}    0.39{col 46}{space 3}0.693{col 55}{space 3}-.6301674{col 67}{space 3}  .947602
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 2**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-54908.652}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-53401.607}  
Iteration 3:{space 2}Log likelihood = {res:-51678.803}  
Iteration 4:{space 2}Log likelihood = {res: -49666.97}  
Iteration 5:{space 2}Log likelihood = {res:-45717.473}  
Iteration 6:{space 2}Log likelihood = {res:-45137.351}  
Iteration 7:{space 2}Log likelihood = {res:-43736.759}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-43691.418}  
Iteration 9:{space 2}Log likelihood = {res:-43294.633}  
Iteration 10:{space 1}Log likelihood = {res:-42774.024}  
Iteration 11:{space 1}Log likelihood = {res:-42080.668}  
Iteration 12:{space 1}Log likelihood = {res:-41642.346}  
Iteration 13:{space 1}Log likelihood = {res:-41235.403}  
Iteration 14:{space 1}Log likelihood = {res:-40670.912}  
Iteration 15:{space 1}Log likelihood = {res:-40549.991}  
Iteration 16:{space 1}Log likelihood = {res:-40243.531}  
Iteration 17:{space 1}Log likelihood = {res:-40012.626}  
Iteration 18:{space 1}Log likelihood = {res:-39921.639}  
Iteration 19:{space 1}Log likelihood = {res:-39855.337}  
Iteration 20:{space 1}Log likelihood = {res: -39795.05}  
Iteration 21:{space 1}Log likelihood = {res:-39755.616}  
Iteration 22:{space 1}Log likelihood = {res:-39738.752}  
Iteration 23:{space 1}Log likelihood = {res:-39727.187}  
Iteration 24:{space 1}Log likelihood = {res:-39723.994}  
Iteration 25:{space 1}Log likelihood = {res:-39723.495}  
Iteration 26:{space 1}Log likelihood = {res:-39723.471}  
Iteration 27:{space 1}Log likelihood = {res: -39723.47}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-39723.47}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1940881{col 26}{space 2} .0124859{col 37}{space 1}   15.54{col 46}{space 3}0.000{col 55}{space 3} .1696162{col 67}{space 3} .2185601
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2138977{col 26}{space 2} .0265266{col 37}{space 1}   -8.06{col 46}{space 3}0.000{col 55}{space 3} -.265889{col 67}{space 3}-.1619065
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0882334{col 26}{space 2} .0047745{col 37}{space 1}  -18.48{col 46}{space 3}0.000{col 55}{space 3}-.0975913{col 67}{space 3}-.0788756
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .1200477{col 26}{space 2} .0692183{col 37}{space 1}    1.73{col 46}{space 3}0.083{col 55}{space 3}-.0156177{col 67}{space 3} .2557131
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0428759{col 26}{space 2} .0155073{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 55}{space 3}-.0732695{col 67}{space 3}-.0124822
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3757018{col 26}{space 2} .0264063{col 37}{space 1}  -14.23{col 46}{space 3}0.000{col 55}{space 3}-.4274572{col 67}{space 3}-.3239463
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-89.43892{col 26}{space 2} .9548453{col 37}{space 1}  -93.67{col 46}{space 3}0.000{col 55}{space 3}-91.31039{col 67}{space 3}-87.56746
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 3.049536{col 26}{space 2} .0124824{col 37}{space 1}  244.31{col 46}{space 3}0.000{col 55}{space 3} 3.025071{col 67}{space 3} 3.074001
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-39569.83}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}  .189797{col 26}{space 2} .0125199{col 37}{space 1}   15.16{col 46}{space 3}0.000{col 55}{space 3} .1652584{col 67}{space 3} .2143356
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2127207{col 26}{space 2} .0265327{col 37}{space 1}   -8.02{col 46}{space 3}0.000{col 55}{space 3}-.2647238{col 67}{space 3}-.1607176
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0933064{col 26}{space 2} .0046628{col 37}{space 1}  -20.01{col 46}{space 3}0.000{col 55}{space 3}-.1024454{col 67}{space 3}-.0841675
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0862833{col 26}{space 2} .0693017{col 37}{space 1}    1.25{col 46}{space 3}0.213{col 55}{space 3}-.0495455{col 67}{space 3} .2221121
{col 1}{text}households~e{col 14}{c |}{result}{space 2} -.054913{col 26}{space 2} .0160473{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 55}{space 3}-.0863652{col 67}{space 3}-.0234608
{col 1}{text}      SESres{col 14}{c |}{result}{space 2} -.375882{col 26}{space 2} .0264246{col 37}{space 1}  -14.22{col 46}{space 3}0.000{col 55}{space 3}-.4276733{col 67}{space 3}-.3240908
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0831728{col 26}{space 2} .0049061{col 37}{space 1}   16.95{col 46}{space 3}0.000{col 55}{space 3}  .073557{col 67}{space 3} .0927886
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .9512064{col 26}{space 2} .2993581{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 55}{space 3} .3644752{col 67}{space 3} 1.537938
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. **Transition 3**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-254494.89}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-215974.18}  (not concave)
Iteration 3:{space 2}Log likelihood = {res: -210092.5}  
Iteration 4:{space 2}Log likelihood = {res:-208365.69}  
Iteration 5:{space 2}Log likelihood = {res: -192570.3}  (not concave)
Iteration 6:{space 2}Log likelihood = {res:-190864.24}  
Iteration 7:{space 2}Log likelihood = {res:-187414.58}  
Iteration 8:{space 2}Log likelihood = {res:-183744.21}  
Iteration 9:{space 2}Log likelihood = {res:-178788.87}  
Iteration 10:{space 1}Log likelihood = {res:-177088.41}  
Iteration 11:{space 1}Log likelihood = {res:-171930.78}  
Iteration 12:{space 1}Log likelihood = {res: -169201.8}  
Iteration 13:{space 1}Log likelihood = {res:-168184.27}  (not concave)
Iteration 14:{space 1}Log likelihood = {res:-168103.51}  
Iteration 15:{space 1}Log likelihood = {res:-168026.44}  
Iteration 16:{space 1}Log likelihood = {res:-167396.69}  (not concave)
Iteration 17:{space 1}Log likelihood = {res:-167383.06}  
Iteration 18:{space 1}Log likelihood = {res:-167227.98}  
Iteration 19:{space 1}Log likelihood = {res: -167079.7}  
Iteration 20:{space 1}Log likelihood = {res:-166908.81}  
Iteration 21:{space 1}Log likelihood = {res:-166885.07}  
Iteration 22:{space 1}Log likelihood = {res:-166884.34}  
Iteration 23:{space 1}Log likelihood = {res:-166884.33}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-166884.33}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .2206318{col 26}{space 2} .0055411{col 37}{space 1}   39.82{col 46}{space 3}0.000{col 55}{space 3} .2097715{col 67}{space 3} .2314922
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5812138{col 26}{space 2} .0122162{col 37}{space 1}  -47.58{col 46}{space 3}0.000{col 55}{space 3}-.6051572{col 67}{space 3}-.5572705
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.1116721{col 26}{space 2}  .001674{col 37}{space 1}  -66.71{col 46}{space 3}0.000{col 55}{space 3}-.1149531{col 67}{space 3}-.1083911
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} -.148715{col 26}{space 2} .0331737{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 55}{space 3}-.2137343{col 67}{space 3}-.0836958
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0712787{col 26}{space 2} .0070298{col 37}{space 1}  -10.14{col 46}{space 3}0.000{col 55}{space 3}-.0850569{col 67}{space 3}-.0575004
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3578474{col 26}{space 2} .0114502{col 37}{space 1}  -31.25{col 46}{space 3}0.000{col 55}{space 3}-.3802894{col 67}{space 3}-.3354055
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-57.21966{col 26}{space 2}  .304751{col 37}{space 1} -187.76{col 46}{space 3}0.000{col 55}{space 3}-57.81696{col 67}{space 3}-56.62236
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.675973{col 26}{space 2} .0057448{col 37}{space 1}  465.81{col 46}{space 3}0.000{col 55}{space 3} 2.664714{col 67}{space 3} 2.687233
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-165469.45}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .2134938{col 26}{space 2} .0055596{col 37}{space 1}   38.40{col 46}{space 3}0.000{col 55}{space 3} .2025972{col 67}{space 3} .2243904
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5774186{col 26}{space 2} .0122154{col 37}{space 1}  -47.27{col 46}{space 3}0.000{col 55}{space 3}-.6013603{col 67}{space 3}-.5534769
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0778409{col 26}{space 2} .0016686{col 37}{space 1}  -46.65{col 46}{space 3}0.000{col 55}{space 3}-.0811114{col 67}{space 3}-.0745704
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1916572{col 26}{space 2} .0331958{col 37}{space 1}   -5.77{col 46}{space 3}0.000{col 55}{space 3}-.2567198{col 67}{space 3}-.1265945
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0883546{col 26}{space 2} .0071241{col 37}{space 1}  -12.40{col 46}{space 3}0.000{col 55}{space 3}-.1023176{col 67}{space 3}-.0743916
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3536354{col 26}{space 2} .0114683{col 37}{space 1}  -30.84{col 46}{space 3}0.000{col 55}{space 3}-.3761128{col 67}{space 3}-.3311579
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2}  .079046{col 26}{space 2} .0015478{col 37}{space 1}   51.07{col 46}{space 3}0.000{col 55}{space 3} .0760124{col 67}{space 3} .0820796
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.603742{col 26}{space 2} .1102941{col 37}{space 1}   23.61{col 46}{space 3}0.000{col 55}{space 3}  2.38757{col 67}{space 3} 2.819915
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 4**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res:-1346.2431}  
Iteration 2:{space 2}Log likelihood = {res:-1291.8165}  
Iteration 3:{space 2}Log likelihood = {res:-1291.2828}  
Iteration 4:{space 2}Log likelihood = {res:-1289.5198}  (not concave)
Iteration 5:{space 2}Log likelihood = {res:-1289.5159}  (not concave)
Iteration 6:{space 2}Log likelihood = {res:-1289.5121}  (not concave)
Iteration 7:{space 2}Log likelihood = {res:-1289.5094}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-1289.5068}  (not concave)
Iteration 9:{space 2}Log likelihood = {res:-1289.5056}  (not concave)
Iteration 10:{space 1}Log likelihood = {res:-1289.5047}  
Iteration 11:{space 1}Log likelihood = {res:-1289.3478}  
Iteration 12:{space 1}Log likelihood = {res: -1289.141}  
Iteration 13:{space 1}Log likelihood = {res:-1288.7331}  
Iteration 14:{space 1}Log likelihood = {res:-1288.5612}  
Iteration 15:{space 1}Log likelihood = {res:-1287.8467}  
Iteration 16:{space 1}Log likelihood = {res:-1287.0707}  
Iteration 17:{space 1}Log likelihood = {res:-1286.6099}  
Iteration 18:{space 1}Log likelihood = {res:-1286.0499}  
Iteration 19:{space 1}Log likelihood = {res:-1285.9887}  
Iteration 20:{space 1}Log likelihood = {res: -1285.621}  (not concave)
Iteration 21:{space 1}Log likelihood = {res:-1285.6146}  
Iteration 22:{space 1}Log likelihood = {res:-1285.4762}  
Iteration 23:{space 1}Log likelihood = {res:-1285.2796}  
Iteration 24:{space 1}Log likelihood = {res:-1285.0274}  
Iteration 25:{space 1}Log likelihood = {res:-1284.6916}  
Iteration 26:{space 1}Log likelihood = {res:-1284.4768}  
Iteration 27:{space 1}Log likelihood = {res:-1284.3422}  
Iteration 28:{space 1}Log likelihood = {res:-1284.1797}  
Iteration 29:{space 1}Log likelihood = {res:-1284.1009}  
Iteration 30:{space 1}Log likelihood = {res:-1283.9839}  
Iteration 31:{space 1}Log likelihood = {res:-1283.8678}  (not concave)
Iteration 32:{space 1}Log likelihood = {res:-1283.8509}  
Iteration 33:{space 1}Log likelihood = {res:-1283.8434}  
Iteration 34:{space 1}Log likelihood = {res:-1283.8198}  
Iteration 35:{space 1}Log likelihood = {res:-1283.8138}  
Iteration 36:{space 1}Log likelihood = {res:-1283.8083}  
Iteration 37:{space 1}Log likelihood = {res:-1283.8082}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.8082}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0577124{col 26}{space 2} .0570768{col 37}{space 1}   -1.01{col 46}{space 3}0.312{col 55}{space 3}-.1695808{col 67}{space 3}  .054156
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}  -.28368{col 26}{space 2} .1186501{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 55}{space 3}  -.51623{col 67}{space 3}  -.05113
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} .0108598{col 26}{space 2} .0264072{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 55}{space 3}-.0408974{col 67}{space 3} .0626169
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .5655437{col 26}{space 2} .2802234{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 55}{space 3} .0163159{col 67}{space 3} 1.114771
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2040182{col 26}{space 2} .0821015{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 55}{space 3}-.3649343{col 67}{space 3}-.0431022
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1803591{col 26}{space 2} .1124275{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 55}{space 3}-.4007131{col 67}{space 3} .0399948
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-29.34051{col 26}{space 2} 6.060793{col 37}{space 1}   -4.84{col 46}{space 3}0.000{col 55}{space 3}-41.21945{col 67}{space 3}-17.46157
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.895988{col 26}{space 2} .2486553{col 37}{space 1}    7.62{col 46}{space 3}0.000{col 55}{space 3} 1.408633{col 67}{space 3} 2.383344
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.3418}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0563371{col 26}{space 2} .0572045{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 55}{space 3}-.1684559{col 67}{space 3} .0557817
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2840425{col 26}{space 2} .1186709{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 55}{space 3}-.5166333{col 67}{space 3}-.0514518
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0100122{col 26}{space 2} .0527023{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 55}{space 3}-.1133067{col 67}{space 3} .0932823
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .5619825{col 26}{space 2} .2801726{col 37}{space 1}    2.01{col 46}{space 3}0.045{col 55}{space 3} .0128543{col 67}{space 3} 1.111111
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2019315{col 26}{space 2} .0823442{col 37}{space 1}   -2.45{col 46}{space 3}0.014{col 55}{space 3}-.3633232{col 67}{space 3}-.0405398
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1800558{col 26}{space 2} .1124459{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 55}{space 3}-.4004456{col 67}{space 3}  .040334
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0073833{col 26}{space 2} .0285255{col 37}{space 1}    0.26{col 46}{space 3}0.796{col 55}{space 3}-.0485256{col 67}{space 3} .0632922
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .9869197{col 26}{space 2}  2.78705{col 37}{space 1}    0.35{col 46}{space 3}0.723{col 55}{space 3}-4.475598{col 67}{space 3} 6.449438
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. **Transition 5**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res:-1997.1874}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-1993.8684}  
Iteration 3:{space 2}Log likelihood = {res:-1973.0828}  
Iteration 4:{space 2}Log likelihood = {res: -1972.206}  
Iteration 5:{space 2}Log likelihood = {res:-1972.1286}  
Iteration 6:{space 2}Log likelihood = {res:-1971.2578}  (not concave)
Iteration 7:{space 2}Log likelihood = {res:-1971.2446}  
Iteration 8:{space 2}Log likelihood = {res:-1970.9783}  
Iteration 9:{space 2}Log likelihood = {res:-1970.5854}  
Iteration 10:{space 1}Log likelihood = {res:-1969.8401}  
Iteration 11:{space 1}Log likelihood = {res:-1969.4552}  
Iteration 12:{space 1}Log likelihood = {res: -1968.577}  
Iteration 13:{space 1}Log likelihood = {res: -1967.511}  
Iteration 14:{space 1}Log likelihood = {res:-1967.2165}  
Iteration 15:{space 1}Log likelihood = {res: -1966.742}  
Iteration 16:{space 1}Log likelihood = {res: -1965.919}  
Iteration 17:{space 1}Log likelihood = {res:-1965.0154}  
Iteration 18:{space 1}Log likelihood = {res:-1964.7378}  
Iteration 19:{space 1}Log likelihood = {res:-1963.9291}  
Iteration 20:{space 1}Log likelihood = {res: -1963.774}  
Iteration 21:{space 1}Log likelihood = {res:-1962.8571}  
Iteration 22:{space 1}Log likelihood = {res:-1962.7174}  
Iteration 23:{space 1}Log likelihood = {res:-1962.4289}  
Iteration 24:{space 1}Log likelihood = {res:-1962.2441}  
Iteration 25:{space 1}Log likelihood = {res:-1962.0911}  
Iteration 26:{space 1}Log likelihood = {res:-1961.9721}  
Iteration 27:{space 1}Log likelihood = {res:-1961.8679}  
Iteration 28:{space 1}Log likelihood = {res:-1961.7613}  
Iteration 29:{space 1}Log likelihood = {res: -1961.754}  
Iteration 30:{space 1}Log likelihood = {res: -1961.726}  
Iteration 31:{space 1}Log likelihood = {res:-1961.7204}  
Iteration 32:{space 1}Log likelihood = {res: -1961.718}  
Iteration 33:{space 1}Log likelihood = {res:-1961.7174}  
Iteration 34:{space 1}Log likelihood = {res:-1961.7174}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1961.7174}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0292803{col 26}{space 2} .0416709{col 37}{space 1}    0.70{col 46}{space 3}0.482{col 55}{space 3}-.0523931{col 67}{space 3} .1109538
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3617219{col 26}{space 2} .0912473{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 55}{space 3}-.5405634{col 67}{space 3}-.1828805
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0056718{col 26}{space 2} .0197074{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 55}{space 3}-.0442976{col 67}{space 3} .0329539
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1328944{col 26}{space 2} .2658644{col 37}{space 1}   -0.50{col 46}{space 3}0.617{col 55}{space 3} -.653979{col 67}{space 3} .3881903
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0208096{col 26}{space 2} .0382803{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 55}{space 3}-.0958376{col 67}{space 3} .0542185
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0426207{col 26}{space 2} .0814254{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 55}{space 3}-.2022115{col 67}{space 3} .1169701
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-28.43968{col 26}{space 2} 4.564981{col 37}{space 1}   -6.23{col 46}{space 3}0.000{col 55}{space 3}-37.38688{col 67}{space 3}-19.49248
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.913479{col 26}{space 2} .1846626{col 37}{space 1}   10.36{col 46}{space 3}0.000{col 55}{space 3} 1.551547{col 67}{space 3} 2.275411
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1958.3477}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0248747{col 26}{space 2} .0417049{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 55}{space 3}-.0568653{col 67}{space 3} .1066148
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3608535{col 26}{space 2} .0912476{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 55}{space 3}-.5396955{col 67}{space 3}-.1820115
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0225092{col 26}{space 2} .0281832{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 55}{space 3}-.0777472{col 67}{space 3} .0327288
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1391442{col 26}{space 2} .2661179{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 55}{space 3}-.6607257{col 67}{space 3} .3824373
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0232832{col 26}{space 2} .0390685{col 37}{space 1}   -0.60{col 46}{space 3}0.551{col 55}{space 3}-.0998559{col 67}{space 3} .0532896
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0463451{col 26}{space 2}  .081399{col 37}{space 1}   -0.57{col 46}{space 3}0.569{col 55}{space 3}-.2058841{col 67}{space 3}  .113194
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0120337{col 26}{space 2} .0200817{col 37}{space 1}    0.60{col 46}{space 3}0.549{col 55}{space 3}-.0273256{col 67}{space 3} .0513931
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 1.937505{col 26}{space 2} 1.565545{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 55}{space 3}-1.130907{col 67}{space 3} 5.005917
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 6**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-13845.309}  
Iteration 1:{space 2}Log likelihood = {res:-6785.8678}  
Iteration 2:{space 2}Log likelihood = {res:-6706.3638}  
Iteration 3:{space 2}Log likelihood = {res:-6706.3088}  
Iteration 4:{space 2}Log likelihood = {res:-6704.5051}  (not concave)
Iteration 5:{space 2}Log likelihood = {res:-6704.4996}  
Iteration 6:{space 2}Log likelihood = {res:-6704.2319}  
Iteration 7:{space 2}Log likelihood = {res:-6701.9758}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-6701.8393}  (not concave)
Iteration 9:{space 2}Log likelihood = {res:-6701.8322}  (not concave)
Iteration 10:{space 1}Log likelihood = {res:-6701.8261}  (not concave)
Iteration 11:{space 1}Log likelihood = {res:-6701.8229}  (not concave)
Iteration 12:{space 1}Log likelihood = {res:-6701.8204}  
Iteration 13:{space 1}Log likelihood = {res:-6701.3428}  
Iteration 14:{space 1}Log likelihood = {res:-6700.7428}  
Iteration 15:{space 1}Log likelihood = {res:-6699.6459}  
Iteration 16:{space 1}Log likelihood = {res:-6699.0925}  
Iteration 17:{space 1}Log likelihood = {res:-6697.9757}  
Iteration 18:{space 1}Log likelihood = {res:-6696.2028}  
Iteration 19:{space 1}Log likelihood = {res:-6695.3939}  
Iteration 20:{space 1}Log likelihood = {res:-6694.9902}  
Iteration 21:{space 1}Log likelihood = {res:-6694.3303}  
Iteration 22:{space 1}Log likelihood = {res:-6693.9679}  
Iteration 23:{space 1}Log likelihood = {res:-6693.4878}  
Iteration 24:{space 1}Log likelihood = {res: -6693.086}  
Iteration 25:{space 1}Log likelihood = {res:-6692.7697}  
Iteration 26:{space 1}Log likelihood = {res:-6692.5055}  
Iteration 27:{space 1}Log likelihood = {res:-6692.3853}  
Iteration 28:{space 1}Log likelihood = {res:-6692.2399}  
Iteration 29:{space 1}Log likelihood = {res:-6692.1837}  
Iteration 30:{space 1}Log likelihood = {res:-6692.1223}  
Iteration 31:{space 1}Log likelihood = {res:-6692.1042}  
Iteration 32:{space 1}Log likelihood = {res:-6692.0995}  
Iteration 33:{space 1}Log likelihood = {res: -6692.099}  
Iteration 34:{space 1}Log likelihood = {res:-6692.0989}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-6692.0989}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0120126{col 26}{space 2} .0187731{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 55}{space 3} -.024782{col 67}{space 3} .0488071
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3545592{col 26}{space 2} .0407501{col 37}{space 1}   -8.70{col 46}{space 3}0.000{col 55}{space 3} -.434428{col 67}{space 3}-.2746904
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} .0021943{col 26}{space 2} .0097735{col 37}{space 1}    0.22{col 46}{space 3}0.822{col 55}{space 3}-.0169614{col 67}{space 3} .0213499
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2058966{col 26}{space 2} .1108966{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 55}{space 3}-.4232499{col 67}{space 3} .0114567
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0025245{col 26}{space 2}  .020574{col 37}{space 1}    0.12{col 46}{space 3}0.902{col 55}{space 3}-.0377998{col 67}{space 3} .0428489
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0852251{col 26}{space 2} .0415491{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 55}{space 3}-.1666598{col 67}{space 3}-.0037904
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} -16.3837{col 26}{space 2} 2.259221{col 37}{space 1}   -7.25{col 46}{space 3}0.000{col 55}{space 3}-20.81169{col 67}{space 3}-11.95571
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.424086{col 26}{space 2} .1466074{col 37}{space 1}    9.71{col 46}{space 3}0.000{col 55}{space 3}  1.13674{col 67}{space 3} 1.711431
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}{err}convergence not achieved
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-6691.4493}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0115961{col 26}{space 2} .0187898{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 55}{space 3}-.0252312{col 67}{space 3} .0484234
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3545608{col 26}{space 2} .0407562{col 37}{space 1}   -8.70{col 46}{space 3}0.000{col 55}{space 3}-.4344415{col 67}{space 3}-.2746802
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0006456{col 26}{space 2} .0214694{col 37}{space 1}   -0.03{col 46}{space 3}0.976{col 55}{space 3}-.0427247{col 67}{space 3} .0414336
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2063351{col 26}{space 2} .1109552{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 55}{space 3}-.4238033{col 67}{space 3}  .011133
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0024061{col 26}{space 2} .0206016{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 55}{space 3}-.0379724{col 67}{space 3} .0427845
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0839641{col 26}{space 2} .0415717{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 55}{space 3}-.1654431{col 67}{space 3} -.002485
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} 9.49e-06{col 26}{space 2} .0000746{col 37}{space 1}    0.13{col 46}{space 3}0.899{col 55}{space 3}-.0001367{col 67}{space 3} .0001557
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 5.837256{col 26}{space 2} 2.423423{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 55}{space 3} 1.087433{col 67}{space 3} 10.58708
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. 
. ********************MODEL 2: FULL MODEL***************************
. 
. 
. **Transition 1**
. 
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-25342.074}  
Iteration 2:{space 2}Log likelihood = {res:-24244.178}  
Iteration 3:{space 2}Log likelihood = {res:-22629.961}  
Iteration 4:{space 2}Log likelihood = {res:-22300.836}  
Iteration 5:{space 2}Log likelihood = {res:-21881.703}  
Iteration 6:{space 2}Log likelihood = {res:-21423.873}  
Iteration 7:{space 2}Log likelihood = {res:-20866.227}  
Iteration 8:{space 2}Log likelihood = {res:-20651.827}  
Iteration 9:{space 2}Log likelihood = {res:-20389.504}  
Iteration 10:{space 1}Log likelihood = {res:-20307.228}  
Iteration 11:{space 1}Log likelihood = {res:-19984.702}  (not concave)
Iteration 12:{space 1}Log likelihood = {res:-19982.641}  
Iteration 13:{space 1}Log likelihood = {res:-19941.492}  
Iteration 14:{space 1}Log likelihood = {res:-19894.145}  
Iteration 15:{space 1}Log likelihood = {res:-19825.474}  
Iteration 16:{space 1}Log likelihood = {res:-19801.187}  
Iteration 17:{space 1}Log likelihood = {res:-19753.353}  
Iteration 18:{space 1}Log likelihood = {res: -19749.03}  
Iteration 19:{space 1}Log likelihood = {res:-19735.784}  (not concave)
Iteration 20:{space 1}Log likelihood = {res:-19735.507}  
Iteration 21:{space 1}Log likelihood = {res:-19735.074}  
Iteration 22:{space 1}Log likelihood = {res:-19729.332}  
Iteration 23:{space 1}Log likelihood = {res:-19728.713}  
Iteration 24:{space 1}Log likelihood = {res:-19728.551}  
Iteration 25:{space 1}Log likelihood = {res:-19728.545}  
Iteration 26:{space 1}Log likelihood = {res:-19728.545}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-19728.545}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0580375{col 26}{space 2} .0205981{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 55}{space 3}  .017666{col 67}{space 3}  .098409
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2}-.0200661{col 26}{space 2} .0214728{col 37}{space 1}   -0.93{col 46}{space 3}0.350{col 55}{space 3}-.0621521{col 67}{space 3} .0220199
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.6633901{col 26}{space 2} .0423301{col 37}{space 1}  -15.67{col 46}{space 3}0.000{col 55}{space 3}-.7463557{col 67}{space 3}-.5804246
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0996851{col 26}{space 2} .0064015{col 37}{space 1}  -15.57{col 46}{space 3}0.000{col 55}{space 3}-.1122318{col 67}{space 3}-.0871384
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0516846{col 26}{space 2} .1095661{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 55}{space 3}-.1630609{col 67}{space 3} .2664302
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0163087{col 26}{space 2} .0159622{col 37}{space 1}    1.02{col 46}{space 3}0.307{col 55}{space 3}-.0149766{col 67}{space 3}  .047594
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0870395{col 26}{space 2} .0392027{col 37}{space 1}   -2.22{col 46}{space 3}0.026{col 55}{space 3}-.1638754{col 67}{space 3}-.0102035
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-73.93472{col 26}{space 2} 1.240594{col 37}{space 1}  -59.60{col 46}{space 3}0.000{col 55}{space 3}-76.36624{col 67}{space 3} -71.5032
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.870194{col 26}{space 2} .0194158{col 37}{space 1}  147.83{col 46}{space 3}0.000{col 55}{space 3} 2.832139{col 67}{space 3} 2.908248
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-19628.934}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}  .053296{col 26}{space 2} .0206441{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 55}{space 3} .0128344{col 67}{space 3} .0937576
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2}-.0189236{col 26}{space 2} .0214824{col 37}{space 1}   -0.88{col 46}{space 3}0.378{col 55}{space 3}-.0610283{col 67}{space 3} .0231811
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.6603052{col 26}{space 2} .0423397{col 37}{space 1}  -15.60{col 46}{space 3}0.000{col 55}{space 3}-.7432895{col 67}{space 3} -.577321
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0819024{col 26}{space 2} .0062386{col 37}{space 1}  -13.13{col 46}{space 3}0.000{col 55}{space 3}-.0941299{col 67}{space 3} -.069675
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0181459{col 26}{space 2} .1097141{col 37}{space 1}    0.17{col 46}{space 3}0.869{col 55}{space 3}-.1968898{col 67}{space 3} .2331816
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0104758{col 26}{space 2} .0168896{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 55}{space 3}-.0226271{col 67}{space 3} .0435787
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0868337{col 26}{space 2} .0392367{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 55}{space 3}-.1637363{col 67}{space 3}-.0099312
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0826981{col 26}{space 2} .0065057{col 37}{space 1}   12.71{col 46}{space 3}0.000{col 55}{space 3} .0699472{col 67}{space 3} .0954489
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}  .165417{col 26}{space 2} .4025912{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 55}{space 3}-.6236473{col 67}{space 3} .9544813
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 2**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-54908.548}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-53384.942}  
Iteration 3:{space 2}Log likelihood = {res:-51665.042}  
Iteration 4:{space 2}Log likelihood = {res:-48654.182}  
Iteration 5:{space 2}Log likelihood = {res:-46880.474}  
Iteration 6:{space 2}Log likelihood = {res:-44672.371}  
Iteration 7:{space 2}Log likelihood = {res:-44174.876}  
Iteration 8:{space 2}Log likelihood = {res:-43457.089}  
Iteration 9:{space 2}Log likelihood = {res:-42570.363}  
Iteration 10:{space 1}Log likelihood = {res:-42232.332}  
Iteration 11:{space 1}Log likelihood = {res: -41363.68}  
Iteration 12:{space 1}Log likelihood = {res: -41193.82}  
Iteration 13:{space 1}Log likelihood = {res: -40623.66}  
Iteration 14:{space 1}Log likelihood = {res:-40495.436}  
Iteration 15:{space 1}Log likelihood = {res:-40385.868}  
Iteration 16:{space 1}Log likelihood = {res:-39967.598}  (not concave)
Iteration 17:{space 1}Log likelihood = {res:-39963.496}  
Iteration 18:{space 1}Log likelihood = {res:-39909.751}  
Iteration 19:{space 1}Log likelihood = {res:-39794.719}  
Iteration 20:{space 1}Log likelihood = {res:-39709.546}  
Iteration 21:{space 1}Log likelihood = {res:-39684.393}  (not concave)
Iteration 22:{space 1}Log likelihood = {res:-39683.512}  
Iteration 23:{space 1}Log likelihood = {res:-39678.028}  
Iteration 24:{space 1}Log likelihood = {res:-39672.181}  
Iteration 25:{space 1}Log likelihood = {res:-39671.201}  
Iteration 26:{space 1}Log likelihood = {res:-39671.199}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-39671.199}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1745436{col 26}{space 2} .0126423{col 37}{space 1}   13.81{col 46}{space 3}0.000{col 55}{space 3} .1497651{col 67}{space 3}  .199322
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1414543{col 26}{space 2} .0138028{col 37}{space 1}   10.25{col 46}{space 3}0.000{col 55}{space 3} .1144013{col 67}{space 3} .1685073
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.1931735{col 26}{space 2} .0265976{col 37}{space 1}   -7.26{col 46}{space 3}0.000{col 55}{space 3}-.2453039{col 67}{space 3}-.1410432
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0878822{col 26}{space 2}  .004776{col 37}{space 1}  -18.40{col 46}{space 3}0.000{col 55}{space 3} -.097243{col 67}{space 3}-.0785215
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .1103445{col 26}{space 2}  .069215{col 37}{space 1}    1.59{col 46}{space 3}0.111{col 55}{space 3}-.0253144{col 67}{space 3} .2460034
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0443916{col 26}{space 2} .0155771{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 55}{space 3}-.0749221{col 67}{space 3}-.0138611
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3394342{col 26}{space 2} .0266846{col 37}{space 1}  -12.72{col 46}{space 3}0.000{col 55}{space 3} -.391735{col 67}{space 3}-.2871333
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} -89.6334{col 26}{space 2} .9557484{col 37}{space 1}  -93.78{col 46}{space 3}0.000{col 55}{space 3}-91.50663{col 67}{space 3}-87.76017
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 3.051023{col 26}{space 2} .0124714{col 37}{space 1}  244.64{col 46}{space 3}0.000{col 55}{space 3} 3.026579{col 67}{space 3} 3.075466
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-39516.169}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1700112{col 26}{space 2} .0126758{col 37}{space 1}   13.41{col 46}{space 3}0.000{col 55}{space 3}  .145167{col 67}{space 3} .1948554
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1433443{col 26}{space 2} .0138042{col 37}{space 1}   10.38{col 46}{space 3}0.000{col 55}{space 3} .1162885{col 67}{space 3} .1704001
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.1919812{col 26}{space 2} .0266007{col 37}{space 1}   -7.22{col 46}{space 3}0.000{col 55}{space 3}-.2441175{col 67}{space 3}-.1398448
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} -.093113{col 26}{space 2} .0046629{col 37}{space 1}  -19.97{col 46}{space 3}0.000{col 55}{space 3}-.1022521{col 67}{space 3}-.0839738
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0762335{col 26}{space 2} .0692966{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 55}{space 3}-.0595853{col 67}{space 3} .2120524
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0564376{col 26}{space 2} .0160941{col 37}{space 1}   -3.51{col 46}{space 3}0.000{col 55}{space 3}-.0879815{col 67}{space 3}-.0248937
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3390235{col 26}{space 2} .0267047{col 37}{space 1}  -12.70{col 46}{space 3}0.000{col 55}{space 3}-.3913637{col 67}{space 3}-.2866834
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0837442{col 26}{space 2} .0049121{col 37}{space 1}   17.05{col 46}{space 3}0.000{col 55}{space 3} .0741168{col 67}{space 3} .0933717
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .8995532{col 26}{space 2} .2993041{col 37}{space 1}    3.01{col 46}{space 3}0.003{col 55}{space 3} .3129279{col 67}{space 3} 1.486179
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. **Transition 3**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-254476.82}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-215928.65}  (not concave)
Iteration 3:{space 2}Log likelihood = {res:-209546.32}  (not concave)
Iteration 4:{space 2}Log likelihood = {res:-207764.86}  
Iteration 5:{space 2}Log likelihood = {res:-202868.71}  
Iteration 6:{space 2}Log likelihood = {res:-188785.22}  
Iteration 7:{space 2}Log likelihood = {res: -185698.7}  
Iteration 8:{space 2}Log likelihood = {res:-181280.51}  
Iteration 9:{space 2}Log likelihood = {res:-177853.12}  
Iteration 10:{space 1}Log likelihood = {res:-174913.29}  
Iteration 11:{space 1}Log likelihood = {res: -170931.4}  
Iteration 12:{space 1}Log likelihood = {res:-170262.41}  
Iteration 13:{space 1}Log likelihood = {res:-167341.98}  (not concave)
Iteration 14:{space 1}Log likelihood = {res:-167295.53}  
Iteration 15:{space 1}Log likelihood = {res:-167091.67}  
Iteration 16:{space 1}Log likelihood = {res:-166445.63}  (not concave)
Iteration 17:{space 1}Log likelihood = {res: -166440.8}  
Iteration 18:{space 1}Log likelihood = {res: -166255.1}  
Iteration 19:{space 1}Log likelihood = {res:-166075.26}  
Iteration 20:{space 1}Log likelihood = {res:-165810.51}  
Iteration 21:{space 1}Log likelihood = {res:-165773.51}  
Iteration 22:{space 1}Log likelihood = {res:-165757.86}  
Iteration 23:{space 1}Log likelihood = {res:-165756.82}  
Iteration 24:{space 1}Log likelihood = {res:-165755.91}  
Iteration 25:{space 1}Log likelihood = {res: -165755.9}  
Iteration 26:{space 1}Log likelihood = {res: -165755.9}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-165755.9}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1768955{col 26}{space 2} .0056257{col 37}{space 1}   31.44{col 46}{space 3}0.000{col 55}{space 3} .1658693{col 67}{space 3} .1879218
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .2907453{col 26}{space 2}  .006092{col 37}{space 1}   47.73{col 46}{space 3}0.000{col 55}{space 3} .2788051{col 67}{space 3} .3026855
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5283895{col 26}{space 2} .0122597{col 37}{space 1}  -43.10{col 46}{space 3}0.000{col 55}{space 3}-.5524181{col 67}{space 3}-.5043609
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}  -.11046{col 26}{space 2} .0016757{col 37}{space 1}  -65.92{col 46}{space 3}0.000{col 55}{space 3}-.1137442{col 67}{space 3}-.1071758
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1644773{col 26}{space 2} .0331588{col 37}{space 1}   -4.96{col 46}{space 3}0.000{col 55}{space 3}-.2294673{col 67}{space 3}-.0994872
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0718343{col 26}{space 2} .0070213{col 37}{space 1}  -10.23{col 46}{space 3}0.000{col 55}{space 3}-.0855959{col 67}{space 3}-.0580728
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.2806501{col 26}{space 2} .0116031{col 37}{space 1}  -24.19{col 46}{space 3}0.000{col 55}{space 3}-.3033918{col 67}{space 3}-.2579084
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-57.57169{col 26}{space 2} .3052671{col 37}{space 1} -188.59{col 46}{space 3}0.000{col 55}{space 3}   -58.17{col 67}{space 3}-56.97338
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.678525{col 26}{space 2} .0057364{col 37}{space 1}  466.93{col 46}{space 3}0.000{col 55}{space 3} 2.667282{col 67}{space 3} 2.689768
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-164314.29}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1694419{col 26}{space 2} .0056437{col 37}{space 1}   30.02{col 46}{space 3}0.000{col 55}{space 3} .1583805{col 67}{space 3} .1805033
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .2942087{col 26}{space 2} .0060925{col 37}{space 1}   48.29{col 46}{space 3}0.000{col 55}{space 3} .2822676{col 67}{space 3} .3061497
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5245228{col 26}{space 2} .0122568{col 37}{space 1}  -42.79{col 46}{space 3}0.000{col 55}{space 3}-.5485457{col 67}{space 3}   -.5005
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0765736{col 26}{space 2} .0016685{col 37}{space 1}  -45.90{col 46}{space 3}0.000{col 55}{space 3}-.0798437{col 67}{space 3}-.0733035
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2084932{col 26}{space 2} .0331808{col 37}{space 1}   -6.28{col 46}{space 3}0.000{col 55}{space 3}-.2735264{col 67}{space 3}  -.14346
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0885913{col 26}{space 2} .0071093{col 37}{space 1}  -12.46{col 46}{space 3}0.000{col 55}{space 3}-.1025252{col 67}{space 3}-.0746574
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.2749236{col 26}{space 2} .0116238{col 37}{space 1}  -23.65{col 46}{space 3}0.000{col 55}{space 3}-.2977059{col 67}{space 3}-.2521414
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0802621{col 26}{space 2}  .001552{col 37}{space 1}   51.72{col 46}{space 3}0.000{col 55}{space 3} .0772203{col 67}{space 3}  .083304
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.400818{col 26}{space 2} .1102636{col 37}{space 1}   21.77{col 46}{space 3}0.000{col 55}{space 3} 2.184705{col 67}{space 3}  2.61693
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 4**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res: -1346.202}  
Iteration 2:{space 2}Log likelihood = {res:-1291.5852}  
Iteration 3:{space 2}Log likelihood = {res:-1290.8621}  
Iteration 4:{space 2}Log likelihood = {res:-1289.2572}  
Iteration 5:{space 2}Log likelihood = {res:-1289.1031}  
Iteration 6:{space 2}Log likelihood = {res:-1288.8145}  
Iteration 7:{space 2}Log likelihood = {res:-1288.5185}  
Iteration 8:{space 2}Log likelihood = {res:-1288.2195}  
Iteration 9:{space 2}Log likelihood = {res:-1287.9074}  
Iteration 10:{space 1}Log likelihood = {res:-1287.6279}  
Iteration 11:{space 1}Log likelihood = {res:-1287.1971}  
Iteration 12:{space 1}Log likelihood = {res:-1287.1094}  
Iteration 13:{space 1}Log likelihood = {res:-1286.6623}  (not concave)
Iteration 14:{space 1}Log likelihood = {res:-1286.6516}  
Iteration 15:{space 1}Log likelihood = {res:-1286.4953}  (backed up)
Iteration 16:{space 1}Log likelihood = {res:-1285.9764}  
Iteration 17:{space 1}Log likelihood = {res:-1285.7063}  
Iteration 18:{space 1}Log likelihood = {res:-1285.4146}  
Iteration 19:{space 1}Log likelihood = {res: -1284.955}  
Iteration 20:{space 1}Log likelihood = {res:-1284.8367}  
Iteration 21:{space 1}Log likelihood = {res:-1284.2848}  
Iteration 22:{space 1}Log likelihood = {res:-1284.1877}  
Iteration 23:{space 1}Log likelihood = {res:-1284.0573}  
Iteration 24:{space 1}Log likelihood = {res:-1283.8856}  
Iteration 25:{space 1}Log likelihood = {res:-1283.6702}  (not concave)
Iteration 26:{space 1}Log likelihood = {res:-1283.6558}  (not concave)
Iteration 27:{space 1}Log likelihood = {res: -1283.654}  
Iteration 28:{space 1}Log likelihood = {res:-1283.6218}  
Iteration 29:{space 1}Log likelihood = {res:-1283.5932}  
Iteration 30:{space 1}Log likelihood = {res: -1283.545}  
Iteration 31:{space 1}Log likelihood = {res:-1283.5339}  
Iteration 32:{space 1}Log likelihood = {res:-1283.5272}  
Iteration 33:{space 1}Log likelihood = {res:-1283.5263}  
Iteration 34:{space 1}Log likelihood = {res:-1283.5263}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.5263}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0655179{col 26}{space 2}  .057974{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 55}{space 3} -.179145{col 67}{space 3} .0481091
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .0460458{col 26}{space 2} .0612727{col 37}{space 1}    0.75{col 46}{space 3}0.452{col 55}{space 3}-.0740466{col 67}{space 3} .1661381
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2766578{col 26}{space 2} .1190242{col 37}{space 1}   -2.32{col 46}{space 3}0.020{col 55}{space 3}-.5099409{col 67}{space 3}-.0433746
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}  .011197{col 26}{space 2} .0263608{col 37}{space 1}    0.42{col 46}{space 3}0.671{col 55}{space 3}-.0404693{col 67}{space 3} .0628632
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}   .55342{col 26}{space 2} .2807045{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 55}{space 3} .0032493{col 67}{space 3} 1.103591
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2046965{col 26}{space 2} .0821577{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 55}{space 3}-.3657226{col 67}{space 3}-.0436704
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1675976{col 26}{space 2} .1137631{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 55}{space 3}-.3905692{col 67}{space 3}  .055374
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-29.34498{col 26}{space 2} 6.049116{col 37}{space 1}   -4.85{col 46}{space 3}0.000{col 55}{space 3}-41.20103{col 67}{space 3}-17.48893
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.895213{col 26}{space 2} .2483018{col 37}{space 1}    7.63{col 46}{space 3}0.000{col 55}{space 3} 1.408551{col 67}{space 3} 2.381876
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.0488}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0644089{col 26}{space 2} .0581256{col 37}{space 1}   -1.11{col 46}{space 3}0.268{col 55}{space 3}-.1783329{col 67}{space 3} .0495151
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2}  .046978{col 26}{space 2} .0613187{col 37}{space 1}    0.77{col 46}{space 3}0.444{col 55}{space 3}-.0732043{col 67}{space 3} .1671604
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2770003{col 26}{space 2} .1190289{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 55}{space 3}-.5102927{col 67}{space 3}-.0437079
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0101499{col 26}{space 2} .0524779{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 55}{space 3}-.1130046{col 67}{space 3} .0927048
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .5494466{col 26}{space 2} .2806588{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 55}{space 3}-.0006346{col 67}{space 3} 1.099528
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2027809{col 26}{space 2} .0824062{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 55}{space 3}-.3642941{col 67}{space 3}-.0412678
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1669934{col 26}{space 2} .1137988{col 37}{space 1}   -1.47{col 46}{space 3}0.142{col 55}{space 3}-.3900349{col 67}{space 3} .0560481
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0078476{col 26}{space 2} .0294403{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 55}{space 3}-.0498544{col 67}{space 3} .0655496
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .9680803{col 26}{space 2}  2.79343{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 55}{space 3}-4.506942{col 67}{space 3} 6.443103
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. **Transition 5**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res:-1995.0355}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-1988.6999}  
Iteration 3:{space 2}Log likelihood = {res:-1967.2912}  
Iteration 4:{space 2}Log likelihood = {res:-1966.4447}  
Iteration 5:{space 2}Log likelihood = {res:  -1966.12}  
Iteration 6:{space 2}Log likelihood = {res:-1965.6011}  
Iteration 7:{space 2}Log likelihood = {res:-1965.0541}  
Iteration 8:{space 2}Log likelihood = {res:-1964.5985}  
Iteration 9:{space 2}Log likelihood = {res:-1964.0343}  
Iteration 10:{space 1}Log likelihood = {res:-1963.5659}  
Iteration 11:{space 1}Log likelihood = {res:-1963.0014}  
Iteration 12:{space 1}Log likelihood = {res:-1962.4947}  
Iteration 13:{space 1}Log likelihood = {res: -1961.741}  
Iteration 14:{space 1}Log likelihood = {res: -1961.437}  
Iteration 15:{space 1}Log likelihood = {res:-1960.1028}  
Iteration 16:{space 1}Log likelihood = {res:-1959.4609}  
Iteration 17:{space 1}Log likelihood = {res:-1959.1177}  
Iteration 18:{space 1}Log likelihood = {res:-1958.4251}  
Iteration 19:{space 1}Log likelihood = {res:-1957.7948}  
Iteration 20:{space 1}Log likelihood = {res:-1957.3649}  
Iteration 21:{space 1}Log likelihood = {res:  -1957.16}  
Iteration 22:{space 1}Log likelihood = {res:-1956.8269}  
Iteration 23:{space 1}Log likelihood = {res:-1956.6774}  
Iteration 24:{space 1}Log likelihood = {res:-1956.4295}  
Iteration 25:{space 1}Log likelihood = {res:-1956.1584}  (not concave)
Iteration 26:{space 1}Log likelihood = {res:-1956.1237}  (not concave)
Iteration 27:{space 1}Log likelihood = {res:-1956.1208}  
Iteration 28:{space 1}Log likelihood = {res:-1956.0846}  
Iteration 29:{space 1}Log likelihood = {res:-1956.0382}  
Iteration 30:{space 1}Log likelihood = {res:-1955.9974}  
Iteration 31:{space 1}Log likelihood = {res:-1955.9955}  
Iteration 32:{space 1}Log likelihood = {res:-1955.9948}  
Iteration 33:{space 1}Log likelihood = {res:-1955.9948}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1955.9948}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0036927{col 26}{space 2} .0423013{col 37}{space 1}    0.09{col 46}{space 3}0.930{col 55}{space 3}-.0792164{col 67}{space 3} .0866018
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1556138{col 26}{space 2} .0458635{col 37}{space 1}    3.39{col 46}{space 3}0.001{col 55}{space 3} .0657229{col 67}{space 3} .2455046
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3363503{col 26}{space 2} .0915801{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 55}{space 3} -.515844{col 67}{space 3}-.1568567
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0044863{col 26}{space 2} .0197088{col 37}{space 1}   -0.23{col 46}{space 3}0.820{col 55}{space 3}-.0431149{col 67}{space 3} .0341422
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1773554{col 26}{space 2} .2664786{col 37}{space 1}   -0.67{col 46}{space 3}0.506{col 55}{space 3}-.6996438{col 67}{space 3} .3449331
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0175737{col 26}{space 2} .0394439{col 37}{space 1}   -0.45{col 46}{space 3}0.656{col 55}{space 3}-.0948822{col 67}{space 3} .0597349
{col 1}{text}      SESres{col 14}{c |}{result}{space 2} .0010591{col 26}{space 2} .0825376{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 55}{space 3}-.1607116{col 67}{space 3} .1628299
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-28.43599{col 26}{space 2} 4.574696{col 37}{space 1}   -6.22{col 46}{space 3}0.000{col 55}{space 3}-37.40223{col 67}{space 3}-19.46975
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.909507{col 26}{space 2} .1856847{col 37}{space 1}   10.28{col 46}{space 3}0.000{col 55}{space 3} 1.545571{col 67}{space 3} 2.273442
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1952.5526}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0004237{col 26}{space 2} .0422845{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 55}{space 3}-.0832998{col 67}{space 3} .0824523
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1567945{col 26}{space 2} .0459222{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 55}{space 3} .0667887{col 67}{space 3} .2468003
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3356391{col 26}{space 2} .0915747{col 37}{space 1}   -3.67{col 46}{space 3}0.000{col 55}{space 3}-.5151222{col 67}{space 3}-.1561559
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0231412{col 26}{space 2} .0283225{col 37}{space 1}   -0.82{col 46}{space 3}0.414{col 55}{space 3}-.0786523{col 67}{space 3} .0323699
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1812399{col 26}{space 2}  .266691{col 37}{space 1}   -0.68{col 46}{space 3}0.497{col 55}{space 3}-.7039446{col 67}{space 3} .3414648
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0204906{col 26}{space 2}  .040256{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 55}{space 3}-.0993909{col 67}{space 3} .0584097
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0035128{col 26}{space 2} .0824632{col 37}{space 1}   -0.04{col 46}{space 3}0.966{col 55}{space 3}-.1651377{col 67}{space 3} .1581122
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0127309{col 26}{space 2} .0207703{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 55}{space 3}-.0279781{col 67}{space 3}   .05344
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 1.944498{col 26}{space 2} 1.579622{col 37}{space 1}    1.23{col 46}{space 3}0.218{col 55}{space 3}-1.151505{col 67}{space 3}   5.0405
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 6**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-13845.309}  
Iteration 1:{space 2}Log likelihood = {res:-6785.0486}  
Iteration 2:{space 2}Log likelihood = {res:-6704.8194}  
Iteration 3:{space 2}Log likelihood = {res:-6704.5915}  
Iteration 4:{space 2}Log likelihood = {res:-6702.9684}  (not concave)
Iteration 5:{space 2}Log likelihood = {res: -6702.968}  
Iteration 6:{space 2}Log likelihood = {res:-6702.5346}  
Iteration 7:{space 2}Log likelihood = {res:-6702.0306}  
Iteration 8:{space 2}Log likelihood = {res:-6700.3631}  (not concave)
Iteration 9:{space 2}Log likelihood = {res:-6700.3607}  
Iteration 10:{space 1}Log likelihood = {res:-6699.9222}  
Iteration 11:{space 1}Log likelihood = {res:-6699.6871}  
Iteration 12:{space 1}Log likelihood = {res:-6698.4798}  (not concave)
Iteration 13:{space 1}Log likelihood = {res:-6698.4686}  
Iteration 14:{space 1}Log likelihood = {res:-6698.2717}  
Iteration 15:{space 1}Log likelihood = {res: -6697.174}  (not concave)
Iteration 16:{space 1}Log likelihood = {res:-6697.1559}  
Iteration 17:{space 1}Log likelihood = {res:-6696.7334}  
Iteration 18:{space 1}Log likelihood = {res:-6696.0604}  
Iteration 19:{space 1}Log likelihood = {res:-6695.0984}  
Iteration 20:{space 1}Log likelihood = {res:-6694.7874}  
Iteration 21:{space 1}Log likelihood = {res: -6693.336}  (not concave)
Iteration 22:{space 1}Log likelihood = {res:-6693.1549}  (not concave)
Iteration 23:{space 1}Log likelihood = {res:-6693.1433}  (not concave)
Iteration 24:{space 1}Log likelihood = {res:-6693.1417}  
Iteration 25:{space 1}Log likelihood = {res:-6692.8638}  
Iteration 26:{space 1}Log likelihood = {res:-6692.2719}  
Iteration 27:{space 1}Log likelihood = {res:-6691.9488}  
Iteration 28:{space 1}Log likelihood = {res: -6691.548}  
Iteration 29:{space 1}Log likelihood = {res:-6691.1679}  
Iteration 30:{space 1}Log likelihood = {res:-6690.8984}  (not concave)
Iteration 31:{space 1}Log likelihood = {res:-6690.8711}  
Iteration 32:{space 1}Log likelihood = {res:-6690.7774}  
Iteration 33:{space 1}Log likelihood = {res:-6690.6683}  
Iteration 34:{space 1}Log likelihood = {res:-6690.5329}  
Iteration 35:{space 1}Log likelihood = {res:-6690.4898}  
Iteration 36:{space 1}Log likelihood = {res:-6690.4762}  
Iteration 37:{space 1}Log likelihood = {res:-6690.4731}  
Iteration 38:{space 1}Log likelihood = {res:-6690.4729}  
Iteration 39:{space 1}Log likelihood = {res:-6690.4728}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-6690.4728}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0055875{col 26}{space 2} .0191199{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 55}{space 3}-.0318867{col 67}{space 3} .0430617
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2}  .036621{col 26}{space 2}  .020294{col 37}{space 1}    1.80{col 46}{space 3}0.071{col 55}{space 3}-.0031544{col 67}{space 3} .0763965
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3506391{col 26}{space 2} .0408115{col 37}{space 1}   -8.59{col 46}{space 3}0.000{col 55}{space 3}-.4306282{col 67}{space 3}  -.27065
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} .0026138{col 26}{space 2} .0097743{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 55}{space 3}-.0165435{col 67}{space 3} .0217711
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2044859{col 26}{space 2} .1108841{col 37}{space 1}   -1.84{col 46}{space 3}0.065{col 55}{space 3}-.4218148{col 67}{space 3}  .012843
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0016003{col 26}{space 2} .0206651{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 55}{space 3}-.0389026{col 67}{space 3} .0421031
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0753663{col 26}{space 2} .0419125{col 37}{space 1}   -1.80{col 46}{space 3}0.072{col 55}{space 3}-.1575133{col 67}{space 3} .0067806
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-16.46504{col 26}{space 2} 2.259923{col 37}{space 1}   -7.29{col 46}{space 3}0.000{col 55}{space 3} -20.8944{col 67}{space 3}-12.03567
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.426496{col 26}{space 2} .1462907{col 37}{space 1}    9.75{col 46}{space 3}0.000{col 55}{space 3} 1.139771{col 67}{space 3}  1.71322
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}{err}convergence not achieved
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 8:-6689.85}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0052434{col 26}{space 2} .0191334{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 55}{space 3}-.0322573{col 67}{space 3} .0427442
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2}  .036331{col 26}{space 2} .0203042{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 55}{space 3}-.0034644{col 67}{space 3} .0761264
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3506609{col 26}{space 2} .0408183{col 37}{space 1}   -8.59{col 46}{space 3}0.000{col 55}{space 3}-.4306633{col 67}{space 3}-.2706584
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0004997{col 26}{space 2} .0211889{col 37}{space 1}   -0.02{col 46}{space 3}0.981{col 55}{space 3}-.0420292{col 67}{space 3} .0410297
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2049283{col 26}{space 2} .1109452{col 37}{space 1}   -1.85{col 46}{space 3}0.065{col 55}{space 3}-.4223768{col 67}{space 3} .0125203
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0014816{col 26}{space 2} .0206904{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 55}{space 3}-.0390708{col 67}{space 3}  .042034
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0742067{col 26}{space 2}  .041934{col 37}{space 1}   -1.77{col 46}{space 3}0.077{col 55}{space 3}-.1563958{col 67}{space 3} .0079825
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} 9.66e-06{col 26}{space 2}  .000067{col 37}{space 1}    0.14{col 46}{space 3}0.885{col 55}{space 3}-.0001217{col 67}{space 3}  .000141
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}  5.90743{col 26}{space 2} 2.193657{col 37}{space 1}    2.69{col 46}{space 3}0.007{col 55}{space 3} 1.607941{col 67}{space 3} 10.20692
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}