{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin",clear
{txt}
{com}. 
. **Main exposures of interest: LE8* 
. **Main outcomes of interest: Dementia, PD and deaths 
. **Main covariates: AGE SEX RACE_ETHN (or Non_White) SES
. **Main effect modifiers: sex and race
. 
. 
. 
. capture drop zLE8*
{txt}
{com}. foreach x of varlist LE8* {c -(}
{txt}  2{com}.         egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{txt}(138,732 missing values generated)
(138,606 missing values generated)
(138,606 missing values generated)
(140,479 missing values generated)
(140,388 missing values generated)
(189,537 missing values generated)
(162,934 missing values generated)
(162,204 missing values generated)
(138,606 missing values generated)
(138,606 missing values generated)
(140,289 missing values generated)
(138,606 missing values generated)
(138,606 missing values generated)

{com}. 
. 
. 
. capture drop zLE8_LIFESTYLE 
{txt}
{com}. capture drop zLE8_BIOLOGICAL
{txt}
{com}. egen zLE8_LIFESTYLE=std(LE8_LIFESTYLE) if sample_final==1
{txt}(138,606 missing values generated)

{com}. egen zLE8_BIOLOGICAL=std(LE8_BIOLOGICAL) if sample_final==1
{txt}(140,289 missing values generated)

{com}. 
. 
. capture drop zLE8_LIFESTYLEinv
{txt}
{com}. capture drop zLE8_BIOLOGICALinv
{txt}
{com}. gen zLE8_LIFESTYLEinv=zLE8_LIFESTYLE*-1
{txt}(138,606 missing values generated)

{com}. gen zLE8_BIOLOGICALinv=zLE8_LIFESTYLE*-1
{txt}(138,606 missing values generated)

{com}. 
. 
. 
. capture drop zLE8_TOTALSCOREinv
{txt}
{com}. gen zLE8_TOTALSCOREinv=zLE8_TOTALSCORE*-1
{txt}(138,606 missing values generated)

{com}. 
. 
. capture drop AD_PGStert
{txt}
{com}. xtile AD_PGStert=AD_PGS if sample_final==1, nq(3)
{txt}
{com}. 
. 
. capture drop NonWhite
{txt}
{com}. gen NonWhite=.
{txt}(502,269 missing values generated)

{com}. replace NonWhite=RACE_ETHN
{txt}(363,663 real changes made)

{com}. recode NonWhite (0=0) (1=1) (2=1) (3=1)
{txt}(11,508 changes made to {bf:NonWhite})

{com}. 
. capture drop LE8_TOTALSCOREtertinv
{txt}
{com}. gen LE8_TOTALSCOREtertinv=.
{txt}(502,269 missing values generated)

{com}. replace LE8_TOTALSCOREtertinv=1 if LE8_TOTALSCOREtert==3
{txt}(118,310 real changes made)

{com}. replace LE8_TOTALSCOREtertinv=2 if LE8_TOTALSCOREtert==2
{txt}(122,256 real changes made)

{com}. replace LE8_TOTALSCOREtertinv=3 if LE8_TOTALSCOREtert==1
{txt}(123,097 real changes made)

{com}. 
. capture drop ztownsend
{txt}
{com}. egen ztownsend=std(townsend) if sample_final==1
{txt}(138,606 missing values generated)

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. **********TABLE 1: OVERALL, BY SEX AND BY RACE ***************
. 
. ****OVERALL**
. 
. foreach x1 of varlist AGE householdsize townsend ztownsend LE8* zLE8* SES*   {c -(}
{txt}  2{com}.          mean `x1' if sample_final==1
{txt}  3{com}. {c )-}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} 60.42263{col 26}{space 2} .0090163{col 37}{space 5} 60.40496{col 51}{space 3}  60.4403
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:363,663}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
householdsize {c |}{col 15}{res}{space 2} 2.234319{col 27}{space 2} .0019655{col 38}{space 5} 2.230466{col 52}{space 3} 2.238171
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}townsend {c |}{col 14}{res}{space 2}-1.499722{col 26}{space 2} .0049375{col 37}{space 5}-1.509399{col 51}{space 3}-1.490045
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}ztownsend {c |}{col 14}{res}{space 2}-5.72e-11{col 26}{space 2} .0016583{col 37}{space 5}-.0032501{col 51}{space 3} .0032501
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:363,537}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP1DIET {c |}{col 15}{res}{space 2} 33.98219{col 27}{space 2} .0514843{col 38}{space 5} 33.88129{col 52}{space 3}  34.0831
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}LE8_COMP2PA {c |}{col 14}{res}{space 2} 47.47821{col 26}{space 2} .0585039{col 37}{space 5} 47.36355{col 51}{space 3} 47.59288
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 7:363,663}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}       Mean{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP3NICOTINE {c |}{col 19}{res}{space 2} 84.62642{col 31}{space 2} .0487603{col 42}{space 5} 84.53085{col 56}{space 3} 84.72199
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:361,790}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP4SLEEP {c |}{col 16}{res}{space 2} 88.97963{col 28}{space 2} .0313899{col 39}{space 5} 88.91811{col 53}{space 3} 89.04115
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:361,881}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP5BMI {c |}{col 14}{res}{space 2} 68.26442{col 26}{space 2} .0473641{col 37}{space 5} 68.17158{col 51}{space 3} 68.35725
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:312,732}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP6LIPIDS {c |}{col 17}{res}{space 2} 48.06301{col 29}{space 2} .0539593{col 40}{space 5} 47.95725{col 54}{space 3} 48.16876
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:339,335}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP7GLUC {c |}{col 15}{res}{space 2} 89.46528{col 27}{space 2} .0361036{col 38}{space 5} 89.39452{col 52}{space 3} 89.53604
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:340,065}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}LE8_COMP8BP {c |}{col 14}{res}{space 2} 37.98725{col 26}{space 2} .0527032{col 37}{space 5} 37.88396{col 51}{space 3} 38.09055
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:363,663}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCORE {c |}{col 16}{res}{space 2} 500.5101{col 28}{space 2} .1598385{col 39}{space 5} 500.1969{col 53}{space 3} 500.8234
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:363,663}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_LIFESTYLE {c |}{col 15}{res}{space 2} 254.8583{col 27}{space 2} .1055397{col 38}{space 5} 254.6514{col 52}{space 3} 255.0651
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:361,980}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_BIOLOGICAL {c |}{col 16}{res}{space 2} 245.4729{col 28}{space 2} .1106809{col 39}{space 5} 245.2559{col 53}{space 3} 245.6898
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:363,663}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCOREtert {c |}{col 20}{res}{space 2} 1.986837{col 32}{space 2} .0013509{col 43}{space 5} 1.984189{col 57}{space 3} 1.989484
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 49}{lalign 13:Number of obs}{col 62} = {res}{ralign 7:363,663}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCOREtertinv {c |}{col 23}{res}{space 2} 2.013163{col 35}{space 2} .0013509{col 46}{space 5} 2.010516{col 60}{space 3} 2.015811
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:363,537}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP1DIET {c |}{col 16}{res}{space 2}-6.96e-09{col 28}{space 2} .0016585{col 39}{space 5}-.0032507{col 53}{space 3} .0032507
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP2PA {c |}{col 14}{res}{space 2}-2.30e-09{col 26}{space 2} .0016583{col 37}{space 5}-.0032501{col 51}{space 3} .0032501
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:363,663}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP3NICOTINE {c |}{col 20}{res}{space 2} 2.53e-08{col 32}{space 2} .0016583{col 43}{space 5}-.0032501{col 57}{space 3} .0032501
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:361,790}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP4SLEEP {c |}{col 17}{res}{space 2}-1.25e-10{col 29}{space 2} .0016625{col 40}{space 5}-.0032585{col 54}{space 3} .0032585
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:361,881}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP5BMI {c |}{col 15}{res}{space 2} 7.76e-09{col 27}{space 2} .0016623{col 38}{space 5}-.0032581{col 52}{space 3} .0032581
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 7:312,732}

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 18}{c |}       Mean{col 30}   Std. err.{col 42}     [95% con{col 55}f. interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP6LIPIDS {c |}{col 18}{res}{space 2} 2.67e-09{col 30}{space 2} .0017882{col 41}{space 5}-.0035048{col 55}{space 3} .0035048
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:339,335}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP7GLUC {c |}{col 16}{res}{space 2}-7.84e-09{col 28}{space 2} .0017167{col 39}{space 5}-.0033646{col 53}{space 3} .0033646
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:340,065}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP8BP {c |}{col 14}{res}{space 2}-1.25e-08{col 26}{space 2} .0017148{col 37}{space 5} -.003361{col 51}{space 3}  .003361
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:363,663}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCORE {c |}{col 17}{res}{space 2}-3.71e-10{col 29}{space 2} .0016583{col 40}{space 5}-.0032501{col 54}{space 3} .0032501
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 47}{lalign 13:Number of obs}{col 60} = {res}{ralign 7:363,663}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 21}{c |}       Mean{col 33}   Std. err.{col 45}     [95% con{col 58}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREtert {c |}{col 21}{res}{space 2} 5.21e-09{col 33}{space 2} .0016583{col 44}{space 5}-.0032501{col 58}{space 3} .0032501
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 50}{lalign 13:Number of obs}{col 63} = {res}{ralign 7:363,663}

{txt}{hline 23}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 24}{c |}       Mean{col 36}   Std. err.{col 48}     [95% con{col 61}f. interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREtertinv {c |}{col 24}{res}{space 2}-5.21e-09{col 36}{space 2} .0016583{col 47}{space 5}-.0032501{col 61}{space 3} .0032501
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:363,663}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_LIFESTYLE {c |}{col 16}{res}{space 2}-1.51e-09{col 28}{space 2} .0016583{col 39}{space 5}-.0032501{col 53}{space 3} .0032501
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:361,980}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_BIOLOGICAL {c |}{col 17}{res}{space 2} 3.28e-09{col 29}{space 2} .0016621{col 40}{space 5}-.0032577{col 54}{space 3} .0032577
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 7:363,663}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}       Mean{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_LIFESTYLEinv {c |}{col 19}{res}{space 2} 1.51e-09{col 31}{space 2} .0016583{col 42}{space 5}-.0032501{col 56}{space 3} .0032501
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:363,663}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_BIOLOGICALinv {c |}{col 20}{res}{space 2} 1.51e-09{col 32}{space 2} .0016583{col 43}{space 5}-.0032501{col 57}{space 3} .0032501
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:363,663}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREinv {c |}{col 20}{res}{space 2} 3.71e-10{col 32}{space 2} .0016583{col 43}{space 5}-.0032501{col 57}{space 3} .0032501
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}SES {c |}{col 14}{res}{space 2}  -.04982{col 26}{space 2} .0011589{col 37}{space 5}-.0520913{col 51}{space 3}-.0475486
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}SESres {c |}{col 14}{res}{space 2} 3.50e-11{col 26}{space 2} .0009041{col 37}{space 5} -.001772{col 51}{space 3}  .001772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. 
. foreach x2 of varlist dem_diag PD_diag died SEX RACE_ETHN NonWhite educationbr householdincome occupation   {c -(}
{txt}  2{com}.          prop `x2' if sample_final==1
{txt}  3{com}. {c )-}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}dem_diag {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9826048{col 26}{space 2} .0002168{col 37}{space 5} .9821747{col 51}{space 3} .9830246
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0173952{col 26}{space 2} .0002168{col 37}{space 5} .0169754{col 51}{space 3} .0178253
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}PD_diag {c |}
{space 10}0  {c |}{col 14}{res}{space 2}  .992889{col 26}{space 2} .0001393{col 37}{space 5} .9926107{col 51}{space 3}  .993157
{txt}{space 10}1  {c |}{col 14}{res}{space 2}  .007111{col 26}{space 2} .0001393{col 37}{space 5}  .006843{col 51}{space 3} .0073893
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}died {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9125977{col 26}{space 2} .0004683{col 37}{space 5} .9116754{col 51}{space 3} .9135112
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0874023{col 26}{space 2} .0004683{col 37}{space 5} .0864888{col 51}{space 3} .0883246
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}SEX {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .4624914{col 26}{space 2} .0008268{col 37}{space 5} .4608713{col 51}{space 3} .4641122
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .5375086{col 26}{space 2} .0008268{col 37}{space 5} .5358878{col 51}{space 3} .5391287
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}RACE_ETHN {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9574606{col 26}{space 2} .0003347{col 37}{space 5} .9567998{col 51}{space 3} .9581117
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0108947{col 26}{space 2} .0001721{col 37}{space 5} .0105624{col 51}{space 3} .0112373
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0151156{col 26}{space 2} .0002023{col 37}{space 5} .0147242{col 51}{space 3} .0155174
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .016529{col 26}{space 2} .0002114{col 37}{space 5} .0161197{col 51}{space 3} .0169486
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:363,663}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}NonWhite {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9574606{col 26}{space 2} .0003347{col 37}{space 5} .9567998{col 51}{space 3} .9581117
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0425394{col 26}{space 2} .0003347{col 37}{space 5} .0418883{col 51}{space 3} .0432002
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:295,053}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}educationbr {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .2176287{col 26}{space 2} .0007597{col 37}{space 5} .2161435{col 51}{space 3} .2191213
{txt}{space 10}1  {c |}{col 14}{res}{space 2}  .394763{col 26}{space 2} .0008999{col 37}{space 5} .3930006{col 51}{space 3} .3965281
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .3876083{col 26}{space 2} .0008969{col 37}{space 5} .3858518{col 51}{space 3} .3893678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:318,568}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}{col 40}             L{col 54}ogit
{col 17}{c |} Proportion{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
householdincome {c |}
{space 13}1  {c |}{col 17}{res}{space 2} .2590122{col 29}{space 2} .0007762{col 40}{space 5} .2574938{col 54}{space 3} .2605364
{txt}{space 13}2  {c |}{col 17}{res}{space 2} .2779501{col 29}{space 2} .0007937{col 40}{space 5} .2763971{col 54}{space 3} .2795084
{txt}{space 13}3  {c |}{col 17}{res}{space 2} .2461672{col 29}{space 2} .0007632{col 40}{space 5} .2446744{col 54}{space 3} .2476662
{txt}{space 13}4  {c |}{col 17}{res}{space 2}  .172679{col 29}{space 2} .0006697{col 40}{space 5} .1713704{col 54}{space 3} .1739955
{txt}{space 13}5  {c |}{col 17}{res}{space 2} .0441915{col 29}{space 2} .0003641{col 40}{space 5} .0434833{col 54}{space 3} .0449107
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:220,999}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 2}occupation {c |}
{space 10}1  {c |}{col 14}{res}{space 2}  .161227{col 26}{space 2} .0007823{col 37}{space 5} .1596997{col 51}{space 3} .1627661
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .2410147{col 26}{space 2} .0009098{col 37}{space 5}  .239236{col 51}{space 3} .2428023
{txt}{space 10}3  {c |}{col 14}{res}{space 2}   .16177{col 26}{space 2} .0007833{col 37}{space 5} .1602406{col 51}{space 3} .1633111
{txt}{space 10}4  {c |}{col 14}{res}{space 2}  .163693{col 26}{space 2} .0007871{col 37}{space 5} .1621563{col 51}{space 3} .1652415
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0758601{col 26}{space 2} .0005632{col 37}{space 5} .0747635{col 51}{space 3} .0769714
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0599641{col 26}{space 2}  .000505{col 37}{space 5} .0589818{col 51}{space 3} .0609616
{txt}{space 10}7  {c |}{col 14}{res}{space 2}  .036964{col 26}{space 2} .0004013{col 37}{space 5} .0361853{col 51}{space 3} .0377587
{txt}{space 10}8  {c |}{col 14}{res}{space 2}  .047412{col 26}{space 2} .0004521{col 37}{space 5} .0465338{col 51}{space 3} .0483059
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0520953{col 26}{space 2} .0004727{col 37}{space 5} .0511765{col 51}{space 3} .0530296
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. **Among Men**
. 
. foreach x1 of varlist AGE householdsize townsend ztownsend LE8* zLE8* SES*  {c -(}
{txt}  2{com}.          mean `x1' if sample_final==1 & SEX==1
{txt}  3{com}. {c )-}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} 60.72469{col 26}{space 2} .0133048{col 37}{space 5} 60.69862{col 51}{space 3} 60.75077
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:168,191}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
householdsize {c |}{col 15}{res}{space 2} 2.310778{col 27}{space 2} .0029486{col 38}{space 5} 2.304998{col 52}{space 3} 2.316557
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}townsend {c |}{col 14}{res}{space 2}-1.480383{col 26}{space 2} .0073806{col 37}{space 5}-1.494849{col 51}{space 3}-1.465917
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}ztownsend {c |}{col 14}{res}{space 2} .0064951{col 26}{space 2} .0024788{col 37}{space 5} .0016368{col 51}{space 3} .0113535
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:168,118}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP1DIET {c |}{col 15}{res}{space 2}  28.4684{col 27}{space 2} .0741084{col 38}{space 5} 28.32315{col 52}{space 3} 28.61365
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}LE8_COMP2PA {c |}{col 14}{res}{space 2} 48.90018{col 26}{space 2} .0862104{col 37}{space 5} 48.73121{col 51}{space 3} 49.06915
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 7:168,191}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}       Mean{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP3NICOTINE {c |}{col 19}{res}{space 2} 82.09421{col 31}{space 2} .0763348{col 42}{space 5}  81.9446{col 56}{space 3} 82.24383
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:167,582}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP4SLEEP {c |}{col 16}{res}{space 2} 89.33477{col 28}{space 2} .0451643{col 39}{space 5} 89.24625{col 53}{space 3} 89.42329
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:167,236}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP5BMI {c |}{col 14}{res}{space 2} 65.94414{col 26}{space 2}  .065707{col 37}{space 5} 65.81536{col 51}{space 3} 66.07293
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:146,307}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP6LIPIDS {c |}{col 17}{res}{space 2} 53.18296{col 29}{space 2} .0823462{col 40}{space 5} 53.02157{col 54}{space 3} 53.34436
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:157,601}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP7GLUC {c |}{col 15}{res}{space 2} 88.10318{col 27}{space 2} .0570183{col 38}{space 5} 87.99143{col 52}{space 3} 88.21494
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:157,347}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}LE8_COMP8BP {c |}{col 14}{res}{space 2} 34.69037{col 26}{space 2} .0713359{col 37}{space 5} 34.55055{col 51}{space 3} 34.83018
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:168,191}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCORE {c |}{col 16}{res}{space 2} 491.5879{col 28}{space 2} .2288318{col 39}{space 5} 491.1394{col 53}{space 3} 492.0364
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:168,191}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_LIFESTYLE {c |}{col 15}{res}{space 2} 248.6404{col 27}{space 2} .1566257{col 38}{space 5} 248.3334{col 52}{space 3} 248.9473
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:167,376}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_BIOLOGICAL {c |}{col 16}{res}{space 2} 242.9258{col 28}{space 2} .1529354{col 39}{space 5} 242.6261{col 53}{space 3} 243.2256
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:168,191}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCOREtert {c |}{col 20}{res}{space 2} 1.914817{col 32}{space 2} .0019566{col 43}{space 5} 1.910982{col 57}{space 3} 1.918652
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 49}{lalign 13:Number of obs}{col 62} = {res}{ralign 7:168,191}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCOREtertinv {c |}{col 23}{res}{space 2} 2.085183{col 35}{space 2} .0019566{col 46}{space 5} 2.081348{col 60}{space 3} 2.089018
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:168,118}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP1DIET {c |}{col 16}{res}{space 2}-.1776239{col 28}{space 2} .0023874{col 39}{space 5}-.1823031{col 53}{space 3}-.1729447
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP2PA {c |}{col 14}{res}{space 2} .0403046{col 26}{space 2} .0024436{col 37}{space 5} .0355152{col 51}{space 3} .0450939
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:168,191}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP3NICOTINE {c |}{col 20}{res}{space 2}-.0861159{col 32}{space 2}  .002596{col 43}{space 5}-.0912041{col 57}{space 3}-.0810278
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:167,582}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP4SLEEP {c |}{col 17}{res}{space 2} .0188099{col 29}{space 2} .0023921{col 40}{space 5} .0141215{col 54}{space 3} .0234984
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:167,236}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP5BMI {c |}{col 15}{res}{space 2}-.0814342{col 27}{space 2} .0023061{col 38}{space 5}-.0859541{col 52}{space 3}-.0769143
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 7:146,307}

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 18}{c |}       Mean{col 30}   Std. err.{col 42}     [95% con{col 55}f. interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP6LIPIDS {c |}{col 18}{res}{space 2} .1696734{col 30}{space 2} .0027289{col 41}{space 5} .1643248{col 55}{space 3}  .175022
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:157,601}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP7GLUC {c |}{col 16}{res}{space 2}-.0647652{col 28}{space 2} .0027111{col 39}{space 5} -.070079{col 53}{space 3}-.0594515
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:157,347}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP8BP {c |}{col 14}{res}{space 2} -.107272{col 26}{space 2} .0023211{col 37}{space 5}-.1118213{col 51}{space 3}-.1027228
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:168,191}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCORE {c |}{col 17}{res}{space 2}-.0925641{col 29}{space 2}  .002374{col 40}{space 5}-.0972172{col 54}{space 3}-.0879111
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 47}{lalign 13:Number of obs}{col 60} = {res}{ralign 7:168,191}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 21}{c |}       Mean{col 33}   Std. err.{col 45}     [95% con{col 58}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREtert {c |}{col 21}{res}{space 2} -.088406{col 33}{space 2} .0024018{col 44}{space 5}-.0931135{col 58}{space 3}-.0836984
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 50}{lalign 13:Number of obs}{col 63} = {res}{ralign 7:168,191}

{txt}{hline 23}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 24}{c |}       Mean{col 36}   Std. err.{col 48}     [95% con{col 61}f. interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREtertinv {c |}{col 24}{res}{space 2}  .088406{col 36}{space 2} .0024018{col 47}{space 5} .0836984{col 61}{space 3} .0931135
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:168,191}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_LIFESTYLE {c |}{col 16}{res}{space 2}-.0976969{col 28}{space 2} .0024609{col 39}{space 5}-.1025202{col 53}{space 3}-.0928735
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:167,376}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_BIOLOGICAL {c |}{col 17}{res}{space 2}-.0382491{col 29}{space 2} .0022966{col 40}{space 5}-.0427504{col 54}{space 3}-.0337477
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 7:168,191}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}       Mean{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_LIFESTYLEinv {c |}{col 19}{res}{space 2} .0976969{col 31}{space 2} .0024609{col 42}{space 5} .0928735{col 56}{space 3} .1025202
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:168,191}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_BIOLOGICALinv {c |}{col 20}{res}{space 2} .0976969{col 32}{space 2} .0024609{col 43}{space 5} .0928735{col 57}{space 3} .1025202
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:168,191}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREinv {c |}{col 20}{res}{space 2} .0925641{col 32}{space 2}  .002374{col 43}{space 5} .0879111{col 57}{space 3} .0972172
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}SES {c |}{col 14}{res}{space 2}-.0307186{col 26}{space 2} .0017853{col 37}{space 5}-.0342177{col 51}{space 3}-.0272196
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}SESres {c |}{col 14}{res}{space 2} .0219408{col 26}{space 2} .0013834{col 37}{space 5} .0192294{col 51}{space 3} .0246523
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. 
. foreach x2 of varlist dem_diag PD_diag died SEX RACE_ETHN NonWhite educationbr householdincome  occupation   {c -(}
{txt}  2{com}.          prop `x2' if sample_final==1 & SEX==1
{txt}  3{com}. {c )-}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}dem_diag {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9799395{col 26}{space 2} .0003419{col 37}{space 5} .9792583{col 51}{space 3} .9805987
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0200605{col 26}{space 2} .0003419{col 37}{space 5} .0194013{col 51}{space 3} .0207417
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}PD_diag {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9902076{col 26}{space 2} .0002401{col 37}{space 5} .9897256{col 51}{space 3} .9906671
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0097924{col 26}{space 2} .0002401{col 37}{space 5} .0093329{col 51}{space 3} .0102744
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}died {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .8861473{col 26}{space 2} .0007745{col 37}{space 5} .8846204{col 51}{space 3} .8876565
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .1138527{col 26}{space 2} .0007745{col 37}{space 5} .1123435{col 51}{space 3} .1153796
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}1.SEX {c |}{col 14}{res}{space 2}        1{col 26}{space 2}        0{col 37}{space 5}        .{col 51}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}RACE_ETHN {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9573758{col 26}{space 2} .0004926{col 37}{space 5} .9563999{col 51}{space 3} .9583309
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0096914{col 26}{space 2} .0002389{col 37}{space 5} .0092342{col 51}{space 3} .0101709
{txt}{space 10}2  {c |}{col 14}{res}{space 2}  .017712{col 26}{space 2} .0003216{col 37}{space 5} .0170925{col 51}{space 3} .0183535
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0152208{col 26}{space 2} .0002985{col 37}{space 5} .0146466{col 51}{space 3} .0158171
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:168,191}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}NonWhite {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9573758{col 26}{space 2} .0004926{col 37}{space 5} .9563999{col 51}{space 3} .9583309
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0426242{col 26}{space 2} .0004926{col 37}{space 5} .0416691{col 51}{space 3} .0436001
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:135,100}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}educationbr {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .2401258{col 26}{space 2} .0011622{col 37}{space 5} .2378554{col 51}{space 3}  .242411
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .3472095{col 26}{space 2} .0012953{col 37}{space 5} .3446752{col 51}{space 3} .3497525
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .4126647{col 26}{space 2} .0013394{col 37}{space 5}  .410042{col 51}{space 3} .4152924
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:153,225}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}{col 40}             L{col 54}ogit
{col 17}{c |} Proportion{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
householdincome {c |}
{space 13}1  {c |}{col 17}{res}{space 2} .2331082{col 29}{space 2} .0010801{col 40}{space 5} .2309978{col 54}{space 3} .2352319
{txt}{space 13}2  {c |}{col 17}{res}{space 2} .2666601{col 29}{space 2} .0011297{col 40}{space 5} .2644518{col 54}{space 3} .2688802
{txt}{space 13}3  {c |}{col 17}{res}{space 2}  .255474{col 29}{space 2} .0011142{col 40}{space 5} .2532964{col 54}{space 3} .2576638
{txt}{space 13}4  {c |}{col 17}{res}{space 2} .1930038{col 29}{space 2} .0010082{col 40}{space 5} .1910354{col 54}{space 3} .1949875
{txt}{space 13}5  {c |}{col 17}{res}{space 2}  .051754{col 29}{space 2} .0005659{col 40}{space 5} .0506559{col 54}{space 3} .0528745
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:106,063}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 2}occupation {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .2136372{col 26}{space 2} .0012585{col 37}{space 5} .2111808{col 51}{space 3} .2161143
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .2572245{col 26}{space 2} .0013422{col 37}{space 5} .2546027{col 51}{space 3} .2598639
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1419534{col 26}{space 2} .0010716{col 37}{space 5} .1398659{col 51}{space 3} .1440668
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0649708{col 26}{space 2} .0007568{col 37}{space 5} .0635031{col 51}{space 3}   .06647
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .1393983{col 26}{space 2} .0010635{col 37}{space 5} .1373268{col 51}{space 3} .1414959
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0223169{col 26}{space 2} .0004536{col 37}{space 5}  .021445{col 51}{space 3} .0232234
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0181496{col 26}{space 2} .0004099{col 37}{space 5} .0173634{col 51}{space 3} .0189707
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0861752{col 26}{space 2} .0008617{col 37}{space 5} .0845013{col 51}{space 3} .0878791
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0561742{col 26}{space 2}  .000707{col 37}{space 5} .0548044{col 51}{space 3} .0575761
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. **Among Women**
. 
. foreach x1 of varlist AGE householdsize townsend ztownsend LE8* zLE8* SES*  {c -(}
{txt}  2{com}.          mean `x1' if sample_final==1 & SEX==2
{txt}  3{com}. {c )-}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}AGE {c |}{col 14}{res}{space 2} 60.16272{col 26}{space 2}   .01223{col 37}{space 5} 60.13875{col 51}{space 3} 60.18669
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:195,472}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
householdsize {c |}{col 15}{res}{space 2} 2.168531{col 27}{space 2} .0026243{col 38}{space 5} 2.163387{col 52}{space 3} 2.173674
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}townsend {c |}{col 14}{res}{space 2}-1.516362{col 26}{space 2} .0066368{col 37}{space 5} -1.52937{col 51}{space 3}-1.503354
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}ztownsend {c |}{col 14}{res}{space 2}-.0055886{col 26}{space 2}  .002229{col 37}{space 5}-.0099574{col 51}{space 3}-.0012199
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:195,419}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP1DIET {c |}{col 15}{res}{space 2} 38.72569{col 27}{space 2} .0697093{col 38}{space 5} 38.58906{col 52}{space 3} 38.86232
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}LE8_COMP2PA {c |}{col 14}{res}{space 2} 46.25471{col 26}{space 2} .0795472{col 37}{space 5}  46.0988{col 51}{space 3} 46.41062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 7:195,472}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}       Mean{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP3NICOTINE {c |}{col 19}{res}{space 2} 86.80522{col 31}{space 2} .0621512{col 42}{space 5} 86.68341{col 56}{space 3} 86.92703
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:194,208}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP4SLEEP {c |}{col 16}{res}{space 2} 88.67318{col 28}{space 2} .0435843{col 39}{space 5} 88.58775{col 53}{space 3}  88.7586
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:194,645}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP5BMI {c |}{col 14}{res}{space 2} 70.25796{col 26}{space 2} .0672536{col 37}{space 5} 70.12614{col 51}{space 3} 70.38977
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:166,425}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP6LIPIDS {c |}{col 17}{res}{space 2} 43.56196{col 29}{space 2} .0691401{col 40}{space 5} 43.42645{col 54}{space 3} 43.69748
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:181,734}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_COMP7GLUC {c |}{col 15}{res}{space 2} 90.64649{col 27}{space 2}   .04564{col 38}{space 5} 90.55704{col 52}{space 3} 90.73595
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:182,718}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}LE8_COMP8BP {c |}{col 14}{res}{space 2} 40.82636{col 26}{space 2} .0758437{col 37}{space 5}  40.6777{col 51}{space 3} 40.97501
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:195,472}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCORE {c |}{col 16}{res}{space 2} 508.1872{col 28}{space 2} .2213802{col 39}{space 5} 507.7533{col 53}{space 3} 508.6211
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:195,472}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_LIFESTYLE {c |}{col 15}{res}{space 2} 260.2084{col 27}{space 2} .1416855{col 38}{space 5} 259.9307{col 52}{space 3} 260.4861
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:194,604}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_BIOLOGICAL {c |}{col 16}{res}{space 2} 247.6635{col 28}{space 2} .1582073{col 39}{space 5} 247.3535{col 53}{space 3} 247.9736
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:195,472}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCOREtert {c |}{col 20}{res}{space 2} 2.048805{col 32}{space 2} .0018546{col 43}{space 5}  2.04517{col 57}{space 3}  2.05244
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 49}{lalign 13:Number of obs}{col 62} = {res}{ralign 7:195,472}

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 23}{c |}       Mean{col 35}   Std. err.{col 47}     [95% con{col 60}f. interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
LE8_TOTALSCOREtertinv {c |}{col 23}{res}{space 2} 1.951195{col 35}{space 2} .0018546{col 46}{space 5}  1.94756{col 60}{space 3}  1.95483
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:195,419}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP1DIET {c |}{col 16}{res}{space 2} .1528089{col 28}{space 2} .0022456{col 39}{space 5} .1484075{col 53}{space 3} .1572104
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP2PA {c |}{col 14}{res}{space 2}-.0346795{col 26}{space 2} .0022547{col 37}{space 5}-.0390987{col 51}{space 3}-.0302603
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:195,472}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP3NICOTINE {c |}{col 20}{res}{space 2} .0740972{col 32}{space 2} .0021137{col 43}{space 5} .0699545{col 57}{space 3} .0782399
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:194,208}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP4SLEEP {c |}{col 17}{res}{space 2}-.0162311{col 29}{space 2} .0023084{col 40}{space 5}-.0207555{col 54}{space 3}-.0117067
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 41}{lalign 13:Number of obs}{col 54} = {res}{ralign 7:194,645}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP5BMI {c |}{col 15}{res}{space 2}  .069967{col 27}{space 2} .0023604{col 38}{space 5} .0653407{col 52}{space 3} .0745933
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 7:166,425}

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 18}{c |}       Mean{col 30}   Std. err.{col 42}     [95% con{col 55}f. interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP6LIPIDS {c |}{col 18}{res}{space 2}-.1491627{col 30}{space 2} .0022913{col 41}{space 5}-.1536536{col 55}{space 3}-.1446719
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:181,734}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP7GLUC {c |}{col 16}{res}{space 2} .0561648{col 28}{space 2} .0021701{col 39}{space 5} .0519115{col 53}{space 3} .0604182
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:182,718}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_COMP8BP {c |}{col 14}{res}{space 2} .0923769{col 26}{space 2} .0024678{col 37}{space 5} .0875402{col 51}{space 3} .0972137
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:195,472}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCORE {c |}{col 17}{res}{space 2} .0796455{col 29}{space 2} .0022967{col 40}{space 5} .0751439{col 54}{space 3}  .084147
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 47}{lalign 13:Number of obs}{col 60} = {res}{ralign 7:195,472}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 21}{c |}       Mean{col 33}   Std. err.{col 45}     [95% con{col 58}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREtert {c |}{col 21}{res}{space 2} .0760676{col 33}{space 2} .0022766{col 44}{space 5} .0716056{col 58}{space 3} .0805297
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 50}{lalign 13:Number of obs}{col 63} = {res}{ralign 7:195,472}

{txt}{hline 23}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 24}{c |}       Mean{col 36}   Std. err.{col 48}     [95% con{col 61}f. interval]
{hline 23}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREtertinv {c |}{col 24}{res}{space 2}-.0760676{col 36}{space 2} .0022766{col 47}{space 5}-.0805297{col 61}{space 3}-.0716056
{txt}{hline 23}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 7:195,472}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_LIFESTYLE {c |}{col 16}{res}{space 2} .0840618{col 28}{space 2} .0022262{col 39}{space 5} .0796986{col 53}{space 3} .0884251
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:194,604}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}       Mean{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_BIOLOGICAL {c |}{col 17}{res}{space 2} .0328974{col 29}{space 2} .0023758{col 40}{space 5} .0282409{col 54}{space 3}  .037554
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 7:195,472}

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 19}{c |}       Mean{col 31}   Std. err.{col 43}     [95% con{col 56}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_LIFESTYLEinv {c |}{col 19}{res}{space 2}-.0840618{col 31}{space 2} .0022262{col 42}{space 5}-.0884251{col 56}{space 3}-.0796986
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:195,472}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_BIOLOGICALinv {c |}{col 20}{res}{space 2}-.0840618{col 32}{space 2} .0022262{col 43}{space 5}-.0884251{col 57}{space 3}-.0796986
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 7:195,472}

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 20}{c |}       Mean{col 32}   Std. err.{col 44}     [95% con{col 57}f. interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
zLE8_TOTALSCOREinv {c |}{col 20}{res}{space 2}-.0796455{col 32}{space 2} .0022967{col 43}{space 5} -.084147{col 57}{space 3}-.0751439
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}SES {c |}{col 14}{res}{space 2}-.0662554{col 26}{space 2} .0015118{col 37}{space 5}-.0692186{col 51}{space 3}-.0632922
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Mean estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 6}SESres {c |}{col 14}{res}{space 2}-.0188787{col 26}{space 2} .0011867{col 37}{space 5}-.0212047{col 51}{space 3}-.0165527
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. 
. foreach x2 of varlist dem_diag PD_diag died SEX RACE_ETHN NonWhite educationbr householdincome  occupation  {c -(}
{txt}  2{com}.          prop `x2' if sample_final==1 & SEX==2
{txt}  3{com}.                 
. {c )-}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}dem_diag {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9848981{col 26}{space 2} .0002758{col 37}{space 5} .9843478{col 51}{space 3} .9854293
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0151019{col 26}{space 2} .0002758{col 37}{space 5} .0145707{col 51}{space 3} .0156522
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}PD_diag {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9951962{col 26}{space 2} .0001564{col 37}{space 5} .9948798{col 51}{space 3} .9954932
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0048038{col 26}{space 2} .0001564{col 37}{space 5} .0045068{col 51}{space 3} .0051202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 8}died {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9353565{col 26}{space 2} .0005562{col 37}{space 5} .9342578{col 51}{space 3}  .936438
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0646435{col 26}{space 2} .0005562{col 37}{space 5}  .063562{col 51}{space 3} .0657422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 7}2.SEX {c |}{col 14}{res}{space 2}        1{col 26}{space 2}        0{col 37}{space 5}        .{col 51}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 3}RACE_ETHN {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9575336{col 26}{space 2} .0004561{col 37}{space 5} .9566306{col 51}{space 3} .9584186
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0119301{col 26}{space 2} .0002456{col 37}{space 5} .0114583{col 51}{space 3} .0124211
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0128816{col 26}{space 2} .0002551{col 37}{space 5} .0123912{col 51}{space 3} .0133912
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0176547{col 26}{space 2} .0002979{col 37}{space 5} .0170803{col 51}{space 3} .0182481
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:195,472}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}NonWhite {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .9575336{col 26}{space 2} .0004561{col 37}{space 5} .9566306{col 51}{space 3} .9584186
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .0424664{col 26}{space 2} .0004561{col 37}{space 5} .0415814{col 51}{space 3} .0433694
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:159,953}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 1}educationbr {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .1986271{col 26}{space 2} .0009976{col 37}{space 5} .1966791{col 51}{space 3} .2005895
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .4349278{col 26}{space 2} .0012396{col 37}{space 5} .4324998{col 51}{space 3} .4373588
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .3664451{col 26}{space 2} .0012048{col 37}{space 5} .3640871{col 51}{space 3} .3688096
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 7:165,343}

{txt}{hline 16}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 17}{c |}{col 40}             L{col 54}ogit
{col 17}{c |} Proportion{col 29}   Std. err.{col 41}     [95% con{col 54}f. interval]
{hline 16}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
householdincome {c |}
{space 13}1  {c |}{col 17}{res}{space 2} .2830177{col 29}{space 2} .0011078{col 40}{space 5} .2808515{col 54}{space 3} .2851941
{txt}{space 13}2  {c |}{col 17}{res}{space 2} .2884126{col 29}{space 2} .0011141{col 40}{space 5} .2862339{col 54}{space 3} .2906011
{txt}{space 13}3  {c |}{col 17}{res}{space 2} .2375426{col 29}{space 2} .0010466{col 40}{space 5} .2354973{col 54}{space 3}    .2396
{txt}{space 13}4  {c |}{col 17}{res}{space 2} .1538438{col 29}{space 2} .0008873{col 40}{space 5} .1521128{col 54}{space 3}  .155591
{txt}{space 13}5  {c |}{col 17}{res}{space 2} .0371833{col 29}{space 2} .0004653{col 40}{space 5}  .036282{col 54}{space 3} .0381062
{txt}{hline 16}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}
{res}
{txt}{col 1}Proportion estimation{col 40}{lalign 13:Number of obs}{col 53} = {res}{ralign 7:114,936}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}{col 37}             L{col 51}ogit
{col 14}{c |} Proportion{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 2}occupation {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1128628{col 26}{space 2} .0009333{col 37}{space 5} .1110464{col 51}{space 3} .1147051
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .2260562{col 26}{space 2} .0012338{col 37}{space 5} .2236472{col 51}{space 3} .2284836
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1800567{col 26}{space 2} .0011334{col 37}{space 5}  .177846{col 51}{space 3} .1822888
{txt}{space 10}4  {c |}{col 14}{res}{space 2}  .254794{col 26}{space 2} .0012853{col 37}{space 5}  .252283{col 51}{space 3} .2573213
{txt}{space 10}5  {c |}{col 14}{res}{space 2}  .017227{col 26}{space 2} .0003838{col 37}{space 5} .0164907{col 51}{space 3} .0179956
{txt}{space 10}6  {c |}{col 14}{res}{space 2} .0947049{col 26}{space 2} .0008637{col 37}{space 5} .0930256{col 51}{space 3} .0964113
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0543259{col 26}{space 2} .0006686{col 37}{space 5} .0530303{col 51}{space 3} .0556513
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0116413{col 26}{space 2} .0003164{col 37}{space 5} .0110372{col 51}{space 3}  .012278
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0483312{col 26}{space 2} .0006326{col 37}{space 5} .0471063{col 51}{space 3} .0495863
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. **Difference by sex**
. 
. 
. foreach x1 of varlist AGE householdsize townsend ztownsend ztownsend LE8* zLE8* SES*  {c -(}
{txt}  2{com}.          reg `x1' SEX if sample_final==1 
{txt}  3{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}   968.31
{txt}       Model {c |} {res} 28550.4758         1  28550.4758   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 10722522.6   363,661  29.4849396   {txt}R-squared       ={res}    0.0027
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0027
{txt}       Total {c |} {res} 10751073.1   363,662  29.5633668   {txt}Root MSE        =   {res}   5.43

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         AGE{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.5619693{col 26}{space 2} .0180595{col 37}{space 1}  -31.12{col 46}{space 3}0.000{col 54}{space 4}-.5973654{col 67}{space 3}-.5265732
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 61.28666{col 26}{space 2} .0291901{col 37}{space 1} 2099.57{col 46}{space 3}0.000{col 54}{space 4} 61.22945{col 67}{space 3} 61.34387
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  1306.70
{txt}       Model {c |} {res} 1829.25821         1  1829.25821   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 509092.752   363,661  1.39991022   {txt}R-squared       ={res}    0.0036
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0036
{txt}       Total {c |} {res}  510922.01   363,662  1.40493648   {txt}Root MSE        =   {res} 1.1832

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}households~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.1422471{col 26}{space 2} .0039351{col 37}{space 1}  -36.15{col 46}{space 3}0.000{col 54}{space 4}-.1499598{col 67}{space 3}-.1345344
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.453025{col 26}{space 2} .0063604{col 37}{space 1}  385.67{col 46}{space 3}0.000{col 54}{space 4} 2.440558{col 67}{space 3} 2.465491
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}    13.20
{txt}       Model {c |} {res} 117.030654         1  117.030654   {txt}Prob > F        ={res}    0.0003
{txt}    Residual {c |} {res} 3223949.68   363,661  8.86526101   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res} 3224066.71   363,662  8.86555844   {txt}Root MSE        =   {res} 2.9775

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    townsend{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0359795{col 26}{space 2} .0099027{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0553885{col 67}{space 3}-.0165706
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.444403{col 26}{space 2}  .016006{col 37}{space 1}  -90.24{col 46}{space 3}0.000{col 54}{space 4}-1.475775{col 67}{space 3}-1.413032
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}    13.20
{txt}       Model {c |} {res}  13.200596         1   13.200596   {txt}Prob > F        ={res}    0.0003
{txt}    Residual {c |} {res}   363648.8   363,661  .999966451   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}     363662   363,662           1   {txt}Root MSE        =   {res} .99998

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ztownsend{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0120838{col 26}{space 2} .0033258{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0186023{col 67}{space 3}-.0055653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0185789{col 26}{space 2} .0053756{col 37}{space 1}    3.46{col 46}{space 3}0.001{col 54}{space 4} .0080428{col 67}{space 3}  .029115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}    13.20
{txt}       Model {c |} {res}  13.200596         1   13.200596   {txt}Prob > F        ={res}    0.0003
{txt}    Residual {c |} {res}   363648.8   363,661  .999966451   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0000
{txt}       Total {c |} {res}     363662   363,662           1   {txt}Root MSE        =   {res} .99998

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   ztownsend{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0120838{col 26}{space 2} .0033258{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0186023{col 67}{space 3}-.0055653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0185789{col 26}{space 2} .0053756{col 37}{space 1}    3.46{col 46}{space 3}0.001{col 54}{space 4} .0080428{col 67}{space 3}  .029115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,537
{txt}{hline 13}{c +}{hline 34}   F(1, 363535)    = {res} 10142.58
{txt}       Model {c |} {res} 9508184.98         1  9508184.98   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  340796767   363,535  937.452423   {txt}R-squared       ={res}    0.0271
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0271
{txt}       Total {c |} {res}  350304952   363,536  963.604572   {txt}Root MSE        =   {res} 30.618

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_COMP1D~T{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} 10.25729{col 26}{space 2} .1018494{col 37}{space 1}  100.71{col 46}{space 3}0.000{col 54}{space 4} 10.05767{col 67}{space 3} 10.45691
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 18.21111{col 26}{space 2} .1646262{col 37}{space 1}  110.62{col 46}{space 3}0.000{col 54}{space 4} 17.88845{col 67}{space 3} 18.53377
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}   509.02
{txt}       Model {c |} {res} 632695.382         1  632695.382   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  452021426   363,661  1242.97471   {txt}R-squared       ={res}    0.0014
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0014
{txt}       Total {c |} {res}  452654121   363,662  1244.71108   {txt}Root MSE        =   {res} 35.256

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} LE8_COMP2PA{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-2.645472{col 26}{space 2} .1172565{col 37}{space 1}  -22.56{col 46}{space 3}0.000{col 54}{space 4}-2.875292{col 67}{space 3}-2.415653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 51.54565{col 26}{space 2} .1895254{col 37}{space 1}  271.97{col 46}{space 3}0.000{col 54}{space 4} 51.17419{col 67}{space 3} 51.91712
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2335.41
{txt}       Model {c |} {res} 2006393.12         1  2006393.12   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  312427534   363,661  859.117514   {txt}R-squared       ={res}    0.0064
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0064
{txt}       Total {c |} {res}  314433928   363,662  864.632344   {txt}Root MSE        =   {res} 29.311

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_COMP3N~E{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} 4.711009{col 26}{space 2} .0974837{col 37}{space 1}   48.33{col 46}{space 3}0.000{col 54}{space 4} 4.519944{col 67}{space 3} 4.902074
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  77.3832{col 26}{space 2}  .157566{col 37}{space 1}  491.12{col 46}{space 3}0.000{col 54}{space 4} 77.07438{col 67}{space 3} 77.69203
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   361,790
{txt}{hline 13}{c +}{hline 34}   F(1, 361788)    = {res}   110.49
{txt}       Model {c |} {res}  39375.552         1   39375.552   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  128931144   361,788  356.372086   {txt}R-squared       ={res}    0.0003
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0003
{txt}       Total {c |} {res}  128970520   361,789  356.479937   {txt}Root MSE        =   {res} 18.878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_COMP4S~P{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.6615983{col 26}{space 2} .0629409{col 37}{space 1}  -10.51{col 46}{space 3}0.000{col 54}{space 4}-.7849606{col 67}{space 3} -.538236
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 89.99637{col 26}{space 2} .1016918{col 37}{space 1}  884.99{col 46}{space 3}0.000{col 54}{space 4} 89.79706{col 67}{space 3} 90.19568
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   361,881
{txt}{hline 13}{c +}{hline 34}   F(1, 361879)    = {res}  2073.70
{txt}       Model {c |} {res} 1673900.61         1  1673900.61   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  292110247   361,879  807.204196   {txt}R-squared       ={res}    0.0057
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0057
{txt}       Total {c |} {res}  293784148   361,880  811.827534   {txt}Root MSE        =   {res} 28.411

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_COMP5BMI{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} 4.313812{col 26}{space 2} .0947301{col 37}{space 1}   45.54{col 46}{space 3}0.000{col 54}{space 4} 4.128144{col 67}{space 3}  4.49948
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 61.63033{col 26}{space 2}  .153147{col 37}{space 1}  402.43{col 46}{space 3}0.000{col 54}{space 4} 61.33017{col 67}{space 3}  61.9305
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   312,732
{txt}{hline 13}{c +}{hline 34}   F(1, 312730)    = {res}  8120.41
{txt}       Model {c |} {res} 7206954.07         1  7206954.07   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  277551292   312,730  887.510928   {txt}R-squared       ={res}    0.0253
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0253
{txt}       Total {c |} {res}  284758247   312,731  910.553308   {txt}Root MSE        =   {res} 29.791

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_COMP6L~S{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}   -9.621{col 26}{space 2} .1067656{col 37}{space 1}  -90.11{col 46}{space 3}0.000{col 54}{space 4}-9.830257{col 67}{space 3}-9.411742
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 62.80396{col 26}{space 2} .1720382{col 37}{space 1}  365.06{col 46}{space 3}0.000{col 54}{space 4} 62.46677{col 67}{space 3} 63.14115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   339,335
{txt}{hline 13}{c +}{hline 34}   F(1, 339333)    = {res}  1238.84
{txt}       Model {c |} {res} 545965.241         1  545965.241   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  149545909   339,333   440.70547   {txt}R-squared       ={res}    0.0036
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0036
{txt}       Total {c |} {res}  150091875   339,334  442.313103   {txt}Root MSE        =   {res} 20.993

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_COMP7G~C{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}  2.54331{col 26}{space 2} .0722588{col 37}{space 1}   35.20{col 46}{space 3}0.000{col 54}{space 4} 2.401684{col 67}{space 3} 2.684935
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 85.55987{col 26}{space 2} .1166634{col 37}{space 1}  733.39{col 46}{space 3}0.000{col 54}{space 4} 85.33122{col 67}{space 3} 85.78853
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   340,065
{txt}{hline 13}{c +}{hline 34}   F(1, 340063)    = {res}  3403.58
{txt}       Model {c |} {res} 3183076.51         1  3183076.51   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  318031893   340,063  935.214631   {txt}R-squared       ={res}    0.0099
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0099
{txt}       Total {c |} {res}  321214970   340,064  944.572109   {txt}Root MSE        =   {res} 30.581

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} LE8_COMP8BP{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} 6.135989{col 26}{space 2}  .105176{col 37}{space 1}   58.34{col 46}{space 3}0.000{col 54}{space 4} 5.929848{col 67}{space 3} 6.342131
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 28.55438{col 26}{space 2} .1699792{col 37}{space 1}  167.99{col 46}{space 3}0.000{col 54}{space 4} 28.22122{col 67}{space 3} 28.88753
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2700.94
{txt}       Model {c |} {res}   24909505         1    24909505   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.3539e+09   363,661  9222.52269   {txt}R-squared       ={res}    0.0074
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0074
{txt}       Total {c |} {res} 3.3788e+09   363,662  9290.99364   {txt}Root MSE        =   {res} 96.034

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_TOTALS~E{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} 16.59925{col 26}{space 2}  .319397{col 37}{space 1}   51.97{col 46}{space 3}0.000{col 54}{space 4} 15.97324{col 67}{space 3} 17.22526
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 474.9887{col 26}{space 2} .5162512{col 37}{space 1}  920.07{col 46}{space 3}0.000{col 54}{space 4} 473.9768{col 67}{space 3} 476.0005
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  3011.33
{txt}       Model {c |} {res} 12097887.9         1  12097887.9   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.4610e+09   363,661  4017.45171   {txt}R-squared       ={res}    0.0082
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0082
{txt}       Total {c |} {res} 1.4731e+09   363,662  4050.70751   {txt}Root MSE        =   {res} 63.383

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_LIFEST~E{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} 11.56806{col 26}{space 2} .2108052{col 37}{space 1}   54.88{col 46}{space 3}0.000{col 54}{space 4} 11.15489{col 67}{space 3} 11.98124
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 237.0723{col 26}{space 2} .3407309{col 37}{space 1}  695.78{col 46}{space 3}0.000{col 54}{space 4} 236.4045{col 67}{space 3} 237.7401
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   361,980
{txt}{hline 13}{c +}{hline 34}   F(1, 361978)    = {res}   456.05
{txt}       Model {c |} {res}  2019748.2         1   2019748.2   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.6031e+09   361,978  4428.78009   {txt}R-squared       ={res}    0.0013
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0013
{txt}       Total {c |} {res} 1.6051e+09   361,979   4434.3476   {txt}Root MSE        =   {res} 66.549

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_BIOLOG~L{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}  4.73771{col 26}{space 2} .2218512{col 37}{space 1}   21.36{col 46}{space 3}0.000{col 54}{space 4} 4.302888{col 67}{space 3} 5.172531
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 238.1881{col 26}{space 2} .3586059{col 37}{space 1}  664.21{col 46}{space 3}0.000{col 54}{space 4} 237.4853{col 67}{space 3}  238.891
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2462.12
{txt}       Model {c |} {res} 1623.00217         1  1623.00217   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 239720.985   363,661  .659188049   {txt}R-squared       ={res}    0.0067
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0067
{txt}       Total {c |} {res} 241343.987   363,662  .663649178   {txt}Root MSE        =   {res}  .8119

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_TOTALS~t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .1339879{col 26}{space 2} .0027003{col 37}{space 1}   49.62{col 46}{space 3}0.000{col 54}{space 4} .1286954{col 67}{space 3} .1392804
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.780829{col 26}{space 2} .0043646{col 37}{space 1}  408.02{col 46}{space 3}0.000{col 54}{space 4} 1.772275{col 67}{space 3} 1.789384
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2462.12
{txt}       Model {c |} {res} 1623.00217         1  1623.00217   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 239720.985   363,661  .659188049   {txt}R-squared       ={res}    0.0067
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0067
{txt}       Total {c |} {res} 241343.987   363,662  .663649178   {txt}Root MSE        =   {res}  .8119

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LE8_TOTALS~v{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.1339879{col 26}{space 2} .0027003{col 37}{space 1}  -49.62{col 46}{space 3}0.000{col 54}{space 4}-.1392804{col 67}{space 3}-.1286954
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.219171{col 26}{space 2} .0043646{col 37}{space 1}  508.45{col 46}{space 3}0.000{col 54}{space 4} 2.210616{col 67}{space 3} 2.227725
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,537
{txt}{hline 13}{c +}{hline 34}   F(1, 363535)    = {res} 10142.58
{txt}       Model {c |} {res} 9867.31068         1  9867.31068   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 353668.714   363,535  .972860148   {txt}R-squared       ={res}    0.0271
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0271
{txt}       Total {c |} {res} 363536.025   363,536  1.00000007   {txt}Root MSE        =   {res} .98634

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP1~T{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .3304328{col 26}{space 2}  .003281{col 37}{space 1}  100.71{col 46}{space 3}0.000{col 54}{space 4} .3240021{col 67}{space 3} .3368635
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5080567{col 26}{space 2} .0053033{col 37}{space 1}  -95.80{col 46}{space 3}0.000{col 54}{space 4}-.5184511{col 67}{space 3}-.4976624
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}   509.02
{txt}       Model {c |} {res} 508.307058         1  508.307058   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 363153.702   363,661  .998605024   {txt}R-squared       ={res}    0.0014
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0014
{txt}       Total {c |} {res} 363662.009   363,662  1.00000002   {txt}Root MSE        =   {res}  .9993

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP2PA{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0749841{col 26}{space 2} .0033236{col 37}{space 1}  -22.56{col 46}{space 3}0.000{col 54}{space 4}-.0814981{col 67}{space 3}  -.06847
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1152886{col 26}{space 2}  .005372{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .1047598{col 67}{space 3} .1258175
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2335.41
{txt}       Model {c |} {res} 2320.51594         1  2320.51594   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 361341.479   363,661   .99362175   {txt}R-squared       ={res}    0.0064
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0064
{txt}       Total {c |} {res} 363661.995   363,662  .999999987   {txt}Root MSE        =   {res} .99681

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP3~E{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .1602132{col 26}{space 2} .0033153{col 37}{space 1}   48.33{col 46}{space 3}0.000{col 54}{space 4} .1537154{col 67}{space 3}  .166711
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2463291{col 26}{space 2} .0053585{col 37}{space 1}  -45.97{col 46}{space 3}0.000{col 54}{space 4}-.2568317{col 67}{space 3}-.2358265
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   361,790
{txt}{hline 13}{c +}{hline 34}   F(1, 361788)    = {res}   110.49
{txt}       Model {c |} {res} 110.456565         1  110.456565   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 361678.521   361,788  .999697394   {txt}R-squared       ={res}    0.0003
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0003
{txt}       Total {c |} {res} 361788.977   361,789  .999999938   {txt}Root MSE        =   {res} .99985

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP4~P{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} -.035041{col 26}{space 2} .0033336{col 37}{space 1}  -10.51{col 46}{space 3}0.000{col 54}{space 4}-.0415748{col 67}{space 3}-.0285072
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .053851{col 26}{space 2}  .005386{col 37}{space 1}   10.00{col 46}{space 3}0.000{col 54}{space 4} .0432945{col 67}{space 3} .0644074
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   361,881
{txt}{hline 13}{c +}{hline 34}   F(1, 361879)    = {res}  2073.70
{txt}       Model {c |} {res} 2061.89195         1  2061.89195   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 359818.121   361,879   .99430506   {txt}R-squared       ={res}    0.0057
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0057
{txt}       Total {c |} {res} 361880.013   361,880  1.00000004   {txt}Root MSE        =   {res} .99715

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP5~I{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .1514012{col 26}{space 2} .0033247{col 37}{space 1}   45.54{col 46}{space 3}0.000{col 54}{space 4} .1448848{col 67}{space 3} .1579176
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2328354{col 26}{space 2}  .005375{col 37}{space 1}  -43.32{col 46}{space 3}0.000{col 54}{space 4}-.2433702{col 67}{space 3}-.2223006
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   312,732
{txt}{hline 13}{c +}{hline 34}   F(1, 312730)    = {res}  8120.41
{txt}       Model {c |} {res} 7914.91714         1  7914.91714   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 304816.075   312,730  .974694065   {txt}R-squared       ={res}    0.0253
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0253
{txt}       Total {c |} {res} 312730.992   312,731  .999999974   {txt}Root MSE        =   {res} .98727

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP6~S{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.3188361{col 26}{space 2} .0035382{col 37}{space 1}  -90.11{col 46}{space 3}0.000{col 54}{space 4}-.3257708{col 67}{space 3}-.3119014
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4885095{col 26}{space 2} .0057013{col 37}{space 1}   85.68{col 46}{space 3}0.000{col 54}{space 4} .4773352{col 67}{space 3} .4996839
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   339,335
{txt}{hline 13}{c +}{hline 34}   F(1, 339333)    = {res}  1238.84
{txt}       Model {c |} {res} 1234.34113         1  1234.34113   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 338099.668   339,333  .996365423   {txt}R-squared       ={res}    0.0036
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0036
{txt}       Total {c |} {res} 339334.009   339,334  1.00000003   {txt}Root MSE        =   {res} .99818

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP7~C{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .1209301{col 26}{space 2} .0034358{col 37}{space 1}   35.20{col 46}{space 3}0.000{col 54}{space 4}  .114196{col 67}{space 3} .1276641
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1856953{col 26}{space 2} .0055471{col 37}{space 1}  -33.48{col 46}{space 3}0.000{col 54}{space 4}-.1965676{col 67}{space 3}-.1748231
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   340,065
{txt}{hline 13}{c +}{hline 34}   F(1, 340063)    = {res}  3403.58
{txt}       Model {c |} {res} 3369.86068         1  3369.86068   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 336694.141   340,063  .990093425   {txt}R-squared       ={res}    0.0099
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0099
{txt}       Total {c |} {res} 340064.001   340,064           1   {txt}Root MSE        =   {res} .99503

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_COMP8BP{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}  .199649{col 26}{space 2} .0034222{col 37}{space 1}   58.34{col 46}{space 3}0.000{col 54}{space 4} .1929416{col 67}{space 3} .2063563
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.306921{col 26}{space 2} .0055307{col 37}{space 1}  -55.49{col 46}{space 3}0.000{col 54}{space 4}-.3177609{col 67}{space 3} -.296081
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2700.94
{txt}       Model {c |} {res}  2681.0378         1   2681.0378   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 360980.964   363,661    .9926304   {txt}R-squared       ={res}    0.0074
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0074
{txt}       Total {c |} {res} 363662.002   363,662           1   {txt}Root MSE        =   {res} .99631

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_TOTAL~E{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .1722096{col 26}{space 2} .0033136{col 37}{space 1}   51.97{col 46}{space 3}0.000{col 54}{space 4} .1657151{col 67}{space 3} .1787042
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2647738{col 26}{space 2} .0053559{col 37}{space 1}  -49.44{col 46}{space 3}0.000{col 54}{space 4}-.2752711{col 67}{space 3}-.2542764
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2462.12
{txt}       Model {c |} {res}  2445.5723         1   2445.5723   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}   361216.4   363,661  .993277804   {txt}R-squared       ={res}    0.0067
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0067
{txt}       Total {c |} {res} 363661.972   363,662  .999999923   {txt}Root MSE        =   {res} .99663

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_TOTAL~t{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .1644736{col 26}{space 2} .0033147{col 37}{space 1}   49.62{col 46}{space 3}0.000{col 54}{space 4} .1579769{col 67}{space 3} .1709703
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2528795{col 26}{space 2} .0053576{col 37}{space 1}  -47.20{col 46}{space 3}0.000{col 54}{space 4}-.2633803{col 67}{space 3}-.2423788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2462.12
{txt}       Model {c |} {res}  2445.5723         1   2445.5723   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}   361216.4   363,661  .993277804   {txt}R-squared       ={res}    0.0067
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0067
{txt}       Total {c |} {res} 363661.972   363,662  .999999923   {txt}Root MSE        =   {res} .99663

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_TO~tinv{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.1644736{col 26}{space 2} .0033147{col 37}{space 1}  -49.62{col 46}{space 3}0.000{col 54}{space 4}-.1709703{col 67}{space 3}-.1579769
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2528795{col 26}{space 2} .0053576{col 37}{space 1}   47.20{col 46}{space 3}0.000{col 54}{space 4} .2423788{col 67}{space 3} .2633803
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  3011.33
{txt}       Model {c |} {res} 2986.61105         1  2986.61105   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  360675.39   363,661  .991790128   {txt}R-squared       ={res}    0.0082
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0082
{txt}       Total {c |} {res} 363662.001   363,662           1   {txt}Root MSE        =   {res} .99589

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_LIFES~E{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .1817587{col 26}{space 2} .0033122{col 37}{space 1}   54.88{col 46}{space 3}0.000{col 54}{space 4} .1752669{col 67}{space 3} .1882505
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2794556{col 26}{space 2} .0053536{col 37}{space 1}  -52.20{col 46}{space 3}0.000{col 54}{space 4}-.2899485{col 67}{space 3}-.2689627
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   361,980
{txt}{hline 13}{c +}{hline 34}   F(1, 361978)    = {res}   456.05
{txt}       Model {c |} {res} 455.478125         1  455.478125   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 361523.528   361,978  .998744475   {txt}R-squared       ={res}    0.0013
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0013
{txt}       Total {c |} {res} 361979.006   361,979  1.00000002   {txt}Root MSE        =   {res} .99937

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_BIOLO~L{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2} .0711465{col 26}{space 2} .0033316{col 37}{space 1}   21.36{col 46}{space 3}0.000{col 54}{space 4} .0646168{col 67}{space 3} .0776763
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1093956{col 26}{space 2} .0053852{col 37}{space 1}  -20.31{col 46}{space 3}0.000{col 54}{space 4}-.1199504{col 67}{space 3}-.0988407
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  3011.33
{txt}       Model {c |} {res} 2986.61105         1  2986.61105   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  360675.39   363,661  .991790128   {txt}R-squared       ={res}    0.0082
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0082
{txt}       Total {c |} {res} 363662.001   363,662           1   {txt}Root MSE        =   {res} .99589

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_LIFES~v{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.1817587{col 26}{space 2} .0033122{col 37}{space 1}  -54.88{col 46}{space 3}0.000{col 54}{space 4}-.1882505{col 67}{space 3}-.1752669
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2794556{col 26}{space 2} .0053536{col 37}{space 1}   52.20{col 46}{space 3}0.000{col 54}{space 4} .2689627{col 67}{space 3} .2899485
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  3011.33
{txt}       Model {c |} {res} 2986.61105         1  2986.61105   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  360675.39   363,661  .991790128   {txt}R-squared       ={res}    0.0082
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0082
{txt}       Total {c |} {res} 363662.001   363,662           1   {txt}Root MSE        =   {res} .99589

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_BIOLO~v{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.1817587{col 26}{space 2} .0033122{col 37}{space 1}  -54.88{col 46}{space 3}0.000{col 54}{space 4}-.1882505{col 67}{space 3}-.1752669
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2794556{col 26}{space 2} .0053536{col 37}{space 1}   52.20{col 46}{space 3}0.000{col 54}{space 4} .2689627{col 67}{space 3} .2899485
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}  2700.94
{txt}       Model {c |} {res}  2681.0378         1   2681.0378   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 360980.964   363,661    .9926304   {txt}R-squared       ={res}    0.0074
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0074
{txt}       Total {c |} {res} 363662.002   363,662           1   {txt}Root MSE        =   {res} .99631

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}zLE8_TO~Einv{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.1722096{col 26}{space 2} .0033136{col 37}{space 1}  -51.97{col 46}{space 3}0.000{col 54}{space 4}-.1787042{col 67}{space 3}-.1657151
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2647738{col 26}{space 2} .0053559{col 37}{space 1}   49.44{col 46}{space 3}0.000{col 54}{space 4} .2542764{col 67}{space 3} .2752711
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}   233.92
{txt}       Model {c |} {res} 114.167919         1  114.167919   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 177491.353   363,661  .488068154   {txt}R-squared       ={res}    0.0006
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0006
{txt}       Total {c |} {res} 177605.521   363,662  .488380751   {txt}Root MSE        =   {res} .69862

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         SES{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0355368{col 26}{space 2} .0023235{col 37}{space 1}  -15.29{col 46}{space 3}0.000{col 54}{space 4}-.0400908{col 67}{space 3}-.0309827
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0048181{col 26}{space 2} .0037556{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.0025427{col 67}{space 3}  .012179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   363,663
{txt}{hline 13}{c +}{hline 34}   F(1, 363661)    = {res}   507.45
{txt}       Model {c |} {res}  150.63438         1   150.63438   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 107950.257   363,661  .296843095   {txt}R-squared       ={res}    0.0014
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0014
{txt}       Total {c |} {res} 108100.891   363,662  .297256494   {txt}Root MSE        =   {res} .54483

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      SESres{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0408195{col 26}{space 2}  .001812{col 37}{space 1}  -22.53{col 46}{space 3}0.000{col 54}{space 4}-.0443711{col 67}{space 3} -.037268
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0627604{col 26}{space 2} .0029289{col 37}{space 1}   21.43{col 46}{space 3}0.000{col 54}{space 4} .0570199{col 67}{space 3} .0685009
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. foreach x2 of varlist dem_diag PD_diag died  RACE_ETHN NonWhite educationbr householdincome  occupation {c -(} 
{txt}  2{com}.          mlogit `x2' SEX if sample_final==1
{txt}  3{com}.                 
. {c )-}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-31900.822}  
Iteration 1:{space 2}Log likelihood = {res:-31836.359}  
Iteration 2:{space 2}Log likelihood = {res:-31836.038}  
Iteration 3:{space 2}Log likelihood = {res:-31836.038}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 56}{lalign 13:LR chi2({res:1})}{col 69} = {res}{ralign 7:129.57}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-31836.038}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0020}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    dem_diag{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.2889804{col 26}{space 2} .0254244{col 37}{space 1}  -11.37{col 46}{space 3}0.000{col 54}{space 4}-.3388112{col 67}{space 3}-.2391495
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.599756{col 26}{space 2} .0394177{col 37}{space 1}  -91.32{col 46}{space 3}0.000{col 54}{space 4}-3.677014{col 67}{space 3}-3.522499
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-15367.438}  
Iteration 1:{space 2}Log likelihood = {res:-15212.534}  
Iteration 2:{space 2}Log likelihood = {res:-15207.632}  
Iteration 3:{space 2}Log likelihood = {res:-15207.628}  
Iteration 4:{space 2}Log likelihood = {res:-15207.628}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 56}{lalign 13:LR chi2({res:1})}{col 69} = {res}{ralign 7:319.62}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-15207.628}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0104}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     PD_diag{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.7172375{col 26}{space 2} .0410277{col 37}{space 1}  -17.48{col 46}{space 3}0.000{col 54}{space 4}-.7976503{col 67}{space 3}-.6368247
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.899067{col 26}{space 2}  .059353{col 37}{space 1}  -65.69{col 46}{space 3}0.000{col 54}{space 4}-4.015396{col 67}{space 3}-3.782737
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-107821.08}  
Iteration 1:{space 2}Log likelihood = {res:   -106472}  
Iteration 2:{space 2}Log likelihood = {res:-106449.74}  
Iteration 3:{space 2}Log likelihood = {res:-106449.73}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 56}{lalign 13:LR chi2({res:1})}{col 69} = {res}{ralign 7:2742.69}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-106449.73}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0127}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        died{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.6200619{col 26}{space 2} .0119808{col 37}{space 1}  -51.75{col 46}{space 3}0.000{col 54}{space 4}-.6435439{col 67}{space 3}  -.59658
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.431916{col 26}{space 2} .0178979{col 37}{space 1}  -80.00{col 46}{space 3}0.000{col 54}{space 4}-1.466995{col 67}{space 3}-1.396836
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-80746.875}  
Iteration 1:{space 2}Log likelihood = {res:-80640.658}  
Iteration 2:{space 2}Log likelihood = {res:-80640.147}  
Iteration 3:{space 2}Log likelihood = {res:-80640.147}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 56}{lalign 13:LR chi2({res:3})}{col 69} = {res}{ralign 7:213.46}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-80640.147}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0013}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   RACE_ETHN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2} .2076646{col 26}{space 2} .0324633{col 37}{space 1}    6.40{col 46}{space 3}0.000{col 54}{space 4} .1440377{col 67}{space 3} .2712915
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.800626{col 26}{space 2} .0539721{col 37}{space 1}  -88.95{col 46}{space 3}0.000{col 54}{space 4}-4.906409{col 67}{space 3}-4.694842
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.3186044{col 26}{space 2} .0272833{col 37}{space 1}  -11.68{col 46}{space 3}0.000{col 54}{space 4}-.3720786{col 67}{space 3}-.2651302
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.671349{col 26}{space 2}  .042072{col 37}{space 1}  -87.26{col 46}{space 3}0.000{col 54}{space 4}-3.753809{col 67}{space 3}-3.588889
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2} .1481751{col 26}{space 2} .0263049{col 37}{space 1}    5.63{col 46}{space 3}0.000{col 54}{space 4} .0966184{col 67}{space 3} .1997319
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.289709{col 26}{space 2} .0433873{col 37}{space 1}  -98.87{col 46}{space 3}0.000{col 54}{space 4}-4.374746{col 67}{space 3}-4.204671
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-63980.007}  
Iteration 1:{space 2}Log likelihood = {res: -63979.98}  
Iteration 2:{space 2}Log likelihood = {res: -63979.98}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 56}{lalign 13:LR chi2({res:1})}{col 69} = {res}{ralign 7:0.06}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.8142}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-63979.98}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    NonWhite{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0038718{col 26}{space 2} .0164776{col 37}{space 1}   -0.23{col 46}{space 3}0.814{col 54}{space 4}-.0361672{col 67}{space 3} .0284236
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.107903{col 26}{space 2} .0266197{col 37}{space 1} -116.75{col 46}{space 3}0.000{col 54}{space 4}-3.160077{col 67}{space 3}-3.055729
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-314572.53}  
Iteration 1:{space 2}Log likelihood = {res:-313363.44}  
Iteration 2:{space 2}Log likelihood = {res:-313362.82}  
Iteration 3:{space 2}Log likelihood = {res:-313362.82}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:295,053}
{txt}{col 56}{lalign 13:LR chi2({res:2})}{col 69} = {res}{ralign 7:2419.42}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-313362.82}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0038}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} educationbr{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}0            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.4149856{col 26}{space 2} .0098992{col 37}{space 1}  -41.92{col 46}{space 3}0.000{col 54}{space 4}-.4343876{col 67}{space 3}-.3955836
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0462204{col 26}{space 2} .0159507{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .0149577{col 67}{space 3} .0774831
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.3440382{col 26}{space 2} .0084078{col 37}{space 1}  -40.92{col 46}{space 3}0.000{col 54}{space 4}-.3605171{col 67}{space 3}-.3275593
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5167453{col 26}{space 2} .0137279{col 37}{space 1}   37.64{col 46}{space 3}0.000{col 54}{space 4} .4898391{col 67}{space 3} .5436516
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-475285.65}  
Iteration 1:{space 2}Log likelihood = {res:-474239.71}  
Iteration 2:{space 2}Log likelihood = {res:-474238.06}  
Iteration 3:{space 2}Log likelihood = {res:-474238.06}  
{res}
{txt}{col 1}Multinomial logistic regression{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:318,568}
{txt}{col 56}{lalign 13:LR chi2({res:4})}{col 69} = {res}{ralign 7:2095.17}
{txt}{col 56}{lalign 13:Prob > chi2}{col 69} = {res}{ralign 7:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-474238.06}{txt}{col 56}{lalign 13:Pseudo R2}{col 69} = {res}{ralign 7:0.0022}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}householdi~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2} .1155899{col 26}{space 2} .0097371{col 37}{space 1}   11.87{col 46}{space 3}0.000{col 54}{space 4} .0965055{col 67}{space 3} .1346743
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2500622{col 26}{space 2} .0158816{col 37}{space 1}  -15.75{col 46}{space 3}0.000{col 54}{space 4}-.2811896{col 67}{space 3}-.2189348
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}2           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.1511908{col 26}{space 2}  .009821{col 37}{space 1}  -15.39{col 46}{space 3}0.000{col 54}{space 4}-.1704395{col 67}{space 3} -.131942
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1083363{col 26}{space 2} .0157007{col 37}{space 1}    6.90{col 46}{space 3}0.000{col 54}{space 4} .0775635{col 67}{space 3} .1391092
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.3051887{col 26}{space 2} .0108891{col 37}{space 1}  -28.03{col 46}{space 3}0.000{col 54}{space 4}-.3265309{col 67}{space 3}-.2838465
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0180766{col 26}{space 2} .0171301{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4} -.051651{col 67}{space 3} .0154977
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.4090579{col 26}{space 2} .0182812{col 37}{space 1}  -22.38{col 46}{space 3}0.000{col 54}{space 4}-.4448884{col 67}{space 3}-.3732274
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.230416{col 26}{space 2} .0280345{col 37}{space 1}  -43.89{col 46}{space 3}0.000{col 54}{space 4}-1.285363{col 67}{space 3}-1.175469
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{res}{txt}Iteration 0:{space 2}Log likelihood = {res:-444836.15}  
Iteration 1:{space 2}Log likelihood = {res:-424450.32}  
Iteration 2:{space 2}Log likelihood = {res:-422811.74}  
Iteration 3:{space 2}Log likelihood = {res:-422789.36}  
Iteration 4:{space 2}Log likelihood = {res:-422789.34}  
{res}
{txt}{col 1}Multinomial logistic regression{col 55}{lalign 13:Number of obs}{col 68} = {res}{ralign 8:220,999}
{txt}{col 55}{lalign 13:LR chi2({res:8})}{col 68} = {res}{ralign 8:44093.63}
{txt}{col 55}{lalign 13:Prob > chi2}{col 68} = {res}{ralign 8:0.0000}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-422789.34}{txt}{col 55}{lalign 13:Pseudo R2}{col 68} = {res}{ralign 8:0.0496}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  occupation{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.5089408{col 26}{space 2}  .014013{col 37}{space 1}  -36.32{col 46}{space 3}0.000{col 54}{space 4}-.5364058{col 67}{space 3}-.4814758
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3232708{col 26}{space 2} .0209457{col 37}{space 1}   15.43{col 46}{space 3}0.000{col 54}{space 4} .2822178{col 67}{space 3} .3643237
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}2           {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2} .3669387{col 26}{space 2} .0137798{col 37}{space 1}   26.63{col 46}{space 3}0.000{col 54}{space 4} .3399309{col 67}{space 3} .3939465
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.9613893{col 26}{space 2} .0223406{col 37}{space 1}  -43.03{col 46}{space 3}0.000{col 54}{space 4}-1.005176{col 67}{space 3}-.9176026
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2} 1.495682{col 26}{space 2} .0159501{col 37}{space 1}   93.77{col 46}{space 3}0.000{col 54}{space 4} 1.464421{col 67}{space 3} 1.526944
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.871693{col 26}{space 2} .0282793{col 37}{space 1} -101.55{col 46}{space 3}0.000{col 54}{space 4} -2.92712{col 67}{space 3}-2.816267
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-1.961684{col 26}{space 2} .0254524{col 37}{space 1}  -77.07{col 46}{space 3}0.000{col 54}{space 4} -2.01157{col 67}{space 3}-1.911798
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.34907{col 26}{space 2} .0309951{col 37}{space 1}   43.53{col 46}{space 3}0.000{col 54}{space 4} 1.288321{col 67}{space 3} 1.409819
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2} 1.574586{col 26}{space 2} .0242794{col 37}{space 1}   64.85{col 46}{space 3}0.000{col 54}{space 4} 1.526999{col 67}{space 3} 1.622172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.019189{col 26}{space 2} .0443495{col 37}{space 1}  -90.63{col 46}{space 3}0.000{col 54}{space 4}-4.106113{col 67}{space 3}-3.932266
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2} 1.225518{col 26}{space 2} .0274732{col 37}{space 1}   44.61{col 46}{space 3}0.000{col 54}{space 4} 1.171672{col 67}{space 3} 1.279365
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.876819{col 26}{space 2} .0492258{col 37}{space 1}  -78.76{col 46}{space 3}0.000{col 54}{space 4}  -3.9733{col 67}{space 3}-3.780339
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-1.872658{col 26}{space 2} .0305276{col 37}{space 1}  -61.34{col 46}{space 3}0.000{col 54}{space 4}-1.932491{col 67}{space 3}-1.812825
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7790915{col 26}{space 2} .0370152{col 37}{space 1}   21.05{col 46}{space 3}0.000{col 54}{space 4} .7065431{col 67}{space 3}   .85164
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 9}SEX {c |}{col 14}{res}{space 2}-.0212133{col 26}{space 2}  .020567{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-.0615239{col 67}{space 3} .0190973
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.500279{col 26}{space 2} .0321946{col 37}{space 1}  -46.60{col 46}{space 3}0.000{col 54}{space 4}-1.563379{col 67}{space 3}-1.437179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}