{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER9B_TDIPDDEMMORT\DATA\finaldata_unimputedfin_MULTISTATE",clear
{txt}
{com}. 
. 
. ********************MODEL 1: REDUCED MODEL***************************
. 
. 
. **Transition 1**
. 
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-25342.079}  
Iteration 2:{space 2}Log likelihood = {res: -24244.91}  
Iteration 3:{space 2}Log likelihood = {res:-22631.781}  
Iteration 4:{space 2}Log likelihood = {res:-22303.706}  
Iteration 5:{space 2}Log likelihood = {res:-21890.774}  
Iteration 6:{space 2}Log likelihood = {res:-21393.072}  
Iteration 7:{space 2}Log likelihood = {res:-20998.676}  
Iteration 8:{space 2}Log likelihood = {res:-20700.709}  
Iteration 9:{space 2}Log likelihood = {res:-20428.123}  
Iteration 10:{space 1}Log likelihood = {res:-20332.912}  
Iteration 11:{space 1}Log likelihood = {res:-20021.774}  
Iteration 12:{space 1}Log likelihood = {res:-19900.003}  
Iteration 13:{space 1}Log likelihood = {res:-19806.885}  
Iteration 14:{space 1}Log likelihood = {res:-19789.039}  
Iteration 15:{space 1}Log likelihood = {res:-19765.155}  
Iteration 16:{space 1}Log likelihood = {res:-19745.071}  
Iteration 17:{space 1}Log likelihood = {res:-19734.373}  
Iteration 18:{space 1}Log likelihood = {res:-19729.972}  
Iteration 19:{space 1}Log likelihood = {res:-19728.997}  
Iteration 20:{space 1}Log likelihood = {res:-19728.982}  
Iteration 21:{space 1}Log likelihood = {res:-19728.982}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-19728.982}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0554297{col 26}{space 2} .0204094{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 55}{space 3} .0154281{col 67}{space 3} .0954314
{col 1}{text}         SEX{col 14}{c |}{result}{space 2} -.659804{col 26}{space 2} .0421546{col 37}{space 1}  -15.65{col 46}{space 3}0.000{col 55}{space 3}-.7424255{col 67}{space 3}-.5771826
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0996494{col 26}{space 2} .0064017{col 37}{space 1}  -15.57{col 46}{space 3}0.000{col 55}{space 3}-.1121966{col 67}{space 3}-.0871023
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0501281{col 26}{space 2} .1095528{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 55}{space 3}-.1645915{col 67}{space 3} .2648477
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0162088{col 26}{space 2} .0159759{col 37}{space 1}    1.01{col 46}{space 3}0.310{col 55}{space 3}-.0151033{col 67}{space 3}  .047521
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0822736{col 26}{space 2} .0388777{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 55}{space 3}-.1584724{col 67}{space 3}-.0060747
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-73.95516{col 26}{space 2} 1.240519{col 37}{space 1}  -59.62{col 46}{space 3}0.000{col 55}{space 3}-76.38654{col 67}{space 3}-71.52379
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.870367{col 26}{space 2} .0194128{col 37}{space 1}  147.86{col 46}{space 3}0.000{col 55}{space 3} 2.832319{col 67}{space 3} 2.908416
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-19629.322}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0508355{col 26}{space 2} .0204554{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 55}{space 3} .0107436{col 67}{space 3} .0909274
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.6569425{col 26}{space 2} .0421658{col 37}{space 1}  -15.58{col 46}{space 3}0.000{col 55}{space 3} -.739586{col 67}{space 3}-.5742989
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0818752{col 26}{space 2} .0062385{col 37}{space 1}  -13.12{col 46}{space 3}0.000{col 55}{space 3}-.0941024{col 67}{space 3} -.069648
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0166633{col 26}{space 2} .1097004{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 55}{space 3}-.1983455{col 67}{space 3} .2316721
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0103582{col 26}{space 2} .0169011{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 55}{space 3}-.0227674{col 67}{space 3} .0434838
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0823192{col 26}{space 2} .0389084{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 55}{space 3}-.1585782{col 67}{space 3}-.0060602
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0827797{col 26}{space 2} .0065061{col 37}{space 1}   12.72{col 46}{space 3}0.000{col 55}{space 3} .0700281{col 67}{space 3} .0955314
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .1587173{col 26}{space 2} .4024996{col 37}{space 1}    0.39{col 46}{space 3}0.693{col 55}{space 3}-.6301674{col 67}{space 3}  .947602
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 2**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-54908.652}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-53401.607}  
Iteration 3:{space 2}Log likelihood = {res:-51678.803}  
Iteration 4:{space 2}Log likelihood = {res: -49666.97}  
Iteration 5:{space 2}Log likelihood = {res:-45717.473}  
Iteration 6:{space 2}Log likelihood = {res:-45137.351}  
Iteration 7:{space 2}Log likelihood = {res:-43736.759}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-43691.418}  
Iteration 9:{space 2}Log likelihood = {res:-43294.633}  
Iteration 10:{space 1}Log likelihood = {res:-42774.024}  
Iteration 11:{space 1}Log likelihood = {res:-42080.668}  
Iteration 12:{space 1}Log likelihood = {res:-41642.346}  
Iteration 13:{space 1}Log likelihood = {res:-41235.403}  
Iteration 14:{space 1}Log likelihood = {res:-40670.912}  
Iteration 15:{space 1}Log likelihood = {res:-40549.991}  
Iteration 16:{space 1}Log likelihood = {res:-40243.531}  
Iteration 17:{space 1}Log likelihood = {res:-40012.626}  
Iteration 18:{space 1}Log likelihood = {res:-39921.639}  
Iteration 19:{space 1}Log likelihood = {res:-39855.337}  
Iteration 20:{space 1}Log likelihood = {res: -39795.05}  
Iteration 21:{space 1}Log likelihood = {res:-39755.616}  
Iteration 22:{space 1}Log likelihood = {res:-39738.752}  
Iteration 23:{space 1}Log likelihood = {res:-39727.187}  
Iteration 24:{space 1}Log likelihood = {res:-39723.994}  
Iteration 25:{space 1}Log likelihood = {res:-39723.495}  
Iteration 26:{space 1}Log likelihood = {res:-39723.471}  
Iteration 27:{space 1}Log likelihood = {res: -39723.47}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-39723.47}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1940881{col 26}{space 2} .0124859{col 37}{space 1}   15.54{col 46}{space 3}0.000{col 55}{space 3} .1696162{col 67}{space 3} .2185601
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2138977{col 26}{space 2} .0265266{col 37}{space 1}   -8.06{col 46}{space 3}0.000{col 55}{space 3} -.265889{col 67}{space 3}-.1619065
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0882334{col 26}{space 2} .0047745{col 37}{space 1}  -18.48{col 46}{space 3}0.000{col 55}{space 3}-.0975913{col 67}{space 3}-.0788756
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .1200477{col 26}{space 2} .0692183{col 37}{space 1}    1.73{col 46}{space 3}0.083{col 55}{space 3}-.0156177{col 67}{space 3} .2557131
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0428759{col 26}{space 2} .0155073{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 55}{space 3}-.0732695{col 67}{space 3}-.0124822
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3757018{col 26}{space 2} .0264063{col 37}{space 1}  -14.23{col 46}{space 3}0.000{col 55}{space 3}-.4274572{col 67}{space 3}-.3239463
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-89.43892{col 26}{space 2} .9548453{col 37}{space 1}  -93.67{col 46}{space 3}0.000{col 55}{space 3}-91.31039{col 67}{space 3}-87.56746
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 3.049536{col 26}{space 2} .0124824{col 37}{space 1}  244.31{col 46}{space 3}0.000{col 55}{space 3} 3.025071{col 67}{space 3} 3.074001
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-39569.83}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}  .189797{col 26}{space 2} .0125199{col 37}{space 1}   15.16{col 46}{space 3}0.000{col 55}{space 3} .1652584{col 67}{space 3} .2143356
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2127207{col 26}{space 2} .0265327{col 37}{space 1}   -8.02{col 46}{space 3}0.000{col 55}{space 3}-.2647238{col 67}{space 3}-.1607176
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0933064{col 26}{space 2} .0046628{col 37}{space 1}  -20.01{col 46}{space 3}0.000{col 55}{space 3}-.1024454{col 67}{space 3}-.0841675
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0862833{col 26}{space 2} .0693017{col 37}{space 1}    1.25{col 46}{space 3}0.213{col 55}{space 3}-.0495455{col 67}{space 3} .2221121
{col 1}{text}households~e{col 14}{c |}{result}{space 2} -.054913{col 26}{space 2} .0160473{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 55}{space 3}-.0863652{col 67}{space 3}-.0234608
{col 1}{text}      SESres{col 14}{c |}{result}{space 2} -.375882{col 26}{space 2} .0264246{col 37}{space 1}  -14.22{col 46}{space 3}0.000{col 55}{space 3}-.4276733{col 67}{space 3}-.3240908
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0831728{col 26}{space 2} .0049061{col 37}{space 1}   16.95{col 46}{space 3}0.000{col 55}{space 3}  .073557{col 67}{space 3} .0927886
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .9512064{col 26}{space 2} .2993581{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 55}{space 3} .3644752{col 67}{space 3} 1.537938
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. **Transition 3**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-254494.89}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-215974.18}  (not concave)
Iteration 3:{space 2}Log likelihood = {res: -210092.5}  
Iteration 4:{space 2}Log likelihood = {res:-208365.69}  
Iteration 5:{space 2}Log likelihood = {res: -192570.3}  (not concave)
Iteration 6:{space 2}Log likelihood = {res:-190864.24}  
Iteration 7:{space 2}Log likelihood = {res:-187414.58}  
Iteration 8:{space 2}Log likelihood = {res:-183744.21}  
Iteration 9:{space 2}Log likelihood = {res:-178788.87}  
Iteration 10:{space 1}Log likelihood = {res:-177088.41}  
Iteration 11:{space 1}Log likelihood = {res:-171930.78}  
Iteration 12:{space 1}Log likelihood = {res: -169201.8}  
Iteration 13:{space 1}Log likelihood = {res:-168184.27}  (not concave)
Iteration 14:{space 1}Log likelihood = {res:-168103.51}  
Iteration 15:{space 1}Log likelihood = {res:-168026.44}  
Iteration 16:{space 1}Log likelihood = {res:-167396.69}  (not concave)
Iteration 17:{space 1}Log likelihood = {res:-167383.06}  
Iteration 18:{space 1}Log likelihood = {res:-167227.98}  
Iteration 19:{space 1}Log likelihood = {res: -167079.7}  
Iteration 20:{space 1}Log likelihood = {res:-166908.81}  
Iteration 21:{space 1}Log likelihood = {res:-166885.07}  
Iteration 22:{space 1}Log likelihood = {res:-166884.34}  
Iteration 23:{space 1}Log likelihood = {res:-166884.33}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-166884.33}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .2206318{col 26}{space 2} .0055411{col 37}{space 1}   39.82{col 46}{space 3}0.000{col 55}{space 3} .2097715{col 67}{space 3} .2314922
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5812138{col 26}{space 2} .0122162{col 37}{space 1}  -47.58{col 46}{space 3}0.000{col 55}{space 3}-.6051572{col 67}{space 3}-.5572705
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.1116721{col 26}{space 2}  .001674{col 37}{space 1}  -66.71{col 46}{space 3}0.000{col 55}{space 3}-.1149531{col 67}{space 3}-.1083911
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} -.148715{col 26}{space 2} .0331737{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 55}{space 3}-.2137343{col 67}{space 3}-.0836958
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0712787{col 26}{space 2} .0070298{col 37}{space 1}  -10.14{col 46}{space 3}0.000{col 55}{space 3}-.0850569{col 67}{space 3}-.0575004
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3578474{col 26}{space 2} .0114502{col 37}{space 1}  -31.25{col 46}{space 3}0.000{col 55}{space 3}-.3802894{col 67}{space 3}-.3354055
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-57.21966{col 26}{space 2}  .304751{col 37}{space 1} -187.76{col 46}{space 3}0.000{col 55}{space 3}-57.81696{col 67}{space 3}-56.62236
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.675973{col 26}{space 2} .0057448{col 37}{space 1}  465.81{col 46}{space 3}0.000{col 55}{space 3} 2.664714{col 67}{space 3} 2.687233
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-165469.45}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .2134938{col 26}{space 2} .0055596{col 37}{space 1}   38.40{col 46}{space 3}0.000{col 55}{space 3} .2025972{col 67}{space 3} .2243904
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5774186{col 26}{space 2} .0122154{col 37}{space 1}  -47.27{col 46}{space 3}0.000{col 55}{space 3}-.6013603{col 67}{space 3}-.5534769
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0778409{col 26}{space 2} .0016686{col 37}{space 1}  -46.65{col 46}{space 3}0.000{col 55}{space 3}-.0811114{col 67}{space 3}-.0745704
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1916572{col 26}{space 2} .0331958{col 37}{space 1}   -5.77{col 46}{space 3}0.000{col 55}{space 3}-.2567198{col 67}{space 3}-.1265945
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0883546{col 26}{space 2} .0071241{col 37}{space 1}  -12.40{col 46}{space 3}0.000{col 55}{space 3}-.1023176{col 67}{space 3}-.0743916
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3536354{col 26}{space 2} .0114683{col 37}{space 1}  -30.84{col 46}{space 3}0.000{col 55}{space 3}-.3761128{col 67}{space 3}-.3311579
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2}  .079046{col 26}{space 2} .0015478{col 37}{space 1}   51.07{col 46}{space 3}0.000{col 55}{space 3} .0760124{col 67}{space 3} .0820796
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.603742{col 26}{space 2} .1102941{col 37}{space 1}   23.61{col 46}{space 3}0.000{col 55}{space 3}  2.38757{col 67}{space 3} 2.819915
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 4**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res:-1346.2431}  
Iteration 2:{space 2}Log likelihood = {res:-1291.8165}  
Iteration 3:{space 2}Log likelihood = {res:-1291.2828}  
Iteration 4:{space 2}Log likelihood = {res:-1289.5198}  (not concave)
Iteration 5:{space 2}Log likelihood = {res:-1289.5159}  (not concave)
Iteration 6:{space 2}Log likelihood = {res:-1289.5121}  (not concave)
Iteration 7:{space 2}Log likelihood = {res:-1289.5094}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-1289.5068}  (not concave)
Iteration 9:{space 2}Log likelihood = {res:-1289.5056}  (not concave)
Iteration 10:{space 1}Log likelihood = {res:-1289.5047}  
Iteration 11:{space 1}Log likelihood = {res:-1289.3478}  
Iteration 12:{space 1}Log likelihood = {res: -1289.141}  
Iteration 13:{space 1}Log likelihood = {res:-1288.7331}  
Iteration 14:{space 1}Log likelihood = {res:-1288.5612}  
Iteration 15:{space 1}Log likelihood = {res:-1287.8467}  
Iteration 16:{space 1}Log likelihood = {res:-1287.0707}  
Iteration 17:{space 1}Log likelihood = {res:-1286.6099}  
Iteration 18:{space 1}Log likelihood = {res:-1286.0499}  
Iteration 19:{space 1}Log likelihood = {res:-1285.9887}  
Iteration 20:{space 1}Log likelihood = {res: -1285.621}  (not concave)
Iteration 21:{space 1}Log likelihood = {res:-1285.6146}  
Iteration 22:{space 1}Log likelihood = {res:-1285.4762}  
Iteration 23:{space 1}Log likelihood = {res:-1285.2796}  
Iteration 24:{space 1}Log likelihood = {res:-1285.0274}  
Iteration 25:{space 1}Log likelihood = {res:-1284.6916}  
Iteration 26:{space 1}Log likelihood = {res:-1284.4768}  
Iteration 27:{space 1}Log likelihood = {res:-1284.3422}  
Iteration 28:{space 1}Log likelihood = {res:-1284.1797}  
Iteration 29:{space 1}Log likelihood = {res:-1284.1009}  
Iteration 30:{space 1}Log likelihood = {res:-1283.9839}  
Iteration 31:{space 1}Log likelihood = {res:-1283.8678}  (not concave)
Iteration 32:{space 1}Log likelihood = {res:-1283.8509}  
Iteration 33:{space 1}Log likelihood = {res:-1283.8434}  
Iteration 34:{space 1}Log likelihood = {res:-1283.8198}  
Iteration 35:{space 1}Log likelihood = {res:-1283.8138}  
Iteration 36:{space 1}Log likelihood = {res:-1283.8083}  
Iteration 37:{space 1}Log likelihood = {res:-1283.8082}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.8082}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0577124{col 26}{space 2} .0570768{col 37}{space 1}   -1.01{col 46}{space 3}0.312{col 55}{space 3}-.1695808{col 67}{space 3}  .054156
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}  -.28368{col 26}{space 2} .1186501{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 55}{space 3}  -.51623{col 67}{space 3}  -.05113
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} .0108598{col 26}{space 2} .0264072{col 37}{space 1}    0.41{col 46}{space 3}0.681{col 55}{space 3}-.0408974{col 67}{space 3} .0626169
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .5655437{col 26}{space 2} .2802234{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 55}{space 3} .0163159{col 67}{space 3} 1.114771
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2040182{col 26}{space 2} .0821015{col 37}{space 1}   -2.48{col 46}{space 3}0.013{col 55}{space 3}-.3649343{col 67}{space 3}-.0431022
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1803591{col 26}{space 2} .1124275{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 55}{space 3}-.4007131{col 67}{space 3} .0399948
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-29.34051{col 26}{space 2} 6.060793{col 37}{space 1}   -4.84{col 46}{space 3}0.000{col 55}{space 3}-41.21945{col 67}{space 3}-17.46157
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.895988{col 26}{space 2} .2486553{col 37}{space 1}    7.62{col 46}{space 3}0.000{col 55}{space 3} 1.408633{col 67}{space 3} 2.383344
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.3418}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0563371{col 26}{space 2} .0572045{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 55}{space 3}-.1684559{col 67}{space 3} .0557817
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2840425{col 26}{space 2} .1186709{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 55}{space 3}-.5166333{col 67}{space 3}-.0514518
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0100122{col 26}{space 2} .0527023{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 55}{space 3}-.1133067{col 67}{space 3} .0932823
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .5619825{col 26}{space 2} .2801726{col 37}{space 1}    2.01{col 46}{space 3}0.045{col 55}{space 3} .0128543{col 67}{space 3} 1.111111
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2019315{col 26}{space 2} .0823442{col 37}{space 1}   -2.45{col 46}{space 3}0.014{col 55}{space 3}-.3633232{col 67}{space 3}-.0405398
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1800558{col 26}{space 2} .1124459{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 55}{space 3}-.4004456{col 67}{space 3}  .040334
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0073833{col 26}{space 2} .0285255{col 37}{space 1}    0.26{col 46}{space 3}0.796{col 55}{space 3}-.0485256{col 67}{space 3} .0632922
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .9869197{col 26}{space 2}  2.78705{col 37}{space 1}    0.35{col 46}{space 3}0.723{col 55}{space 3}-4.475598{col 67}{space 3} 6.449438
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. **Transition 5**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res:-1997.1874}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-1993.8684}  
Iteration 3:{space 2}Log likelihood = {res:-1973.0828}  
Iteration 4:{space 2}Log likelihood = {res: -1972.206}  
Iteration 5:{space 2}Log likelihood = {res:-1972.1286}  
Iteration 6:{space 2}Log likelihood = {res:-1971.2578}  (not concave)
Iteration 7:{space 2}Log likelihood = {res:-1971.2446}  
Iteration 8:{space 2}Log likelihood = {res:-1970.9783}  
Iteration 9:{space 2}Log likelihood = {res:-1970.5854}  
Iteration 10:{space 1}Log likelihood = {res:-1969.8401}  
Iteration 11:{space 1}Log likelihood = {res:-1969.4552}  
Iteration 12:{space 1}Log likelihood = {res: -1968.577}  
Iteration 13:{space 1}Log likelihood = {res: -1967.511}  
Iteration 14:{space 1}Log likelihood = {res:-1967.2165}  
Iteration 15:{space 1}Log likelihood = {res: -1966.742}  
Iteration 16:{space 1}Log likelihood = {res: -1965.919}  
Iteration 17:{space 1}Log likelihood = {res:-1965.0154}  
Iteration 18:{space 1}Log likelihood = {res:-1964.7378}  
Iteration 19:{space 1}Log likelihood = {res:-1963.9291}  
Iteration 20:{space 1}Log likelihood = {res: -1963.774}  
Iteration 21:{space 1}Log likelihood = {res:-1962.8571}  
Iteration 22:{space 1}Log likelihood = {res:-1962.7174}  
Iteration 23:{space 1}Log likelihood = {res:-1962.4289}  
Iteration 24:{space 1}Log likelihood = {res:-1962.2441}  
Iteration 25:{space 1}Log likelihood = {res:-1962.0911}  
Iteration 26:{space 1}Log likelihood = {res:-1961.9721}  
Iteration 27:{space 1}Log likelihood = {res:-1961.8679}  
Iteration 28:{space 1}Log likelihood = {res:-1961.7613}  
Iteration 29:{space 1}Log likelihood = {res: -1961.754}  
Iteration 30:{space 1}Log likelihood = {res: -1961.726}  
Iteration 31:{space 1}Log likelihood = {res:-1961.7204}  
Iteration 32:{space 1}Log likelihood = {res: -1961.718}  
Iteration 33:{space 1}Log likelihood = {res:-1961.7174}  
Iteration 34:{space 1}Log likelihood = {res:-1961.7174}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1961.7174}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0292803{col 26}{space 2} .0416709{col 37}{space 1}    0.70{col 46}{space 3}0.482{col 55}{space 3}-.0523931{col 67}{space 3} .1109538
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3617219{col 26}{space 2} .0912473{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 55}{space 3}-.5405634{col 67}{space 3}-.1828805
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0056718{col 26}{space 2} .0197074{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 55}{space 3}-.0442976{col 67}{space 3} .0329539
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1328944{col 26}{space 2} .2658644{col 37}{space 1}   -0.50{col 46}{space 3}0.617{col 55}{space 3} -.653979{col 67}{space 3} .3881903
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0208096{col 26}{space 2} .0382803{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 55}{space 3}-.0958376{col 67}{space 3} .0542185
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0426207{col 26}{space 2} .0814254{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 55}{space 3}-.2022115{col 67}{space 3} .1169701
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-28.43968{col 26}{space 2} 4.564981{col 37}{space 1}   -6.23{col 46}{space 3}0.000{col 55}{space 3}-37.38688{col 67}{space 3}-19.49248
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.913479{col 26}{space 2} .1846626{col 37}{space 1}   10.36{col 46}{space 3}0.000{col 55}{space 3} 1.551547{col 67}{space 3} 2.275411
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1958.3477}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0248747{col 26}{space 2} .0417049{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 55}{space 3}-.0568653{col 67}{space 3} .1066148
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3608535{col 26}{space 2} .0912476{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 55}{space 3}-.5396955{col 67}{space 3}-.1820115
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0225092{col 26}{space 2} .0281832{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 55}{space 3}-.0777472{col 67}{space 3} .0327288
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1391442{col 26}{space 2} .2661179{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 55}{space 3}-.6607257{col 67}{space 3} .3824373
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0232832{col 26}{space 2} .0390685{col 37}{space 1}   -0.60{col 46}{space 3}0.551{col 55}{space 3}-.0998559{col 67}{space 3} .0532896
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0463451{col 26}{space 2}  .081399{col 37}{space 1}   -0.57{col 46}{space 3}0.569{col 55}{space 3}-.2058841{col 67}{space 3}  .113194
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0120337{col 26}{space 2} .0200817{col 37}{space 1}    0.60{col 46}{space 3}0.549{col 55}{space 3}-.0273256{col 67}{space 3} .0513931
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 1.937505{col 26}{space 2} 1.565545{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 55}{space 3}-1.130907{col 67}{space 3} 5.005917
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 6**
. **Weibull**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-13845.309}  
Iteration 1:{space 2}Log likelihood = {res:-6785.8678}  
Iteration 2:{space 2}Log likelihood = {res:-6706.3638}  
Iteration 3:{space 2}Log likelihood = {res:-6706.3088}  
Iteration 4:{space 2}Log likelihood = {res:-6704.5051}  (not concave)
Iteration 5:{space 2}Log likelihood = {res:-6704.4996}  
Iteration 6:{space 2}Log likelihood = {res:-6704.2319}  
Iteration 7:{space 2}Log likelihood = {res:-6701.9758}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-6701.8393}  (not concave)
Iteration 9:{space 2}Log likelihood = {res:-6701.8322}  (not concave)
Iteration 10:{space 1}Log likelihood = {res:-6701.8261}  (not concave)
Iteration 11:{space 1}Log likelihood = {res:-6701.8229}  (not concave)
Iteration 12:{space 1}Log likelihood = {res:-6701.8204}  
Iteration 13:{space 1}Log likelihood = {res:-6701.3428}  
Iteration 14:{space 1}Log likelihood = {res:-6700.7428}  
Iteration 15:{space 1}Log likelihood = {res:-6699.6459}  
Iteration 16:{space 1}Log likelihood = {res:-6699.0925}  
Iteration 17:{space 1}Log likelihood = {res:-6697.9757}  
Iteration 18:{space 1}Log likelihood = {res:-6696.2028}  
Iteration 19:{space 1}Log likelihood = {res:-6695.3939}  
Iteration 20:{space 1}Log likelihood = {res:-6694.9902}  
Iteration 21:{space 1}Log likelihood = {res:-6694.3303}  
Iteration 22:{space 1}Log likelihood = {res:-6693.9679}  
Iteration 23:{space 1}Log likelihood = {res:-6693.4878}  
Iteration 24:{space 1}Log likelihood = {res: -6693.086}  
Iteration 25:{space 1}Log likelihood = {res:-6692.7697}  
Iteration 26:{space 1}Log likelihood = {res:-6692.5055}  
Iteration 27:{space 1}Log likelihood = {res:-6692.3853}  
Iteration 28:{space 1}Log likelihood = {res:-6692.2399}  
Iteration 29:{space 1}Log likelihood = {res:-6692.1837}  
Iteration 30:{space 1}Log likelihood = {res:-6692.1223}  
Iteration 31:{space 1}Log likelihood = {res:-6692.1042}  
Iteration 32:{space 1}Log likelihood = {res:-6692.0995}  
Iteration 33:{space 1}Log likelihood = {res: -6692.099}  
Iteration 34:{space 1}Log likelihood = {res:-6692.0989}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-6692.0989}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0120126{col 26}{space 2} .0187731{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 55}{space 3} -.024782{col 67}{space 3} .0488071
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3545592{col 26}{space 2} .0407501{col 37}{space 1}   -8.70{col 46}{space 3}0.000{col 55}{space 3} -.434428{col 67}{space 3}-.2746904
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} .0021943{col 26}{space 2} .0097735{col 37}{space 1}    0.22{col 46}{space 3}0.822{col 55}{space 3}-.0169614{col 67}{space 3} .0213499
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2058966{col 26}{space 2} .1108966{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 55}{space 3}-.4232499{col 67}{space 3} .0114567
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0025245{col 26}{space 2}  .020574{col 37}{space 1}    0.12{col 46}{space 3}0.902{col 55}{space 3}-.0377998{col 67}{space 3} .0428489
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0852251{col 26}{space 2} .0415491{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 55}{space 3}-.1666598{col 67}{space 3}-.0037904
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} -16.3837{col 26}{space 2} 2.259221{col 37}{space 1}   -7.25{col 46}{space 3}0.000{col 55}{space 3}-20.81169{col 67}{space 3}-11.95571
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.424086{col 26}{space 2} .1466074{col 37}{space 1}    9.71{col 46}{space 3}0.000{col 55}{space 3}  1.13674{col 67}{space 3} 1.711431
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 7: _cmp_1_7_1 to _cmp_1_7_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}{err}convergence not achieved
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-6691.4493}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0115961{col 26}{space 2} .0187898{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 55}{space 3}-.0252312{col 67}{space 3} .0484234
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3545608{col 26}{space 2} .0407562{col 37}{space 1}   -8.70{col 46}{space 3}0.000{col 55}{space 3}-.4344415{col 67}{space 3}-.2746802
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0006456{col 26}{space 2} .0214694{col 37}{space 1}   -0.03{col 46}{space 3}0.976{col 55}{space 3}-.0427247{col 67}{space 3} .0414336
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2063351{col 26}{space 2} .1109552{col 37}{space 1}   -1.86{col 46}{space 3}0.063{col 55}{space 3}-.4238033{col 67}{space 3}  .011133
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0024061{col 26}{space 2} .0206016{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 55}{space 3}-.0379724{col 67}{space 3} .0427845
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0839641{col 26}{space 2} .0415717{col 37}{space 1}   -2.02{col 46}{space 3}0.043{col 55}{space 3}-.1654431{col 67}{space 3} -.002485
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} 9.49e-06{col 26}{space 2} .0000746{col 37}{space 1}    0.13{col 46}{space 3}0.899{col 55}{space 3}-.0001367{col 67}{space 3} .0001557
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 5.837256{col 26}{space 2} 2.423423{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 55}{space 3} 1.087433{col 67}{space 3} 10.58708
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. 
. ********************MODEL 2: FULL MODEL***************************
. 
. 
. **Transition 1**
. 
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-25342.073}  
Iteration 2:{space 2}Log likelihood = {res:-24243.986}  
Iteration 3:{space 2}Log likelihood = {res:-22629.406}  
Iteration 4:{space 2}Log likelihood = {res:-22299.987}  
Iteration 5:{space 2}Log likelihood = {res:-21879.091}  
Iteration 6:{space 2}Log likelihood = {res:-21435.862}  
Iteration 7:{space 2}Log likelihood = {res:-20843.763}  
Iteration 8:{space 2}Log likelihood = {res:-20710.771}  
Iteration 9:{space 2}Log likelihood = {res: -20517.28}  
Iteration 10:{space 1}Log likelihood = {res:-20292.156}  
Iteration 11:{space 1}Log likelihood = {res:-20189.259}  
Iteration 12:{space 1}Log likelihood = {res:-20009.302}  
Iteration 13:{space 1}Log likelihood = {res:-19904.758}  
Iteration 14:{space 1}Log likelihood = {res: -19799.65}  (not concave)
Iteration 15:{space 1}Log likelihood = {res:-19781.676}  
Iteration 16:{space 1}Log likelihood = {res:-19768.651}  
Iteration 17:{space 1}Log likelihood = {res:-19738.915}  
Iteration 18:{space 1}Log likelihood = {res:-19734.611}  
Iteration 19:{space 1}Log likelihood = {res:-19728.627}  
Iteration 20:{space 1}Log likelihood = {res:-19728.273}  
Iteration 21:{space 1}Log likelihood = {res: -19728.24}  
Iteration 22:{space 1}Log likelihood = {res: -19728.24}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-19728.24}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0587608{col 26}{space 2} .0205903{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 55}{space 3} .0184047{col 67}{space 3}  .099117
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2}-.0260335{col 26}{space 2} .0213798{col 37}{space 1}   -1.22{col 46}{space 3}0.223{col 55}{space 3}-.0679372{col 67}{space 3} .0158702
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.6625287{col 26}{space 2} .0422154{col 37}{space 1}  -15.69{col 46}{space 3}0.000{col 55}{space 3}-.7452695{col 67}{space 3} -.579788
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0997577{col 26}{space 2} .0064014{col 37}{space 1}  -15.58{col 46}{space 3}0.000{col 55}{space 3}-.1123043{col 67}{space 3}-.0872112
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0518645{col 26}{space 2} .1095625{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 55}{space 3}-.1628741{col 67}{space 3}  .266603
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0163365{col 26}{space 2} .0159569{col 37}{space 1}    1.02{col 46}{space 3}0.306{col 55}{space 3}-.0149385{col 67}{space 3} .0476115
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0883326{col 26}{space 2} .0391844{col 37}{space 1}   -2.25{col 46}{space 3}0.024{col 55}{space 3}-.1651327{col 67}{space 3}-.0115325
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-73.93003{col 26}{space 2} 1.240378{col 37}{space 1}  -59.60{col 46}{space 3}0.000{col 55}{space 3}-76.36112{col 67}{space 3}-71.49893
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.870171{col 26}{space 2} .0194129{col 37}{space 1}  147.85{col 46}{space 3}0.000{col 55}{space 3} 2.832122{col 67}{space 3} 2.908219
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans1==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-19628.654}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}  .053998{col 26}{space 2} .0206363{col 37}{space 1}    2.62{col 46}{space 3}0.009{col 55}{space 3} .0135516{col 67}{space 3} .0944444
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} -.024707{col 26}{space 2} .0213883{col 37}{space 1}   -1.16{col 46}{space 3}0.248{col 55}{space 3}-.0666274{col 67}{space 3} .0172133
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.6594997{col 26}{space 2} .0422257{col 37}{space 1}  -15.62{col 46}{space 3}0.000{col 55}{space 3}-.7422607{col 67}{space 3}-.5767388
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0819674{col 26}{space 2} .0062391{col 37}{space 1}  -13.14{col 46}{space 3}0.000{col 55}{space 3}-.0941958{col 67}{space 3}-.0697391
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0183315{col 26}{space 2} .1097108{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 55}{space 3}-.1966978{col 67}{space 3} .2333608
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0105089{col 26}{space 2} .0168849{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 55}{space 3}-.0225848{col 67}{space 3} .0436026
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0880999{col 26}{space 2} .0392189{col 37}{space 1}   -2.25{col 46}{space 3}0.025{col 55}{space 3}-.1649675{col 67}{space 3}-.0112322
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0826696{col 26}{space 2} .0065054{col 37}{space 1}   12.71{col 46}{space 3}0.000{col 55}{space 3} .0699192{col 67}{space 3}   .09542
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .1680995{col 26}{space 2} .4026193{col 37}{space 1}    0.42{col 46}{space 3}0.676{col 55}{space 3}-.6210199{col 67}{space 3} .9572188
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 2**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-54908.566}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-53389.873}  
Iteration 3:{space 2}Log likelihood = {res: -51631.11}  
Iteration 4:{space 2}Log likelihood = {res:-48907.767}  
Iteration 5:{space 2}Log likelihood = {res:-46033.732}  
Iteration 6:{space 2}Log likelihood = {res:-45529.226}  
Iteration 7:{space 2}Log likelihood = {res:-43393.439}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-43132.659}  (not concave)
Iteration 9:{space 2}Log likelihood = {res:-43114.533}  
Iteration 10:{space 1}Log likelihood = {res:-42768.756}  
Iteration 11:{space 1}Log likelihood = {res:-42041.988}  
Iteration 12:{space 1}Log likelihood = {res:-41683.622}  
Iteration 13:{space 1}Log likelihood = {res:-41166.451}  
Iteration 14:{space 1}Log likelihood = {res:-40947.433}  
Iteration 15:{space 1}Log likelihood = {res:-40501.792}  
Iteration 16:{space 1}Log likelihood = {res:-40257.116}  
Iteration 17:{space 1}Log likelihood = {res:-40104.667}  
Iteration 18:{space 1}Log likelihood = {res:-39988.387}  
Iteration 19:{space 1}Log likelihood = {res:-39872.771}  
Iteration 20:{space 1}Log likelihood = {res:-39793.448}  
Iteration 21:{space 1}Log likelihood = {res:-39734.432}  
Iteration 22:{space 1}Log likelihood = {res:-39714.971}  
Iteration 23:{space 1}Log likelihood = {res:-39684.557}  
Iteration 24:{space 1}Log likelihood = {res:-39681.479}  
Iteration 25:{space 1}Log likelihood = {res: -39678.49}  
Iteration 26:{space 1}Log likelihood = {res:-39678.212}  
Iteration 27:{space 1}Log likelihood = {res: -39677.95}  
Iteration 28:{space 1}Log likelihood = {res:-39677.949}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-39677.949}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1761554{col 26}{space 2} .0126366{col 37}{space 1}   13.94{col 46}{space 3}0.000{col 55}{space 3}  .151388{col 67}{space 3} .2009227
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1312939{col 26}{space 2} .0137291{col 37}{space 1}    9.56{col 46}{space 3}0.000{col 55}{space 3} .1043853{col 67}{space 3} .1582025
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2051592{col 26}{space 2} .0265373{col 37}{space 1}   -7.73{col 46}{space 3}0.000{col 55}{space 3}-.2571713{col 67}{space 3}-.1531471
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0876668{col 26}{space 2} .0047744{col 37}{space 1}  -18.36{col 46}{space 3}0.000{col 55}{space 3}-.0970246{col 67}{space 3}-.0783091
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .1119689{col 26}{space 2} .0692145{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 55}{space 3} -.023689{col 67}{space 3} .2476267
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0442945{col 26}{space 2} .0155732{col 37}{space 1}   -2.84{col 46}{space 3}0.004{col 55}{space 3}-.0748174{col 67}{space 3}-.0137716
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3425021{col 26}{space 2} .0266715{col 37}{space 1}  -12.84{col 46}{space 3}0.000{col 55}{space 3}-.3947774{col 67}{space 3}-.2902269
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-89.60822{col 26}{space 2} .9550395{col 37}{space 1}  -93.83{col 46}{space 3}0.000{col 55}{space 3}-91.48006{col 67}{space 3}-87.73638
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 3.050814{col 26}{space 2} .0124648{col 37}{space 1}  244.75{col 46}{space 3}0.000{col 55}{space 3} 3.026383{col 67}{space 3} 3.075244
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans2==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-39522.956}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}  .171617{col 26}{space 2} .0126703{col 37}{space 1}   13.54{col 46}{space 3}0.000{col 55}{space 3} .1467837{col 67}{space 3} .1964502
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1332456{col 26}{space 2} .0137301{col 37}{space 1}    9.70{col 46}{space 3}0.000{col 55}{space 3} .1063351{col 67}{space 3} .1601561
{col 1}{text}         SEX{col 14}{c |}{result}{space 2} -.204105{col 26}{space 2} .0265415{col 37}{space 1}   -7.69{col 46}{space 3}0.000{col 55}{space 3}-.2561255{col 67}{space 3}-.1520845
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0928888{col 26}{space 2} .0046629{col 37}{space 1}  -19.92{col 46}{space 3}0.000{col 55}{space 3} -.102028{col 67}{space 3}-.0837497
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .0778711{col 26}{space 2} .0692968{col 37}{space 1}    1.12{col 46}{space 3}0.261{col 55}{space 3}-.0579482{col 67}{space 3} .2136903
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0563334{col 26}{space 2} .0160913{col 37}{space 1}   -3.50{col 46}{space 3}0.000{col 55}{space 3}-.0878718{col 67}{space 3}-.0247951
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.3420676{col 26}{space 2} .0266921{col 37}{space 1}  -12.82{col 46}{space 3}0.000{col 55}{space 3}-.3943831{col 67}{space 3}-.2897521
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0837151{col 26}{space 2} .0049115{col 37}{space 1}   17.04{col 46}{space 3}0.000{col 55}{space 3} .0740888{col 67}{space 3} .0933415
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} .9055011{col 26}{space 2} .2992632{col 37}{space 1}    3.03{col 46}{space 3}0.002{col 55}{space 3}  .318956{col 67}{space 3} 1.492046
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. **Transition 3**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(weibull)
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -26431168}  
Iteration 1:{space 2}Log likelihood = {res:-254478.07}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-215932.96}  (not concave)
Iteration 3:{space 2}Log likelihood = {res:-209603.64}  (not concave)
Iteration 4:{space 2}Log likelihood = {res:   -207811}  
Iteration 5:{space 2}Log likelihood = {res:-202753.62}  
Iteration 6:{space 2}Log likelihood = {res:-189068.97}  
Iteration 7:{space 2}Log likelihood = {res:-185533.73}  
Iteration 8:{space 2}Log likelihood = {res:-177881.68}  
Iteration 9:{space 2}Log likelihood = {res:-176300.54}  
Iteration 10:{space 1}Log likelihood = {res:-174443.04}  
Iteration 11:{space 1}Log likelihood = {res:-171631.44}  
Iteration 12:{space 1}Log likelihood = {res:-170562.65}  
Iteration 13:{space 1}Log likelihood = {res:-168230.68}  
Iteration 14:{space 1}Log likelihood = {res:-167765.49}  
Iteration 15:{space 1}Log likelihood = {res: -167170.4}  
Iteration 16:{space 1}Log likelihood = {res:-166303.54}  
Iteration 17:{space 1}Log likelihood = {res:-166280.72}  
Iteration 18:{space 1}Log likelihood = {res:-165960.46}  
Iteration 19:{space 1}Log likelihood = {res: -165899.6}  
Iteration 20:{space 1}Log likelihood = {res:-165856.57}  
Iteration 21:{space 1}Log likelihood = {res:-165829.24}  
Iteration 22:{space 1}Log likelihood = {res:-165827.05}  
Iteration 23:{space 1}Log likelihood = {res:-165825.11}  
Iteration 24:{space 1}Log likelihood = {res: -165825.1}  
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 9:-165825.1}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1790144{col 26}{space 2} .0056228{col 37}{space 1}   31.84{col 46}{space 3}0.000{col 55}{space 3}  .167994{col 67}{space 3} .1900349
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .2804076{col 26}{space 2} .0060638{col 37}{space 1}   46.24{col 46}{space 3}0.000{col 55}{space 3} .2685228{col 67}{space 3} .2922924
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5508068{col 26}{space 2} .0122282{col 37}{space 1}  -45.04{col 46}{space 3}0.000{col 55}{space 3}-.5747736{col 67}{space 3}  -.52684
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.1099261{col 26}{space 2} .0016757{col 37}{space 1}  -65.60{col 46}{space 3}0.000{col 55}{space 3}-.1132104{col 67}{space 3}-.1066418
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1615861{col 26}{space 2} .0331593{col 37}{space 1}   -4.87{col 46}{space 3}0.000{col 55}{space 3}-.2265771{col 67}{space 3}-.0965951
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0719005{col 26}{space 2} .0070213{col 37}{space 1}  -10.24{col 46}{space 3}0.000{col 55}{space 3}-.0856619{col 67}{space 3}-.0581391
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.2845038{col 26}{space 2} .0115964{col 37}{space 1}  -24.53{col 46}{space 3}0.000{col 55}{space 3}-.3072323{col 67}{space 3}-.2617753
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-57.54903{col 26}{space 2} .3051676{col 37}{space 1} -188.58{col 46}{space 3}0.000{col 55}{space 3}-58.14715{col 67}{space 3}-56.95091
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 2.678228{col 26}{space 2} .0057365{col 37}{space 1}  466.88{col 46}{space 3}0.000{col 55}{space 3} 2.666985{col 67}{space 3} 2.689472
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans3==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 56}{lalign 13:Number of obs}{col 69} = {res}{ralign 7:363,663}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-164383.31}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .1715459{col 26}{space 2} .0056407{col 37}{space 1}   30.41{col 46}{space 3}0.000{col 55}{space 3} .1604903{col 67}{space 3} .1826014
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .2839679{col 26}{space 2} .0060639{col 37}{space 1}   46.83{col 46}{space 3}0.000{col 55}{space 3} .2720829{col 67}{space 3}  .295853
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.5471939{col 26}{space 2} .0122257{col 37}{space 1}  -44.76{col 46}{space 3}0.000{col 55}{space 3}-.5711557{col 67}{space 3} -.523232
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0760321{col 26}{space 2} .0016685{col 37}{space 1}  -45.57{col 46}{space 3}0.000{col 55}{space 3}-.0793023{col 67}{space 3}-.0727619
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2055977{col 26}{space 2} .0331814{col 37}{space 1}   -6.20{col 46}{space 3}0.000{col 55}{space 3}-.2706322{col 67}{space 3}-.1405633
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0886451{col 26}{space 2}  .007109{col 37}{space 1}  -12.47{col 46}{space 3}0.000{col 55}{space 3}-.1025785{col 67}{space 3}-.0747116
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.2787213{col 26}{space 2} .0116173{col 37}{space 1}  -23.99{col 46}{space 3}0.000{col 55}{space 3}-.3014907{col 67}{space 3}-.2559519
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0802394{col 26}{space 2} .0015517{col 37}{space 1}   51.71{col 46}{space 3}0.000{col 55}{space 3} .0771982{col 67}{space 3} .0832806
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 2.404992{col 26}{space 2} .1102205{col 37}{space 1}   21.82{col 46}{space 3}0.000{col 55}{space 3} 2.188964{col 67}{space 3}  2.62102
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 4**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res:-1346.2076}  
Iteration 2:{space 2}Log likelihood = {res:-1291.6069}  
Iteration 3:{space 2}Log likelihood = {res:-1290.9048}  
Iteration 4:{space 2}Log likelihood = {res:-1289.2734}  
Iteration 5:{space 2}Log likelihood = {res:-1289.1275}  
Iteration 6:{space 2}Log likelihood = {res:-1289.0997}  
Iteration 7:{space 2}Log likelihood = {res:-1288.6202}  (not concave)
Iteration 8:{space 2}Log likelihood = {res:-1288.6032}  
Iteration 9:{space 2}Log likelihood = {res: -1288.442}  
Iteration 10:{space 1}Log likelihood = {res:-1288.1576}  
Iteration 11:{space 1}Log likelihood = {res:-1287.7536}  
Iteration 12:{space 1}Log likelihood = {res:-1287.4938}  
Iteration 13:{space 1}Log likelihood = {res:-1287.1725}  
Iteration 14:{space 1}Log likelihood = {res:-1286.5724}  
Iteration 15:{space 1}Log likelihood = {res:-1286.4249}  
Iteration 16:{space 1}Log likelihood = {res:-1285.8768}  
Iteration 17:{space 1}Log likelihood = {res:-1285.7822}  
Iteration 18:{space 1}Log likelihood = {res:-1285.4081}  (not concave)
Iteration 19:{space 1}Log likelihood = {res: -1285.401}  
Iteration 20:{space 1}Log likelihood = {res: -1285.267}  
Iteration 21:{space 1}Log likelihood = {res:-1284.9392}  
Iteration 22:{space 1}Log likelihood = {res:-1284.8473}  
Iteration 23:{space 1}Log likelihood = {res:-1284.5653}  (not concave)
Iteration 24:{space 1}Log likelihood = {res:-1284.5305}  (not concave)
Iteration 25:{space 1}Log likelihood = {res:-1284.5284}  
Iteration 26:{space 1}Log likelihood = {res:-1284.4292}  (backed up)
Iteration 27:{space 1}Log likelihood = {res:-1284.1197}  
Iteration 28:{space 1}Log likelihood = {res:-1284.0455}  
Iteration 29:{space 1}Log likelihood = {res:-1283.9346}  
Iteration 30:{space 1}Log likelihood = {res:-1283.7943}  
Iteration 31:{space 1}Log likelihood = {res:-1283.6458}  (not concave)
Iteration 32:{space 1}Log likelihood = {res:-1283.6188}  
Iteration 33:{space 1}Log likelihood = {res:-1283.5985}  
Iteration 34:{space 1}Log likelihood = {res:-1283.5775}  
Iteration 35:{space 1}Log likelihood = {res:-1283.5498}  
Iteration 36:{space 1}Log likelihood = {res:-1283.5425}  (not concave)
Iteration 37:{space 1}Log likelihood = {res: -1283.542}  
Iteration 38:{space 1}Log likelihood = {res:-1283.5418}  
Iteration 39:{space 1}Log likelihood = {res:-1283.5418}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.5418}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0650479{col 26}{space 2} .0579129{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 55}{space 3}-.1785552{col 67}{space 3} .0484594
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .0447748{col 26}{space 2} .0612837{col 37}{space 1}    0.73{col 46}{space 3}0.465{col 55}{space 3}-.0753391{col 67}{space 3} .1648887
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2810532{col 26}{space 2} .1187168{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 55}{space 3}-.5137339{col 67}{space 3}-.0483726
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} .0113004{col 26}{space 2} .0263971{col 37}{space 1}    0.43{col 46}{space 3}0.669{col 55}{space 3}-.0404369{col 67}{space 3} .0630378
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .5555686{col 26}{space 2} .2805808{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 55}{space 3} .0056403{col 67}{space 3} 1.105497
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2048705{col 26}{space 2} .0821642{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 55}{space 3}-.3659094{col 67}{space 3}-.0438317
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1682967{col 26}{space 2} .1136939{col 37}{space 1}   -1.48{col 46}{space 3}0.139{col 55}{space 3}-.3911327{col 67}{space 3} .0545393
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-29.35459{col 26}{space 2}  6.05952{col 37}{space 1}   -4.84{col 46}{space 3}0.000{col 55}{space 3}-41.23103{col 67}{space 3}-17.47815
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2}  1.89556{col 26}{space 2} .2486583{col 37}{space 1}    7.62{col 46}{space 3}0.000{col 55}{space 3} 1.408198{col 67}{space 3} 2.382921
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans4==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1283.0655}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2}-.0639176{col 26}{space 2} .0580641{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 55}{space 3}-.1777213{col 67}{space 3}  .049886
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .0456279{col 26}{space 2} .0613336{col 37}{space 1}    0.74{col 46}{space 3}0.457{col 55}{space 3}-.0745837{col 67}{space 3} .1658395
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.2814843{col 26}{space 2} .1187292{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 55}{space 3}-.5141892{col 67}{space 3}-.0487793
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0100771{col 26}{space 2}  .052418{col 37}{space 1}   -0.19{col 46}{space 3}0.848{col 55}{space 3}-.1128146{col 67}{space 3} .0926604
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2} .5516921{col 26}{space 2} .2805295{col 37}{space 1}    1.97{col 46}{space 3}0.049{col 55}{space 3} .0018644{col 67}{space 3}  1.10152
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.2029659{col 26}{space 2} .0824136{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 55}{space 3}-.3644935{col 67}{space 3}-.0414382
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.1677299{col 26}{space 2} .1137273{col 37}{space 1}   -1.47{col 46}{space 3}0.140{col 55}{space 3}-.3906312{col 67}{space 3} .0551715
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0078702{col 26}{space 2} .0294448{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 55}{space 3}-.0498406{col 67}{space 3} .0655809
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}  .970139{col 26}{space 2} 2.791243{col 37}{space 1}    0.35{col 46}{space 3}0.728{col 55}{space 3}-4.500596{col 67}{space 3} 6.440874
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. **Transition 5**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res: -7444.323}  
Iteration 1:{space 2}Log likelihood = {res:-1995.0016}  (not concave)
Iteration 2:{space 2}Log likelihood = {res:-1989.5651}  
Iteration 3:{space 2}Log likelihood = {res:-1967.1694}  
Iteration 4:{space 2}Log likelihood = {res:-1966.3526}  
Iteration 5:{space 2}Log likelihood = {res:-1966.1899}  
Iteration 6:{space 2}Log likelihood = {res:-1965.3249}  (not concave)
Iteration 7:{space 2}Log likelihood = {res:-1965.3064}  
Iteration 8:{space 2}Log likelihood = {res:-1965.0302}  
Iteration 9:{space 2}Log likelihood = {res:-1964.4762}  
Iteration 10:{space 1}Log likelihood = {res: -1963.984}  
Iteration 11:{space 1}Log likelihood = {res:-1963.1769}  
Iteration 12:{space 1}Log likelihood = {res:-1961.7442}  
Iteration 13:{space 1}Log likelihood = {res:-1961.0469}  
Iteration 14:{space 1}Log likelihood = {res:-1960.5481}  
Iteration 15:{space 1}Log likelihood = {res:-1959.8998}  
Iteration 16:{space 1}Log likelihood = {res:-1959.4231}  
Iteration 17:{space 1}Log likelihood = {res:-1958.9504}  
Iteration 18:{space 1}Log likelihood = {res:-1958.5829}  
Iteration 19:{space 1}Log likelihood = {res:-1957.8323}  
Iteration 20:{space 1}Log likelihood = {res:-1957.6747}  
Iteration 21:{space 1}Log likelihood = {res:-1957.2285}  (not concave)
Iteration 22:{space 1}Log likelihood = {res:-1957.1786}  (not concave)
Iteration 23:{space 1}Log likelihood = {res:-1957.1776}  
Iteration 24:{space 1}Log likelihood = {res: -1957.041}  
Iteration 25:{space 1}Log likelihood = {res:-1956.5181}  
Iteration 26:{space 1}Log likelihood = {res:-1956.2793}  (not concave)
Iteration 27:{space 1}Log likelihood = {res:-1956.2759}  
Iteration 28:{space 1}Log likelihood = {res: -1956.193}  
Iteration 29:{space 1}Log likelihood = {res:-1956.0707}  
Iteration 30:{space 1}Log likelihood = {res:-1955.9759}  
Iteration 31:{space 1}Log likelihood = {res:-1955.9098}  
Iteration 32:{space 1}Log likelihood = {res:-1955.8533}  
Iteration 33:{space 1}Log likelihood = {res:-1955.8252}  
Iteration 34:{space 1}Log likelihood = {res:-1955.8121}  
Iteration 35:{space 1}Log likelihood = {res:-1955.8119}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1955.8119}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0042925{col 26}{space 2} .0422504{col 37}{space 1}    0.10{col 46}{space 3}0.919{col 55}{space 3}-.0785168{col 67}{space 3} .0871018
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1580191{col 26}{space 2} .0458406{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 55}{space 3} .0681731{col 67}{space 3}  .247865
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3503589{col 26}{space 2} .0913484{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 55}{space 3}-.5293984{col 67}{space 3}-.1713194
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0040582{col 26}{space 2} .0197952{col 37}{space 1}   -0.21{col 46}{space 3}0.838{col 55}{space 3}-.0428561{col 67}{space 3} .0347397
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1722279{col 26}{space 2} .2664318{col 37}{space 1}   -0.65{col 46}{space 3}0.518{col 55}{space 3}-.6944247{col 67}{space 3} .3499688
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0178836{col 26}{space 2} .0395182{col 37}{space 1}   -0.45{col 46}{space 3}0.651{col 55}{space 3}-.0953378{col 67}{space 3} .0595706
{col 1}{text}      SESres{col 14}{c |}{result}{space 2} .0008872{col 26}{space 2} .0825153{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 55}{space 3}-.1608399{col 67}{space 3} .1626142
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-28.47893{col 26}{space 2} 4.601182{col 37}{space 1}   -6.19{col 46}{space 3}0.000{col 55}{space 3}-37.49708{col 67}{space 3}-19.46078
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.910792{col 26}{space 2}  .186552{col 37}{space 1}   10.24{col 46}{space 3}0.000{col 55}{space 3} 1.545156{col 67}{space 3} 2.276427
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans5==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:2,308}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1952.3524}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0001056{col 26}{space 2} .0422367{col 37}{space 1}    0.00{col 46}{space 3}0.998{col 55}{space 3}-.0826768{col 67}{space 3}  .082888
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .1594068{col 26}{space 2} .0458959{col 37}{space 1}    3.47{col 46}{space 3}0.001{col 55}{space 3} .0694524{col 67}{space 3} .2493612
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3497681{col 26}{space 2} .0913469{col 37}{space 1}   -3.83{col 46}{space 3}0.000{col 55}{space 3}-.5288048{col 67}{space 3}-.1707314
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0228557{col 26}{space 2} .0280838{col 37}{space 1}   -0.81{col 46}{space 3}0.416{col 55}{space 3} -.077899{col 67}{space 3} .0321875
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.1763487{col 26}{space 2} .2666541{col 37}{space 1}   -0.66{col 46}{space 3}0.508{col 55}{space 3} -.698981{col 67}{space 3} .3462837
{col 1}{text}households~e{col 14}{c |}{result}{space 2}-.0208089{col 26}{space 2} .0403414{col 37}{space 1}   -0.52{col 46}{space 3}0.606{col 55}{space 3}-.0998767{col 67}{space 3} .0582589
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0036997{col 26}{space 2}  .082439{col 37}{space 1}   -0.04{col 46}{space 3}0.964{col 55}{space 3}-.1652772{col 67}{space 3} .1578777
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} .0129388{col 26}{space 2} .0207055{col 37}{space 1}    0.62{col 46}{space 3}0.532{col 55}{space 3}-.0276433{col 67}{space 3}  .053521
{col 1}{text}       _cons{col 14}{c |}{result}{space 2} 1.942888{col 26}{space 2} 1.570336{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 55}{space 3}-1.134914{col 67}{space 3}  5.02069
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. **Transition 6**
. **Weibull**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(weibull)
{txt}note; a delayed entry model is being fitted
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 2}Log likelihood = {res:-13845.309}  
Iteration 1:{space 2}Log likelihood = {res:-6784.9997}  
Iteration 2:{space 2}Log likelihood = {res:  -6704.72}  
Iteration 3:{space 2}Log likelihood = {res:-6704.4824}  
Iteration 4:{space 2}Log likelihood = {res:-6702.8685}  (not concave)
Iteration 5:{space 2}Log likelihood = {res:-6702.8684}  
Iteration 6:{space 2}Log likelihood = {res:-6702.4409}  
Iteration 7:{space 2}Log likelihood = {res:-6701.9942}  
Iteration 8:{space 2}Log likelihood = {res:-6699.5895}  
Iteration 9:{space 2}Log likelihood = {res: -6699.173}  
Iteration 10:{space 1}Log likelihood = {res:-6697.7867}  
Iteration 11:{space 1}Log likelihood = {res:-6696.7607}  
Iteration 12:{space 1}Log likelihood = {res:-6696.1491}  
Iteration 13:{space 1}Log likelihood = {res:-6695.2921}  
Iteration 14:{space 1}Log likelihood = {res:-6694.4246}  
Iteration 15:{space 1}Log likelihood = {res:-6693.9171}  
Iteration 16:{space 1}Log likelihood = {res:-6693.2759}  
Iteration 17:{space 1}Log likelihood = {res: -6692.399}  
Iteration 18:{space 1}Log likelihood = {res:-6691.9821}  
Iteration 19:{space 1}Log likelihood = {res:-6691.6265}  
Iteration 20:{space 1}Log likelihood = {res:-6691.2843}  
Iteration 21:{space 1}Log likelihood = {res:-6690.8314}  
Iteration 22:{space 1}Log likelihood = {res:-6690.7369}  
Iteration 23:{space 1}Log likelihood = {res:-6690.5751}  
Iteration 24:{space 1}Log likelihood = {res:-6690.4485}  
Iteration 25:{space 1}Log likelihood = {res:-6690.3944}  
Iteration 26:{space 1}Log likelihood = {res:-6690.3753}  
Iteration 27:{space 1}Log likelihood = {res:-6690.3672}  
Iteration 28:{space 1}Log likelihood = {res:-6690.3619}  
Iteration 29:{space 1}Log likelihood = {res:-6690.3618}  
Iteration 30:{space 1}Log likelihood = {res:-6690.3612}  
Iteration 31:{space 1}Log likelihood = {res:-6690.3612}  
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-6690.3612}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0054234{col 26}{space 2} .0191149{col 37}{space 1}    0.28{col 46}{space 3}0.777{col 55}{space 3}-.0320411{col 67}{space 3} .0428878
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .0376923{col 26}{space 2} .0202042{col 37}{space 1}    1.87{col 46}{space 3}0.062{col 55}{space 3}-.0019072{col 67}{space 3} .0772918
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3542817{col 26}{space 2} .0407534{col 37}{space 1}   -8.69{col 46}{space 3}0.000{col 55}{space 3} -.434157{col 67}{space 3}-.2744065
{col 1}{text}         AGE{col 14}{c |}{result}{space 2} .0026636{col 26}{space 2} .0097564{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 55}{space 3}-.0164586{col 67}{space 3} .0217857
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2038194{col 26}{space 2} .1108869{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 55}{space 3}-.4211538{col 67}{space 3} .0135149
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0015703{col 26}{space 2} .0206695{col 37}{space 1}    0.08{col 46}{space 3}0.939{col 55}{space 3}-.0389412{col 67}{space 3} .0420818
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0751983{col 26}{space 2} .0419015{col 37}{space 1}   -1.79{col 46}{space 3}0.073{col 55}{space 3}-.1573238{col 67}{space 3} .0069272
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}-16.46759{col 26}{space 2} 2.254288{col 37}{space 1}   -7.31{col 46}{space 3}0.000{col 55}{space 3}-20.88591{col 67}{space 3}-12.04926
{col 1}{text}  log(gamma){col 14}{c |}{result}{space 2} 1.426776{col 26}{space 2} .1458787{col 37}{space 1}    9.78{col 46}{space 3}0.000{col 55}{space 3} 1.140859{col 67}{space 3} 1.712693
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}
{com}. 
. 
. **RP**
. stmerlin ztownsend zLE8_TOTALSCOREinv SEX AGE NonWhite householdsize SESres if sample_final==1 & _trans6==1, distribution(rp) df(3) tvc(AGE) dftvc(1) nolog
{txt}note; a delayed entry model is being fitted
Obtaining initial values
{res}variables created for model 1, component 8: _cmp_1_8_1 to _cmp_1_8_1
variables created: _rcs1_1 to _rcs1_3

{txt}Fitting full model:
{res}
{txt}{col 1}Survival model{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:5,733}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-6689.7386}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{col 1}{result}_t:         {col 14}{text}{c |}{col 26} 
{res}{col 1}{text}   ztownsend{col 14}{c |}{result}{space 2} .0050798{col 26}{space 2} .0191274{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 55}{space 3}-.0324091{col 67}{space 3} .0425687
{col 1}{text}zLE8_TO~Einv{col 14}{c |}{result}{space 2} .0374015{col 26}{space 2} .0202133{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 55}{space 3}-.0022158{col 67}{space 3} .0770188
{col 1}{text}         SEX{col 14}{c |}{result}{space 2}-.3542701{col 26}{space 2} .0407582{col 37}{space 1}   -8.69{col 46}{space 3}0.000{col 55}{space 3}-.4341547{col 67}{space 3}-.2743854
{col 1}{text}         AGE{col 14}{c |}{result}{space 2}-.0003325{col 26}{space 2} .0211349{col 37}{space 1}   -0.02{col 46}{space 3}0.987{col 55}{space 3}-.0417561{col 67}{space 3} .0410911
{col 1}{text}    NonWhite{col 14}{c |}{result}{space 2}-.2042642{col 26}{space 2} .1109431{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 55}{space 3}-.4217087{col 67}{space 3} .0131804
{col 1}{text}households~e{col 14}{c |}{result}{space 2} .0014532{col 26}{space 2} .0206936{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 55}{space 3}-.0391056{col 67}{space 3}  .042012
{col 1}{text}      SESres{col 14}{c |}{result}{space 2}-.0740392{col 26}{space 2} .0419211{col 37}{space 1}   -1.77{col 46}{space 3}0.077{col 55}{space 3}-.1562031{col 67}{space 3} .0081247
{col 1}{text}   AGE#rcs(){col 14}{c |}{result}{space 2} 5.53e-06{col 26}{space 2} .0000426{col 37}{space 1}    0.13{col 46}{space 3}0.897{col 55}{space 3} -.000078{col 67}{space 3}  .000089
{col 1}{text}       _cons{col 14}{c |}{result}{space 2}  6.41854{col 26}{space 2} 3.414876{col 37}{space 1}    1.88{col 46}{space 3}0.060{col 55}{space 3}-.2744946{col 67}{space 3} 13.11157
{col 1}{text}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 9}{hline 12}{hline 12}
{res}{txt}    Warning: Baseline spline coefficients not shown - use ml display
{res}{txt}
{com}. 
. 
. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}